#  holidays
#  --------
#  A fast, efficient Python library for generating country, province and state
#  specific sets of holidays on the fly. It aims to make determining whether a
#  specific date is a holiday as fast and flexible as possible.
#
#  Authors: Vacanza Team and individual contributors (see CONTRIBUTORS file)
#           dr-prodigy <dr.prodigy.github@gmail.com> (c) 2017-2023
#           ryanss <ryanssdev@icloud.com> (c) 2014-2017
#  Website: https://github.com/vacanza/holidays
#  License: MIT (see LICENSE file)

import warnings
from unittest import TestCase

from holidays.constants import OPTIONAL
from holidays.countries.india import India
from tests.common import CommonCountryTests


class TestIndia(CommonCountryTests, TestCase):
    @classmethod
    def setUpClass(cls):
        warnings.simplefilter("ignore")
        super().setUpClass(India)

    def setUp(self):
        super().setUp()
        warnings.simplefilter("ignore")

    def test_subdiv_deprecation(self):
        self.assertDeprecatedSubdivisions("This subdivision is deprecated and will be removed")

    def test_2018(self):
        self.assertHolidayDatesInYear(
            2018,
            "2018-01-26",
            "2018-02-13",
            "2018-03-29",
            "2018-03-30",
            "2018-04-30",
            "2018-06-16",
            "2018-08-15",
            "2018-08-22",
            "2018-09-03",
            "2018-09-21",
            "2018-10-02",
            "2018-10-19",
            "2018-11-07",
            "2018-11-21",
            "2018-11-23",
            "2018-12-25",
        )

        subdiv_holidays_mapping = {
            "AN": (
                "2018-03-25",
                "2018-04-14",
                "2018-08-24",
            ),
            "AP": (
                "2018-04-14",
                "2018-11-01",
            ),
            "AS": (
                "2018-01-14",
                "2018-12-02",
            ),
            "BR": (
                "2018-03-22",
                "2018-04-14",
                "2018-11-13",
            ),
            "CG": (
                "2018-04-14",
                "2018-11-01",
            ),
            "CH": ("2018-04-14",),
            "DL": ("2018-11-13",),
            "GA": (
                "2018-04-14",
                "2018-12-19",
            ),
            "GJ": (
                "2018-01-14",
                "2018-04-14",
                "2018-05-01",
                "2018-10-31",
            ),
            "HP": (
                "2018-04-14",
                "2018-04-15",
            ),
            "HR": (
                "2018-04-14",
                "2018-11-01",
            ),
            "JH": (
                "2018-04-14",
                "2018-11-13",
                "2018-11-15",
            ),
            "JK": ("2018-04-14",),
            "KA": (
                "2018-04-14",
                "2018-11-01",
            ),
            "KL": (
                "2018-04-14",
                "2018-08-24",
                "2018-11-01",
            ),
            "LA": ("2018-04-14",),
            "MH": (
                "2018-02-19",
                "2018-03-18",
                "2018-04-14",
                "2018-05-01",
            ),
            "MP": (
                "2018-04-14",
                "2018-11-01",
            ),
            "MZ": ("2018-02-20",),
            "NL": ("2018-12-01",),
            "OD": (
                "2018-04-01",
                "2018-04-14",
                "2018-04-15",
            ),
            "PB": (
                "2018-01-13",
                "2018-04-14",
                "2018-11-01",
            ),
            "PY": (
                "2018-04-14",
                "2018-08-16",
                "2018-11-01",
            ),
            "RJ": (
                "2018-03-30",
                "2018-04-14",
                "2018-06-16",
            ),
            "SK": (
                "2018-04-14",
                "2018-05-16",
            ),
            "TN": (
                "2018-01-14",
                "2018-01-15",
                "2018-01-16",
                "2018-04-14",
            ),
            "TS": (
                "2018-04-14",
                "2018-06-02",
                "2018-10-08",
            ),
            "UK": ("2018-04-14",),
            "UP": (
                "2018-01-24",
                "2018-04-14",
                "2018-11-13",
            ),
            "WB": (
                "2018-04-14",
                "2018-04-15",
                "2018-05-09",
            ),
        }

        for subdiv, holidays in subdiv_holidays_mapping.items():
            self.assertHoliday(India(subdiv=subdiv), holidays)

    def test_2018_optional(self):
        self.assertOptionalHolidayDatesInYear(
            2018,
            "2018-01-14",
            "2018-03-02",
            "2018-03-25",
            "2018-04-01",
            "2018-05-01",
            "2018-08-26",
            "2018-09-13",
            "2018-10-10",
            "2018-10-17",
            "2018-11-08",
            "2018-11-14",
        )

    def test_ranged_holidays(self):
        warnings.simplefilter("always")
        for year in (2000, 2036):  # Holidays out of range.
            with self.assertWarns(Warning):
                India(years=year)

        name = "Bakrid"
        dt = (
            "2001-03-06",
            "2010-11-17",
            "2025-06-07",
        )
        self.assertHolidayName(name, dt)

        name = "Buddha Purnima"
        dt = (
            "2001-04-30",
            "2010-05-27",
            "2025-05-12",
            "2035-05-22",
        )
        self.assertHolidayName(name, dt)

        name = "Diwali"
        dt = (
            "2001-11-14",
            "2010-11-05",
            "2025-10-20",
            "2035-10-30",
        )
        self.assertHolidayName(name, dt)

        name = "Dussehra"
        dt = (
            "2001-10-26",
            "2010-10-17",
            "2025-10-02",
            "2035-10-11",
        )
        self.assertHolidayName(name, dt)

        name = "Guru Nanak Jayanti"
        dt = (
            "2001-11-30",
            "2010-11-21",
            "2025-11-05",
            "2035-11-15",
        )
        self.assertHolidayName(name, dt)

        name = "Id-ul-Fitr"
        dt = (
            "2001-12-17",
            "2010-09-10",
            "2025-03-31",
        )
        self.assertHolidayName(name, dt)

        name = "Janmashtami"
        dt = (
            "2001-08-12",
            "2010-09-02",
            "2025-08-16",
            "2035-08-26",
        )
        self.assertHolidayName(name, dt)

        name = "Mahavir Jayanti"
        dt = (
            "2001-04-06",
            "2010-04-28",
            "2025-04-10",
            "2035-04-20",
        )
        self.assertHolidayName(name, dt)

        name = "Maha Shivaratri"
        dt = (
            "2001-02-21",
            "2010-02-12",
            "2025-02-26",
            "2035-03-08",
        )
        self.assertHolidayName(name, dt)

        name = "Milad-un-Nabi"
        dt = (
            "2001-06-05",
            "2010-02-27",
            "2025-09-05",
        )
        self.assertHolidayName(name, dt)

        name = "Muharram"
        dt = (
            "2001-04-04",
            "2010-12-17",
            "2025-07-06",
        )
        self.assertHolidayName(name, dt)

    def test_ranged_subdiv_holidays(self):
        dt = (
            "2018-08-06",
            "2019-07-29",
            "2020-07-20",
            "2021-08-02",
            "2022-07-25",
            "2023-07-17",
            "2024-07-29",
            "2025-07-21",
            "2026-08-10",
            "2027-08-02",
        )
        name = "Bonalu"
        for subdiv in ("TS",):
            self.assertHolidayName(name, India(subdiv=subdiv), dt)

        dt = (
            "2001-01-14",
            "2010-01-14",
            "2025-01-14",
            "2035-01-15",
        )
        name = "Magh Bihu"
        for subdiv in India.subdivisions:
            if subdiv in {"AS"}:
                self.assertHolidayName(name, India(subdiv=subdiv), dt)
            else:
                self.assertNoHolidayName(name, India(subdiv=subdiv), dt)

        dt = (
            "2001-01-14",
            "2010-01-14",
            "2025-01-14",
            "2035-01-15",
        )
        name = "Uttarayan"
        for subdiv in India.subdivisions:
            if subdiv in {"GJ"}:
                self.assertHolidayName(name, India(subdiv=subdiv), dt)
            else:
                self.assertNoHolidayName(name, India(subdiv=subdiv), dt)

        dt = (
            "2001-11-21",
            "2010-11-11",
            "2025-10-28",
            "2035-11-06",
        )
        name = "Chhath Puja"
        for subdiv in India.subdivisions:
            if subdiv in {"BR", "DL", "JH", "UP"}:
                self.assertHolidayName(name, India(subdiv=subdiv), dt)
            else:
                self.assertNoHolidayName(name, India(subdiv=subdiv), dt)

        dt = (
            "2001-08-31",
            "2010-08-23",
            "2025-09-05",
            "2035-09-14",
        )
        name = "Onam"
        for subdiv in India.subdivisions:
            if subdiv in {"AN", "KL"}:
                self.assertHolidayName(name, India(subdiv=subdiv), dt)
            else:
                self.assertNoHolidayName(name, India(subdiv=subdiv), dt)

        dt = (
            "2001-03-26",
            "2010-03-16",
            "2025-03-30",
            "2035-04-09",
        )
        name = "Gudi Padwa"
        for subdiv in India.subdivisions:
            if subdiv in {"MH"}:
                self.assertHolidayName(name, India(subdiv=subdiv), dt)
            else:
                self.assertNoHolidayName(name, India(subdiv=subdiv), dt)

        dt = (
            "2001-01-02",
            "2010-01-05",
            "2025-01-06",
            "2025-12-27",
            "2035-01-16",
        )
        name = "Guru Gobind Singh Jayanti"
        for subdiv in India.subdivisions:
            if subdiv in {"PB"}:
                self.assertHolidayName(name, India(subdiv=subdiv), dt)
            else:
                self.assertNoHolidayName(name, India(subdiv=subdiv), dt)

        dt = (
            "2001-04-13",
            "2010-04-14",
            "2025-04-13",
            "2035-04-14",
        )
        name = "Vaisakhi"
        for subdiv in India.subdivisions:
            if subdiv in {"PB"}:
                self.assertHolidayName(name, India(subdiv=subdiv), dt)
            else:
                self.assertNoHolidayName(name, India(subdiv=subdiv), dt)

        dt = (
            "2001-01-14",
            "2010-01-14",
            "2025-01-14",
            "2035-01-15",
        )
        name = "Pongal"
        for subdiv in India.subdivisions:
            if subdiv in {"TN"}:
                self.assertHolidayName(name, India(subdiv=subdiv), dt)
            else:
                self.assertNoHolidayName(name, India(subdiv=subdiv), dt)

        dt = (
            "2001-01-15",
            "2010-01-15",
            "2025-01-15",
            "2035-01-16",
        )
        name = "Thiruvalluvar Day / Mattu Pongal"
        for subdiv in India.subdivisions:
            if subdiv in {"TN"}:
                self.assertHolidayName(name, India(subdiv=subdiv), dt)
            else:
                self.assertNoHolidayName(name, India(subdiv=subdiv), dt)

        dt = (
            "2001-01-16",
            "2010-01-16",
            "2025-01-16",
            "2035-01-17",
        )
        name = "Uzhavar Thirunal"
        for subdiv in India.subdivisions:
            if subdiv in {"TN"}:
                self.assertHolidayName(name, India(subdiv=subdiv), dt)
            else:
                self.assertNoHolidayName(name, India(subdiv=subdiv), dt)

    def test_ranged_optional_holidays(self):
        opt_holidays = India(categories=OPTIONAL, years=range(2001, 2036))

        name = "Holi"
        dt = (
            "2001-03-10",
            "2010-03-01",
            "2025-03-14",
            "2035-03-24",
        )
        self.assertHolidayName(name, opt_holidays, dt)

        # MH.
        self.assertNoHolidayName(
            name, India(categories=OPTIONAL, subdiv="MH", years=range(2001, 2036))
        )
        self.assertSubdivMhHolidayName(name, range(2001, 2036))
        self.assertSubdivMhHolidayName(name, "2026-03-03")
        self.assertNoSubdivMhHolidayName(name, "2026-03-04")

        name = "Ganesh Chaturthi"
        dt = (
            "2001-08-22",
            "2010-09-11",
            "2025-08-27",
            "2035-09-05",
        )
        self.assertHolidayName(name, opt_holidays, dt)

        name = "Govardhan Puja"
        dt = (
            "2001-11-15",
            "2010-11-06",
            "2025-10-22",
            "2035-10-31",
        )
        self.assertHolidayName(name, opt_holidays, dt)

        name = "Maha Navami"
        dt = (
            "2001-10-25",
            "2010-10-16",
            "2025-10-01",
            "2035-10-10",
        )
        self.assertHolidayName(name, opt_holidays, dt)

        name = "Makar Sankranti"
        dt = (
            "2001-01-14",
            "2010-01-14",
            "2025-01-14",
            "2035-01-15",
        )
        self.assertHolidayName(name, opt_holidays, dt)

        name = "Navratri / Sharad Navratri"
        dt = (
            "2001-10-17",
            "2010-10-08",
            "2025-09-22",
            "2035-10-02",
        )
        self.assertHolidayName(name, opt_holidays, dt)

        name = "Raksha Bandhan"
        dt = (
            "2001-08-04",
            "2010-08-24",
            "2025-08-09",
            "2035-08-18",
        )
        self.assertHolidayName(name, opt_holidays, dt)

        name = "Ram Navami"
        dt = (
            "2001-04-02",
            "2010-03-24",
            "2025-04-06",
            "2035-04-16",
        )
        self.assertHolidayName(name, opt_holidays, dt)

    def test_pre_1947(self):
        self.assertNoHoliday("1946-08-15")

    def test_pre_1950(self):
        self.assertNoHoliday("1949-01-26")

    def test_good_friday(self):
        self.assertHoliday(
            "1994-04-01",
            "2017-04-14",
            "2020-04-10",
        )

    def test_easter_sunday(self):
        self.assertHoliday(
            India(categories=OPTIONAL),
            "1994-04-03",
            "2017-04-16",
            "2020-04-12",
        )

    def test_palm_sunday(self):
        self.assertHoliday(
            India(categories=OPTIONAL),
            "1994-03-27",
            "2017-04-09",
            "2020-04-05",
        )

    def test_parsi_new_year(self):
        name = "Parsi New Year (Shahenshahi)"
        self.assertNoHolidayName(name)

        dt = (
            "1972-08-28",
            "2019-08-17",
            "2020-08-16",
            "2021-08-16",
            "2022-08-16",
            "2023-08-16",
            "2024-08-15",
            "2025-08-15",
        )
        for subdiv in India.subdivisions:
            if subdiv in {"GJ", "MH"}:
                self.assertHolidayName(name, India(subdiv=subdiv), dt)
            else:
                self.assertNoHolidayName(name, India(subdiv=subdiv), dt)

    def test_l10n_default(self):
        self.assertLocalizedHolidays(
            ("2018-01-13", "Lohri"),
            ("2018-01-14", "Magh Bihu; Makar Sankranti; Pongal; Uttarayan"),
            ("2018-01-15", "Thiruvalluvar Day / Mattu Pongal"),
            ("2018-01-16", "Uzhavar Thirunal"),
            ("2018-01-24", "UP Formation Day"),
            ("2018-01-26", "Republic Day"),
            ("2018-02-13", "Maha Shivaratri"),
            ("2018-02-19", "Chhatrapati Shivaji Maharaj Jayanti"),
            ("2018-02-20", "Mizoram State Day"),
            ("2018-03-02", "Holi"),
            ("2018-03-18", "Gudi Padwa; Ugadi"),
            ("2018-03-22", "Bihar Day"),
            ("2018-03-25", "Palm Sunday; Ram Navami"),
            ("2018-03-29", "Mahavir Jayanti"),
            ("2018-03-30", "Good Friday; Rajasthan Day"),
            ("2018-04-01", "Easter Sunday; Odisha Day (Utkala Dibasa)"),
            ("2018-04-14", "Dr. B. R. Ambedkar's Jayanti; Puthandu (Tamil New Year); Vaisakhi"),
            (
                "2018-04-15",
                "Himachal Day; Maha Vishuva Sankranti / Pana Sankranti; Pohela Boishakh",
            ),
            ("2018-04-30", "Buddha Purnima"),
            ("2018-05-01", "Gujarat Day; Labour Day; Maharashtra Day"),
            ("2018-05-09", "Rabindra Jayanti"),
            ("2018-05-16", "Sikkim State Day"),
            ("2018-06-02", "Telangana Formation Day"),
            ("2018-06-16", "Id-ul-Fitr; Maharana Pratap Jayanti"),
            ("2018-08-06", "Bonalu"),
            ("2018-08-15", "Independence Day"),
            ("2018-08-16", "Puducherry De Jure Transfer Day"),
            ("2018-08-17", "Parsi New Year (Shahenshahi)"),
            ("2018-08-22", "Bakrid"),
            ("2018-08-24", "Onam"),
            ("2018-08-26", "Raksha Bandhan"),
            ("2018-09-03", "Janmashtami"),
            ("2018-09-13", "Ganesh Chaturthi"),
            ("2018-09-21", "Muharram"),
            ("2018-10-02", "Gandhi Jayanti"),
            ("2018-10-08", "Bathukamma Festival"),
            ("2018-10-10", "Navratri / Sharad Navratri"),
            ("2018-10-17", "Maha Navami"),
            ("2018-10-19", "Dussehra"),
            ("2018-10-31", "Sardar Vallabhbhai Patel Jayanti"),
            (
                "2018-11-01",
                "Andhra Pradesh Foundation Day; "
                "Chhattisgarh Foundation Day; "
                "Haryana Foundation Day; "
                "Karnataka Rajyotsava; Kerala Foundation Day; "
                "Madhya Pradesh Foundation Day; "
                "New Punjab Day; "
                "Puducherry Liberation Day",
            ),
            ("2018-11-07", "Diwali"),
            ("2018-11-08", "Govardhan Puja"),
            ("2018-11-13", "Chhath Puja"),
            ("2018-11-14", "Children's Day"),
            ("2018-11-15", "Jharkhand Formation Day"),
            ("2018-11-21", "Milad-un-Nabi"),
            ("2018-11-23", "Guru Nanak Jayanti"),
            ("2018-12-01", "Nagaland State Inauguration Day"),
            ("2018-12-02", "Assam Day"),
            ("2018-12-19", "Goa Liberation Day"),
            ("2018-12-25", "Christmas"),
        )

    def test_l10n_bn(self):
        self.assertLocalizedHolidays(
            "bn",
            ("2018-01-13", "লোহরি"),
            ("2018-01-14", "উত্তরায়ণ; পোঙ্গল; মকর সংক্রান্তি; মাঘ বিহু"),
            ("2018-01-15", "তিরুভাল্লুভার দিবস / মাট্টু পোঙ্গল"),
            ("2018-01-16", "উঝাভার থিরুনাল"),
            ("2018-01-24", "উত্তরপ্রদেশ গঠন দিবস"),
            ("2018-01-26", "প্রজাতন্ত্র দিবস"),
            ("2018-02-13", "মহাশিবরাত্রি"),
            ("2018-02-19", "ছত্রপতি শিবাজী মহারাজ জয়ন্তী"),
            ("2018-02-20", "মিজোরাম প্রতিষ্ঠা দিবস"),
            ("2018-03-02", "হোলি"),
            ("2018-03-18", "উগাদি; গুড়ি পাড়ওয়া"),
            ("2018-03-22", "বিহার দিবস"),
            ("2018-03-25", "পাম রবিবার; রাম নবমী"),
            ("2018-03-29", "মহাবীর জয়ন্তী"),
            ("2018-03-30", "গুড ফ্রাইডে; রাজস্থান দিবস"),
            ("2018-04-01", "ইস্টার রবিবার; ওড়িশা দিবস (উৎকল দিবস)"),
            ("2018-04-14", "ড. বি. আর. আম্বেদকর জয়ন্তী; পুত্থান্ডু (তামিল নববর্ষ); বৈশাখী"),
            (
                "2018-04-15",
                "পহেলা বৈশাখ; মহা বিষুব সংক্রান্তি / পানা সংক্রান্তি; হিমাচল দিবস",
            ),
            ("2018-04-30", "বুদ্ধ পূর্ণিমা"),
            ("2018-05-01", "গুজরাট দিবস; মহারাষ্ট্র দিবস; শ্রমিক দিবস"),
            ("2018-05-09", "রবীন্দ্র জয়ন্তী"),
            ("2018-05-16", "সিকিম প্রতিষ্ঠা দিবস"),
            ("2018-06-02", "তেলেঙ্গানা গঠন দিবস"),
            ("2018-06-16", "ঈদ-উল-ফিতর; মহারানা প্রতাপ জয়ন্তী"),
            ("2018-08-06", "বোনালু"),
            ("2018-08-15", "স্বাধীনতা দিবস"),
            ("2018-08-16", "পুদুচেরি আইনি হস্তান্তর দিবস"),
            ("2018-08-17", "পারসি নববর্ষ (শাহেনশাহী)"),
            ("2018-08-22", "বকরিদ"),
            ("2018-08-24", "ওনাম"),
            ("2018-08-26", "রাখি বন্ধন"),
            ("2018-09-03", "জন্মাষ্টমী"),
            ("2018-09-13", "গণেশ চতুর্থী"),
            ("2018-09-21", "মহরম"),
            ("2018-10-02", "গান্ধী জয়ন্তী"),
            ("2018-10-08", "বাথুকাম্মা উৎসব"),
            ("2018-10-10", "নবরাত্রি / শারদ নবরাত্রি"),
            ("2018-10-17", "মহানবমী"),
            ("2018-10-19", "বিজয়া দশমী"),
            ("2018-10-31", "সরদার বল্লভভাই প্যাটেল জয়ন্তী"),
            (
                "2018-11-01",
                "অন্ধ্রপ্রদেশ প্রতিষ্ঠা দিবস; "
                "কর্ণাটক রাজ্যোৎসব; কেরালা প্রতিষ্ঠা দিবস; "
                "ছত্তিশগড় প্রতিষ্ঠা দিবস; নতুন পাঞ্জাব দিবস; "
                "পুদুচেরি মুক্তি দিবস; মধ্যপ্রদেশ প্রতিষ্ঠা দিবস; "
                "হরিয়ানা প্রতিষ্ঠা দিবস",
            ),
            ("2018-11-07", "দীপাবলি"),
            ("2018-11-08", "গোবর্ধন পূজা"),
            ("2018-11-13", "ছঠ পূজা"),
            ("2018-11-14", "শিশু দিবস"),
            ("2018-11-15", "ঝাড়খণ্ড গঠন দিবস"),
            ("2018-11-21", "মিলাদ-উন-নবী"),
            ("2018-11-23", "গুরু নানক জয়ন্তী"),
            ("2018-12-01", "নাগাল্যান্ড প্রতিষ্ঠা দিবস"),
            ("2018-12-02", "অসম দিবস"),
            ("2018-12-19", "গোয়া মুক্তি দিবস"),
            ("2018-12-25", "বড়দিন"),
        )

    def test_l10n_gu(self):
        self.assertLocalizedHolidays(
            "gu",
            ("2018-01-13", "લોહરી"),
            ("2018-01-14", "ઉત્તરાયણ; પોંગલ; મકરસંક્રાંતિ; માઘ બિહુ"),
            ("2018-01-15", "તિરુવલ્લુવર દિવસ / મટ્ટુ પોંગલ"),
            ("2018-01-16", "ઉઝાવર થિરુનલ"),
            ("2018-01-24", "યુપી સ્થાપના દિવસ"),
            ("2018-01-26", "પ્રજાસત્તાક દિવસ"),
            ("2018-02-13", "મહાશિવરાત્રી"),
            ("2018-02-19", "છત્રપતિ શિવાજી મહારાજ જયંતિ"),
            ("2018-02-20", "મિઝોરમ રાજ્ય દિવસ"),
            ("2018-03-02", "હોળી"),
            ("2018-03-18", "ઉગાડી; ગુડી પડવો"),
            ("2018-03-22", "બિહાર દિવસ"),
            ("2018-03-25", "પામ સન્ડે; રામ નવમી"),
            ("2018-03-29", "મહાવીર જયંતિ"),
            ("2018-03-30", "ગુડ ફ્રાઈડે; રાજસ્થાન દિવસ"),
            ("2018-04-01", "ઈસ્ટર સન્ડે; ઓડિશા દિવસ (ઉત્કલ દિવસ)"),
            ("2018-04-14", "ડૉ. બી. આર. આંબેડકર જયંતિ; પુથંડુ (તમિલ નવું વર્ષ); વૈશાખી"),
            ("2018-04-15", "પોહેલા બોઈશાખ; મહા વિષુવ સંક્રાંતિ / પાના સંક્રાંતિ; હિમાચલ દિવસ"),
            ("2018-04-30", "બુદ્ધ પૂર્ણિમા"),
            ("2018-05-01", "ગુજરાત સ્થાપના દિવસ; મજૂર દિવસ; મહારાષ્ટ્ર દિવસ"),
            ("2018-05-09", "રવીન્દ્ર જયંતિ"),
            ("2018-05-16", "સિક્કિમ રાજ્ય દિવસ"),
            ("2018-06-02", "તેલંગાણા સ્થાપના દિવસ"),
            ("2018-06-16", "ઈદ-ઉલ-ફિત્ર; મહારાણા પ્રતાપ જયંતિ"),
            ("2018-08-06", "બોનાલુ"),
            ("2018-08-15", "સ્વતંત્રતા દિવસ"),
            ("2018-08-16", "પુડુચેરી ડી જ્યુર ટ્રાન્સફર દિવસ"),
            ("2018-08-17", "પારસી નવું વર્ષ (શાહેનશાહી)"),
            ("2018-08-22", "બકરી ઈદ"),
            ("2018-08-24", "ઓણમ"),
            ("2018-08-26", "રક્ષાબંધન"),
            ("2018-09-03", "જન્માષ્ટમી"),
            ("2018-09-13", "ગણેશ ચતુર્થી"),
            ("2018-09-21", "મોહરમ"),
            ("2018-10-02", "ગાંધી જયંતિ"),
            ("2018-10-08", "બથુકમ્મા ઉત્સવ"),
            ("2018-10-10", "નવરાત્રી / શરદ નવરાત્રી"),
            ("2018-10-17", "મહાનવમી"),
            ("2018-10-19", "દશેરા"),
            ("2018-10-31", "સરદાર વલ્લભભાઈ પટેલ જયંતિ"),
            (
                "2018-11-01",
                "આંધ્ર પ્રદેશ સ્થાપના દિવસ; "
                "કર્ણાટક રાજ્યોત્સવ; કેરળ સ્થાપના દિવસ; "
                "છત્તીસગઢ સ્થાપના દિવસ; નવો પંજાબ દિવસ; "
                "પુડુચેરી મુક્તિ દિવસ; મધ્ય પ્રદેશ સ્થાપના દિવસ; "
                "હરિયાણા સ્થાપના દિવસ",
            ),
            ("2018-11-07", "દિવાળી"),
            ("2018-11-08", "ગોવર્ધન પૂજા"),
            ("2018-11-13", "છઠ પૂજા"),
            ("2018-11-14", "બાળ દિવસ"),
            ("2018-11-15", "ઝારખંડ સ્થાપના દિવસ"),
            ("2018-11-21", "મિલાદ-ઉન-નબી"),
            ("2018-11-23", "ગુરુ નાનક જયંતિ"),
            ("2018-12-01", "નાગાલેન્ડ રાજ્ય ઉદ્ઘાટન દિવસ"),
            ("2018-12-02", "આસામ દિવસ"),
            ("2018-12-19", "ગોવા મુક્તિ દિવસ"),
            ("2018-12-25", "નાતાલ"),
        )

    def test_l10n_hi(self):
        self.assertLocalizedHolidays(
            "hi",
            ("2018-01-13", "लोहड़ी"),
            ("2018-01-14", "उत्तरायण; पोंगल; मकर संक्रांति; माघ बिहू"),
            ("2018-01-15", "तिरुवल्लुवर दिवस / मट्टू पोंगल"),
            ("2018-01-16", "उझावर थिरुनल"),
            ("2018-01-24", "यूपी स्थापना दिवस"),
            ("2018-01-26", "गणतंत्र दिवस"),
            ("2018-02-13", "महाशिवरात्रि"),
            ("2018-02-19", "छत्रपति शिवाजी महाराज जयंती"),
            ("2018-02-20", "मिज़ोरम राज्य दिवस"),
            ("2018-03-02", "होली"),
            ("2018-03-18", "उगादि; गुडी पाडवा"),
            ("2018-03-22", "बिहार दिवस"),
            ("2018-03-25", "पाम रविवार; रामनवमी"),
            ("2018-03-29", "महावीर जयंती"),
            ("2018-03-30", "गुड फ्राइडे; राजस्थान दिवस"),
            ("2018-04-01", "ईस्टर रविवार; ओडिशा दिवस (उत्कल दिवस)"),
            ("2018-04-14", "डॉ. बी.आर. आम्बेडकर जयंती; पुत्ताण्डु (तमिल नव वर्ष); वैसाखी"),
            ("2018-04-15", "पोहेला बोइशाख; महा विषुव संक्रांति / पण संक्रांति; हिमाचल दिवस"),
            ("2018-04-30", "बुद्ध पूर्णिमा"),
            ("2018-05-01", "गुजरात दिवस; मजदूर दिवस; महाराष्ट्र दिवस"),
            ("2018-05-09", "रवींद्र जयंती"),
            ("2018-05-16", "सिक्किम राज्य दिवस"),
            ("2018-06-02", "तेलंगाना स्थापना दिवस"),
            ("2018-06-16", "ईद-उल-फितर; महाराणा प्रताप जयंती"),
            ("2018-08-06", "बोनालु"),
            ("2018-08-15", "स्वतंत्रता दिवस"),
            ("2018-08-16", "पुडुचेरी डी ज्यूर स्थानांतरण दिवस"),
            ("2018-08-17", "पारसी नव वर्ष (शहंशाही)"),
            ("2018-08-22", "बकरीद"),
            ("2018-08-24", "ओणम"),
            ("2018-08-26", "रक्षाबंधन"),
            ("2018-09-03", "जन्माष्टमी"),
            ("2018-09-13", "गणेश चतुर्थी"),
            ("2018-09-21", "मुहर्रम"),
            ("2018-10-02", "गांधी जयंती"),
            ("2018-10-08", "बतुकम्मा महोत्सव"),
            ("2018-10-10", "नवरात्र / शरद नवरात्र"),
            ("2018-10-17", "महानवमी"),
            ("2018-10-19", "दशहरा"),
            ("2018-10-31", "सरदार वल्लभभाई पटेल जयंती"),
            (
                "2018-11-01",
                "आंध्र प्रदेश स्थापना दिवस; "
                "कर्नाटक राज्योत्सव; केरल स्थापना दिवस; "
                "छत्तीसगढ़ स्थापना दिवस; नया पंजाब दिवस; "
                "पुडुचेरी मुक्ति दिवस; मध्य प्रदेश स्थापना दिवस; "
                "हरियाणा स्थापना दिवस",
            ),
            ("2018-11-07", "दिवाली"),
            ("2018-11-08", "गोवर्धन पूजा"),
            ("2018-11-13", "छठ पूजा"),
            ("2018-11-14", "बाल दिवस"),
            ("2018-11-15", "झारखंड स्थापना दिवस"),
            ("2018-11-21", "मिलाद-उन-नबी"),
            ("2018-11-23", "गुरु नानक जयंती"),
            ("2018-12-01", "नागालैंड राज्य उद्घाटन दिवस"),
            ("2018-12-02", "असम दिवस"),
            ("2018-12-19", "गोवा मुक्ति दिवस"),
            ("2018-12-25", "क्रिसमस"),
        )

    def test_l10n_en_us(self):
        self.assertLocalizedHolidays(
            "en_US",
            ("2018-01-13", "Lohri"),
            ("2018-01-14", "Magh Bihu; Makar Sankranti; Pongal; Uttarayan"),
            ("2018-01-15", "Thiruvalluvar Day / Mattu Pongal"),
            ("2018-01-16", "Uzhavar Thirunal"),
            ("2018-01-24", "UP Formation Day"),
            ("2018-01-26", "Republic Day"),
            ("2018-02-13", "Maha Shivaratri"),
            ("2018-02-19", "Chhatrapati Shivaji Maharaj Jayanti"),
            ("2018-02-20", "Mizoram State Day"),
            ("2018-03-02", "Holi"),
            ("2018-03-18", "Gudi Padwa; Ugadi"),
            ("2018-03-22", "Bihar Day"),
            ("2018-03-25", "Palm Sunday; Ram Navami"),
            ("2018-03-29", "Mahavir Jayanti"),
            ("2018-03-30", "Good Friday; Rajasthan Day"),
            ("2018-04-01", "Easter Sunday; Odisha Day (Utkala Dibasa)"),
            ("2018-04-14", "Dr. B. R. Ambedkar's Jayanti; Puthandu (Tamil New Year); Vaisakhi"),
            (
                "2018-04-15",
                "Himachal Day; Maha Vishuva Sankranti / Pana Sankranti; Pohela Boishakh",
            ),
            ("2018-04-30", "Buddha Purnima"),
            ("2018-05-01", "Gujarat Day; Labor Day; Maharashtra Day"),
            ("2018-05-09", "Rabindra Jayanti"),
            ("2018-05-16", "Sikkim State Day"),
            ("2018-06-02", "Telangana Formation Day"),
            ("2018-06-16", "Eid al-Fitr; Maharana Pratap Jayanti"),
            ("2018-08-06", "Bonalu"),
            ("2018-08-15", "Independence Day"),
            ("2018-08-16", "Puducherry De Jure Transfer Day"),
            ("2018-08-17", "Parsi New Year (Shahenshahi)"),
            ("2018-08-22", "Eid al-Adha"),
            ("2018-08-24", "Onam"),
            ("2018-08-26", "Raksha Bandhan"),
            ("2018-09-03", "Janmashtami"),
            ("2018-09-13", "Ganesh Chaturthi"),
            ("2018-09-21", "Ashura"),
            ("2018-10-02", "Gandhi Jayanti"),
            ("2018-10-08", "Bathukamma Festival"),
            ("2018-10-10", "Navratri / Sharad Navratri"),
            ("2018-10-17", "Maha Navami"),
            ("2018-10-19", "Dussehra"),
            ("2018-10-31", "Sardar Vallabhbhai Patel Jayanti"),
            (
                "2018-11-01",
                "Andhra Pradesh Foundation Day; "
                "Chhattisgarh Foundation Day; "
                "Haryana Foundation Day; "
                "Karnataka Rajyotsava; Kerala Foundation Day; "
                "Madhya Pradesh Foundation Day; "
                "New Punjab Day; "
                "Puducherry Liberation Day",
            ),
            ("2018-11-07", "Diwali"),
            ("2018-11-08", "Govardhan Puja"),
            ("2018-11-13", "Chhath Puja"),
            ("2018-11-14", "Children's Day"),
            ("2018-11-15", "Jharkhand Formation Day"),
            ("2018-11-21", "Prophet's Birthday"),
            ("2018-11-23", "Guru Nanak Jayanti"),
            ("2018-12-01", "Nagaland State Inauguration Day"),
            ("2018-12-02", "Assam Day"),
            ("2018-12-19", "Goa Liberation Day"),
            ("2018-12-25", "Christmas"),
        )

    def test_l10n_kn(self):
        self.assertLocalizedHolidays(
            "kn",
            ("2018-01-13", "ಲೋಹ್ರಿ"),
            ("2018-01-14", "ಉತ್ತರಾಯಣ; ಪೊಂಗಲ್; ಮಕರ ಸಂಕ್ರಾಂತಿ; ಮಾಘ್ ಬಿಹು"),
            ("2018-01-15", "ತಿರುವಳ್ಳುವರ್ ದಿನೋತ್ಸವ / ಮಟ್ಟು ಪೊಂಗಲ್"),
            ("2018-01-16", "ಉಳವರ್ ತಿರುನಾಲ್"),
            ("2018-01-24", "ಉತ್ತರ ಪ್ರದೇಶ ಸ್ಥಾಪನಾ ದಿನ"),
            ("2018-01-26", "ಗಣರಾಜ್ಯೋತ್ಸವ"),
            ("2018-02-13", "ಮಹಾ ಶಿವರಾತ್ರಿ"),
            ("2018-02-19", "ಛತ್ರಪತಿ ಶಿವಾಜಿ ಮಹಾರಾಜ್ ಜಯಂತಿ"),
            ("2018-02-20", "ಮಿಜೋರಾಂ ರಾಜ್ಯ ದಿನೋತ್ಸವ"),
            ("2018-03-02", "ಹೋಳಿ ಹಬ್ಬ"),
            ("2018-03-18", "ಗುಡಿ ಪಾಡ್ವ; ಯುಗಾದಿ ಹಬ್ಬ"),
            ("2018-03-22", "ಬಿಹಾರ್ ದಿನೋತ್ಸವ"),
            ("2018-03-25", "ಪಾಮ್ ಭಾನುವಾರ; ಶ್ರೀ ರಾಮನವಮಿ"),
            ("2018-03-29", "ಮಹಾವೀರ ಜಯಂತಿ"),
            ("2018-03-30", "ಗುಡ್ ಫ್ರೈಡೆ; ರಾಜಸ್ಥಾನ ದಿನೋತ್ಸವ"),
            ("2018-04-01", "ಈಸ್ಟರ್ ಭಾನುವಾರ; ಒಡಿಶಾ ದಿನೋತ್ಸವ (ಉತ್ಕಲ ದಿವಸ)"),
            ("2018-04-14", "ಡಾ|| ಬಿ.ಆರ್.ಅಂಬೇಡ್ಕರ್ ಜಯಂತಿ; ಪುತ್ತಾಂಡು (ತಮಿಳು ಹೊಸ ವರ್ಷ); ವೈಶಾಖಿ"),
            (
                "2018-04-15",
                "ಪೊಹೆಲಾ ಬೊಯಿಶಾಖ್; ಮಹಾ ವಿಷುವ ಸಂಕ್ರಾಂತಿ / ಪನ ಸಂಕ್ರಾಂತಿ; ಹಿಮಾಚಲ್ ದಿನೋತ್ಸವ",
            ),
            ("2018-04-30", "ಬುದ್ಧ ಪೂರ್ಣಿಮ"),
            ("2018-05-01", "ಕಾರ್ಮಿಕ ದಿನಾಚರಣೆ; ಗುಜರಾತ್ ದಿನೋತ್ಸವ; ಮಹಾರಾಷ್ಟ್ರ ದಿನೋತ್ಸವ"),
            ("2018-05-09", "ರವೀಂದ್ರ ಜಯಂತಿ"),
            ("2018-05-16", "ಸಿಕ್ಕಿಂ ರಾಜ್ಯ ದಿನೋತ್ಸವ"),
            ("2018-06-02", "ತೆಲಂಗಾಣ ಸ್ಥಾಪನಾ ದಿನ"),
            ("2018-06-16", "ಈದ್-ಉಲ್-ಫಿತರ್; ಮಹಾರಾಣಾ ಪ್ರತಾಪ್ ಜಯಂತಿ"),
            ("2018-08-06", "ಬೋನಾಲು"),
            ("2018-08-15", "ಸ್ವಾತಂತ್ರ್ಯ ದಿನಾಚರಣೆ"),
            ("2018-08-16", "ಪುದುಚ್ಚೇರಿ ಕಾನೂನು ಹಸ್ತಾಂತರ ದಿನೋತ್ಸವ"),
            ("2018-08-17", "ಪಾರ್ಸಿ ಹೊಸ ವರ್ಷ (ಶಹನ್ಶಾಹಿ)"),
            ("2018-08-22", "ಬಕ್ರೀದ್"),
            ("2018-08-24", "ಓಣಂ"),
            ("2018-08-26", "ರಕ್ಷಾ ಬಂಧನ"),
            ("2018-09-03", "ಶ್ರೀ ಕೃಷ್ಣ ಜನ್ಮಾಷ್ಟಮಿ"),
            ("2018-09-13", "ವಿನಾಯಕ ಚತುರ್ಥಿ"),
            ("2018-09-21", "ಮೊಹರಂ ಕಡೆ ದಿನ"),
            ("2018-10-02", "ಗಾಂಧಿ ಜಯಂತಿ"),
            ("2018-10-08", "ಬತುಕಮ್ಮ ಹಬ್ಬ"),
            ("2018-10-10", "ನವರಾತ್ರಿ / ಶರದ್ ನವರಾತ್ರಿ"),
            ("2018-10-17", "ಮಹಾನವಮಿ"),
            ("2018-10-19", "ವಿಜಯದಶಮಿ"),
            ("2018-10-31", "ಸರ್ದಾರ್ ವಲ್ಲಭಭಾಯಿ ಪಟೇಲ್ ಜಯಂತಿ"),
            (
                "2018-11-01",
                "ಆಂಧ್ರ ಪ್ರದೇಶ ಸ್ಥಾಪನಾ ದಿನ; "
                "ಕನ್ನಡ ರಾಜ್ಯೋತ್ಸವ; "
                "ಕೇರಳ ಸ್ಥಾಪನಾ ದಿನ; "
                "ಛತ್ತೀಸ್‌ಗಢ ಸ್ಥಾಪನಾ ದಿನ; "
                "ಪುದುಚ್ಚೇರಿ ವಿಮೋಚನ ದಿನೋತ್ಸವ; "
                "ಮಧ್ಯ ಪ್ರದೇಶ ಸ್ಥಾಪನಾ ದಿನ; "
                "ಹರ್ಯಾಣ ಸ್ಥಾಪನಾ ದಿನ; "
                "ಹೊಸ ಪಂಜಾಬ್ ದಿನೋತ್ಸವ",
            ),
            ("2018-11-07", "ದೀಪಾವಳಿ"),
            ("2018-11-08", "ಗೋವರ್ಧನ ಪೂಜೆ"),
            ("2018-11-13", "ಛಠ್ ಪೂಜೆ"),
            ("2018-11-14", "ಮಕ್ಕಳ ದಿನಾಚರಣೆ"),
            ("2018-11-15", "ಜಾರ್ಖಂಡ್ ಸ್ಥಾಪನಾ ದಿನ"),
            ("2018-11-21", "ಈದ್-ಮಿಲಾದ್"),
            ("2018-11-23", "ಗುರು ನಾನಕ್ ಜಯಂತಿ"),
            ("2018-12-01", "ನಾಗಾಲ್ಯಾಂಡ್ ರಾಜ್ಯ ಸ್ಥಾಪನಾ ದಿನ"),
            ("2018-12-02", "ಅಸ್ಸಾಂ ದಿನೋತ್ಸವ"),
            ("2018-12-19", "ಗೋವಾ ವಿಮೋಚನ ದಿನೋತ್ಸವ"),
            ("2018-12-25", "ಕ್ರಿಸ್‌ಮಸ್"),
        )

    def test_l10n_ml(self):
        self.assertLocalizedHolidays(
            "ml",
            ("2018-01-13", "ലോഹരി"),
            ("2018-01-14", "ഉത്തരായൻ; പൊങ്കൽ; മകര സംക്രാന്തി; മാഘ് ബിഹു"),
            ("2018-01-15", "തിരുവള്ളുവർ ദിനം / മട്ടു പൊങ്കൽ"),
            ("2018-01-16", "ഉഴവർ തിരുനാൾ"),
            ("2018-01-24", "ഉത്തർപ്രദേശ് രൂപീകരണദിനം"),
            ("2018-01-26", "റിപ്പബ്ലിക് ദിനം"),
            ("2018-02-13", "മഹാ ശിവരാത്രി"),
            ("2018-02-19", "ചത്രപതി ശിവാജി മഹാരാജ ജയന്തി"),
            ("2018-02-20", "മിസോരം സംസ്ഥാനദിനം"),
            ("2018-03-02", "ഹോളി"),
            ("2018-03-18", "ഉഗാദി; ഗുഡി പദ്വ"),
            ("2018-03-22", "ബിഹാർ ദിനം"),
            ("2018-03-25", "ഓശാന ഞായർ; രാമ നവമി"),
            ("2018-03-29", "മഹാവീർ ജയന്തി"),
            ("2018-03-30", "ദുഃഖവെള്ളി; രാജസ്ഥാൻ ദിനം"),
            ("2018-04-01", "ഈസ്റ്റർ; ഉത്കൽ ദിവസ്"),
            ("2018-04-14", "ഡോ. ബി. ആർ. അംബേദ്കർ ജയന്തി; പുത്താണ്ട് (തമിഴ് പുതുവർഷം); വൈശാഖി"),
            (
                "2018-04-15",
                "പൊഹേലാ ബൈശാഖ്; മഹാ വിഷുവ സംക്രാന്തി / പനാ സംക്രാന്തി; ഹിമാചൽ ദിനം",
            ),
            ("2018-04-30", "ബുദ്ധ പൂർണ്ണിമ"),
            ("2018-05-01", "ഗുജറാത്ത് ദിനം; മഹാരാഷ്ട്ര ദിനം; മെയ് ദിനം"),
            ("2018-05-09", "രബീന്ദ്ര ജയന്തി"),
            ("2018-05-16", "സിക്കിം സംസ്ഥാനദിനം"),
            ("2018-06-02", "തെലങ്കാന രൂപീകരണദിനം"),
            ("2018-06-16", "ഈദ്-ഉൽ-ഫിത്തർ; മഹാരാണ പ്രതാപ് ജയന്തി"),
            ("2018-08-06", "ബോനാലു"),
            ("2018-08-15", "സ്വാതന്ത്ര്യദിനം"),
            ("2018-08-16", "പുതുച്ചേരി നിയമപരമായ കൈമാറ്റദിനം"),
            ("2018-08-17", "പാർസി പുതുവർഷം (ഷഹൻഷാഹി)"),
            ("2018-08-22", "ബക്രീദ്"),
            ("2018-08-24", "ഓണം"),
            ("2018-08-26", "രക്ഷാ ബന്ധൻ"),
            ("2018-09-03", "ജന്മാഷ്ടമി"),
            ("2018-09-13", "ഗണേശ് ചതുർത്ഥി"),
            ("2018-09-21", "മുഹറം"),
            ("2018-10-02", "ഗാന്ധി ജയന്തി"),
            ("2018-10-08", "ബത്തുകമ്മ ഉത്സവം"),
            ("2018-10-10", "നവരാത്രി / ശരദ് നവരാത്രി"),
            ("2018-10-17", "മഹാ നവമി"),
            ("2018-10-19", "ദശര"),
            ("2018-10-31", "സർദാർ വല്ലഭായി പട്ടേൽ ജയന്തി"),
            (
                "2018-11-01",
                "ആന്ധ്രാപ്രദേശ് സ്ഥാപനദിനം; "
                "കേരളപ്പിറവി; "
                "കർണാടക രാജ്യോത്സവം; "
                "ഛത്തീസ്ഗഢ് സ്ഥാപനദിനം; "
                "പുതിയ പഞ്ചാബ് ദിനം; "
                "പുതുച്ചേരി മോചനദിനം; "
                "മധ്യപ്രദേശ് സ്ഥാപനദിനം; "
                "ഹരിയാന സ്ഥാപനദിനം",
            ),
            ("2018-11-07", "ദീപാവലി"),
            ("2018-11-08", "ഗോവർധന പൂജ"),
            ("2018-11-13", "ഛഠ് പൂജ"),
            ("2018-11-14", "കുട്ടികളുടെ ദിനം"),
            ("2018-11-15", "ഝാർഖണ്ഡ് രൂപീകരണദിനം"),
            ("2018-11-21", "മിലാദ്-ഉന്നബി"),
            ("2018-11-23", "ഗുരു നാനക് ജയന്തി"),
            ("2018-12-01", "നാഗാലാൻഡ് സംസ്ഥാനാരംഭദിനം"),
            ("2018-12-02", "അസം ദിനം"),
            ("2018-12-19", "ഗോവ മോചനദിനം"),
            ("2018-12-25", "ക്രിസ്തുമസ്"),
        )

    def test_l10n_mr(self):
        self.assertLocalizedHolidays(
            "mr",
            ("2018-01-13", "लोहरी"),
            ("2018-01-14", "उत्तरायण; पोंगल; मकर संक्रांत; माघ बिहू"),
            ("2018-01-15", "तिरुवल्लुवर दिन / मट्टू पोंगल"),
            ("2018-01-16", "उझावर थिरुनल"),
            ("2018-01-24", "यूपी स्थापना दिन"),
            ("2018-01-26", "प्रजासत्ताक दिन"),
            ("2018-02-13", "महाशिवरात्री"),
            ("2018-02-19", "छत्रपती शिवाजी महाराज जयंती"),
            ("2018-02-20", "मिझोराम राज्य दिन"),
            ("2018-03-02", "होळी"),
            ("2018-03-18", "उगाडी; गुढीपाडवा"),
            ("2018-03-22", "बिहार दिन"),
            ("2018-03-25", "पाम रविवार; रामनवमी"),
            ("2018-03-29", "महावीर जन्म कल्याणक"),
            ("2018-03-30", "गुड फ्रायडे; राजस्थान दिन"),
            ("2018-04-01", "ईस्टर रविवार; ओडिशा दिन (उत्कल दिन)"),
            (
                "2018-04-14",
                "डॉ. बाबासाहेब आंबेडकर जयंती; पुथंडू (तमिळ नववर्ष); वैशाखी",
            ),
            (
                "2018-04-15",
                "पोहेला बैशाख; महाविश्व संक्रांती / पण संक्रांती; हिमाचल दिन",
            ),
            ("2018-04-30", "बुध्द पौर्णिमा"),
            ("2018-05-01", "कामगार दिन; गुजरात दिन; महाराष्ट्र दिन"),
            ("2018-05-09", "रवींद्र जयंती"),
            ("2018-05-16", "सिक्कीम राज्य दिन"),
            ("2018-06-02", "तेलंगणा स्थापना दिन"),
            ("2018-06-16", "महाराणा प्रताप जयंती; रमझान ईद (ईद-उल-फितर)"),
            ("2018-08-06", "बोनालू"),
            ("2018-08-15", "स्वातंत्र्य दिन"),
            ("2018-08-16", "पुदुचेरी कायदेशीर हस्तांतरण दिन"),
            ("2018-08-17", "पारसी नवीन वर्ष (शहेनशाही)"),
            ("2018-08-22", "बकरी ईद (ईद-उल-झुआ)"),
            ("2018-08-24", "ओणम"),
            ("2018-08-26", "रक्षाबंधन"),
            ("2018-09-03", "गोकुळाष्टमी"),
            ("2018-09-13", "गणेश चतुर्थी"),
            ("2018-09-21", "मोहरम"),
            ("2018-10-02", "महात्मा गांधी जयंती"),
            ("2018-10-08", "बथुकम्मा उत्सव"),
            ("2018-10-10", "नवरात्र / शारदीय नवरात्र"),
            ("2018-10-17", "महा नवमी"),
            ("2018-10-19", "दसरा"),
            ("2018-10-31", "सरदार वल्लभभाई पटेल जयंती"),
            (
                "2018-11-01",
                "आंध्र प्रदेश स्थापना दिन; "
                "कर्नाटक राज्योत्सव; केरळ स्थापना दिन; "
                "छत्तीसगड स्थापना दिन; नवीन पंजाब दिन; "
                "पुदुचेरी मुक्ती दिन; मध्य प्रदेश स्थापना दिन; "
                "हरियाणा स्थापना दिन",
            ),
            ("2018-11-07", "दिवाळी (लक्ष्मीपूजन)"),
            ("2018-11-08", "गोवर्धन पूजा"),
            ("2018-11-13", "छठ पूजा"),
            ("2018-11-14", "बाल दिन"),
            ("2018-11-15", "झारखंड स्थापना दिन"),
            ("2018-11-21", "ईद-ए-मिलाद"),
            ("2018-11-23", "गुरुनानक जयंती"),
            ("2018-12-01", "नागालँड राज्य उद्घाटन दिन"),
            ("2018-12-02", "आसाम दिन"),
            ("2018-12-19", "गोवा मुक्ती दिन"),
            ("2018-12-25", "ख्रिसमस"),
        )

    def test_l10n_pa(self):
        self.assertLocalizedHolidays(
            "pa",
            ("2018-01-13", "ਲੋਹੜੀ"),
            ("2018-01-14", "ਉੱਤਰਾਯਣ; ਪੋਂਗਲ; ਮਕਰ ਸੰਕ੍ਰਾਂਤੀ; ਮਾਘ ਬਿਹੂ"),
            ("2018-01-15", "ਤਿਰੂਵੱਲੂਵਰ ਦਿਵਸ / ਮੱਟੂ ਪੋਂਗਲ"),
            ("2018-01-16", "ਉਝਾਵਰ ਥਿਰੂਨਲ"),
            ("2018-01-24", "ਯੂਪੀ ਗਠਨ ਦਿਵਸ"),
            ("2018-01-26", "ਗਣਤੰਤਰ ਦਿਵਸ"),
            ("2018-02-13", "ਮਹਾ ਸ਼ਿਵਰਾਤਰੀ"),
            ("2018-02-19", "ਛਤਰਪਤੀ ਸ਼ਿਵਾਜੀ ਮਹਾਰਾਜ ਜਯੰਤੀ"),
            ("2018-02-20", "ਮਿਜ਼ੋਰਮ ਰਾਜ ਦਿਵਸ"),
            ("2018-03-02", "ਹੋਲੀ"),
            ("2018-03-18", "ਉਗਾਦੀ; ਗੁੜੀ ਪਦਵਾ"),
            ("2018-03-22", "ਬਿਹਾਰ ਦਿਵਸ"),
            ("2018-03-25", "ਪਾਮ ਐਤਵਾਰ; ਰਾਮ ਨੌਮੀ"),
            ("2018-03-29", "ਮਹਾਵੀਰ ਜੈਯੰਤੀ"),
            ("2018-03-30", "ਗੁੱਡ ਫਰਾਈਡੇ; ਰਾਜਸਥਾਨ ਦਿਵਸ"),
            ("2018-04-01", "ਈਸਟਰ ਐਤਵਾਰ; ਓਡੀਸ਼ਾ ਦਿਵਸ (ਉਤਕਲ ਦਿਵਸ)"),
            (
                "2018-04-14",
                "ਜਨਮ ਦਿਨ ਡਾ: ਬੀ.ਆਰ. ਅੰਬੇਡਕਰ; ਪੁਥੰਡੂ (ਤਾਮਿਲ ਨਵਾਂ ਸਾਲ); ਵਿਸਾਖੀ",
            ),
            (
                "2018-04-15",
                "ਪੋਹੇਲਾ ਬੋਸ਼ਾਖ; ਮਹਾਂ ਵਿਸ਼ੁਵ ਸੰਕ੍ਰਾਂਤੀ / ਪਾਨਾ ਸੰਕ੍ਰਾਂਤੀ; ਹਿਮਾਚਲ ਦਿਵਸ",
            ),
            ("2018-04-30", "ਬੁੱਧ ਪੂਰਨਿਮਾ"),
            ("2018-05-01", "ਗੁਜਰਾਤ ਦਿਵਸ; ਮਈ ਦਿਵਸ; ਮਹਾਰਾਸ਼ਟਰ ਦਿਵਸ"),
            ("2018-05-09", "ਰਬਿੰਦਰ ਜੈਅੰਤੀ"),
            ("2018-05-16", "ਸਿੱਕਮ ਰਾਜ ਦਿਵਸ"),
            ("2018-06-02", "ਤੇਲੰਗਾਨਾ ਗਠਨ ਦਿਵਸ"),
            ("2018-06-16", "ਈਦ-ਉੱਲ-ਫਿਤਰ; ਮਹਾਰਾਣਾ ਪ੍ਰਤਾਪ ਜਯੰਤੀ"),
            ("2018-08-06", "ਬੋਨਾਲੂ"),
            ("2018-08-15", "ਸੁਤੰਤਰਤਾ ਦਿਵਸ"),
            ("2018-08-16", "ਪੁਡੂਚੇਰੀ ਡੀ ਜਿਊਰ ਟ੍ਰਾਂਸਫਰ ਦਿਵਸ"),
            ("2018-08-17", "ਪਾਰਸੀ ਨਵਾਂ ਸਾਲ (ਸ਼ਾਹਨਸ਼ਾਹੀ)"),
            ("2018-08-22", "ਈਦ-ਉੱਲ-ਜੂਹਾ (ਬਕਰੀਦ)"),
            ("2018-08-24", "ਓਨਮ"),
            ("2018-08-26", "ਰੱਖੜੀ"),
            ("2018-09-03", "ਜਨਮ ਅਸ਼ਟਮੀ"),
            ("2018-09-13", "ਗਣੇਸ਼ ਚਤੁਰਥੀ"),
            ("2018-09-21", "ਮੁਹੱਰਮ"),
            ("2018-10-02", "ਜਨਮ ਦਿਵਸ ਮਹਾਤਮਾ ਗਾਂਧੀ ਜੀ"),
            ("2018-10-08", "ਬਾਥੁਕੰਮਾ ਤਿਉਹਾਰ"),
            ("2018-10-10", "ਨਵਰਾਤਰੀ / ਸ਼ਰਦ ਨਵਰਾਤਰੀ"),
            ("2018-10-17", "ਮਹਾ ਨਵਮੀ"),
            ("2018-10-19", "ਦੁਸਹਿਰਾ"),
            ("2018-10-31", "ਸਰਦਾਰ ਵੱਲਭ ਭਾਈ ਪਟੇਲ ਜਯੰਤੀ"),
            (
                "2018-11-01",
                "ਆਂਧਰਾ ਪ੍ਰਦੇਸ਼ ਸਥਾਪਨਾ ਦਿਵਸ; "
                "ਕਰਨਾਟਕ ਰਾਜਯੋਤਸਵ; ਕੇਰਲ ਸਥਾਪਨਾ ਦਿਵਸ; "
                "ਛੱਤੀਸਗੜ੍ਹ ਸਥਾਪਨਾ ਦਿਵਸ; ਨਵਾਂ ਪੰਜਾਬ ਦਿਵਸ; "
                "ਪੁਡੂਚੇਰੀ ਮੁਕਤੀ ਦਿਵਸ; ਮੱਧ ਪ੍ਰਦੇਸ਼ ਸਥਾਪਨਾ ਦਿਵਸ; "
                "ਹਰਿਆਣਾ ਸਥਾਪਨਾ ਦਿਵਸ",
            ),
            ("2018-11-07", "ਦੀਵਾਲੀ"),
            ("2018-11-08", "ਗੋਵਰਧਨ ਪੂਜਾ"),
            ("2018-11-13", "ਛੱਠ ਪੂਜਾ"),
            ("2018-11-14", "ਬਾਲ ਦਿਵਸ"),
            ("2018-11-15", "ਝਾਰਖੰਡ ਗਠਨ ਦਿਵਸ"),
            ("2018-11-21", "ਮਿਲਾਦ-ਉੱਨ-ਨਬੀ"),
            ("2018-11-23", "ਗੁਰਪੁਰਬ ਸਾਹਿਬ ਸ੍ਰੀ ਗੁਰੂ ਨਾਨਕ ਦੇਵ ਜੀ"),
            ("2018-12-01", "ਨਾਗਾਲੈਂਡ ਰਾਜ ਦਾ ਉਦਘਾਟਨ ਦਿਵਸ"),
            ("2018-12-02", "ਅਸਾਮ ਦਿਵਸ"),
            ("2018-12-19", "ਗੋਆ ਮੁਕਤੀ ਦਿਵਸ"),
            ("2018-12-25", "ਕ੍ਰਿਸਮਿਸ ਦਿਵਸ"),
        )

    def test_l10n_ta(self):
        self.assertLocalizedHolidays(
            "ta",
            ("2018-01-13", "லோஹ்ரி"),
            ("2018-01-14", "உத்தராயண் நாள்; பொங்கல்; மகர சங்கராந்தி; மாக் பிஹூ"),
            ("2018-01-15", "திருவள்ளுவர் நாள் / மாட்டுப் பொங்கல்"),
            ("2018-01-16", "உழவர் திருநாள்"),
            ("2018-01-24", "உத்தரப்பிரதேச உருவாக்க நாள்"),
            ("2018-01-26", "குடியரசு நாள்"),
            ("2018-02-13", "மகா சிவராத்திரி"),
            ("2018-02-19", "சத்ரபதி சிவாஜி மகாராஜ் ஜெயந்தி"),
            ("2018-02-20", "மிசோரம் மாநில நாள்"),
            ("2018-03-02", "ஹோலி"),
            ("2018-03-18", "உகாதி; குடி பாத்வா"),
            ("2018-03-22", "பீகார் நாள்"),
            ("2018-03-25", "பனை ஞாயிறு; ராம நவமி"),
            ("2018-03-29", "மகாவீர் ஜெயந்தி"),
            ("2018-03-30", "புனித வெள்ளி; ராஜஸ்தான் நாள்"),
            ("2018-04-01", "ஈஸ்டர் ஞாயிறு; ஒடிசா நாள் (உத்கல திவசம்)"),
            ("2018-04-14", "டாக்டர் பி. ஆர். அம்பேத்கர் ஜெயந்தி; புத்தாண்டு (தமிழ் புத்தாண்டு); வைசாகி"),
            ("2018-04-15", "இமாச்சல் நாள்; பொஹேலா பொய்ஷாக்; மகா விஷுவ சங்கராந்தி / பானா சங்கராந்தி"),
            ("2018-04-30", "புத்தர் பௌர்ணமி"),
            ("2018-05-01", "குஜராத் நாள்; தொழிலாளர் நாள்; மகாராஷ்டிரா நாள்"),
            ("2018-05-09", "ரபீந்திர ஜெயந்தி"),
            ("2018-05-16", "சிக்கிம் மாநில நாள்"),
            ("2018-06-02", "தெலுங்கானா உருவாக்க நாள்"),
            ("2018-06-16", "ஈத் உல்-பித்ர்; மகாராணா பிரதாப் ஜெயந்தி"),
            ("2018-08-06", "போனாலு"),
            ("2018-08-15", "சுதந்திர தினம்"),
            ("2018-08-16", "புதுச்சேரி சட்டபூர்வ பரிமாற்ற நாள்"),
            ("2018-08-17", "பார்சி புத்தாண்டு (ஷாஹென்ஷாஹி)"),
            ("2018-08-22", "பகரீத்"),
            ("2018-08-24", "ஓணம்"),
            ("2018-08-26", "ரக்ஷா பந்தன்"),
            ("2018-09-03", "கிருஷ்ண ஜெயந்தி"),
            ("2018-09-13", "விநாயகர் சதுர்த்தி"),
            ("2018-09-21", "முஹர்ரம்"),
            ("2018-10-02", "காந்தி ஜெயந்தி"),
            ("2018-10-08", "பதுக்கம்மா திருவிழா"),
            ("2018-10-10", "நவராத்திரி / சரத நவராத்திரி"),
            ("2018-10-17", "மகா நவமி"),
            ("2018-10-19", "விஜயதசமி"),
            ("2018-10-31", "சர்தார் வல்லபாய் படேல் ஜெயந்தி"),
            (
                "2018-11-01",
                "ஆந்திரப் பிரதேச நாள்; "
                "கர்நாடக ராஜ்யோற்சவம்; "
                "கேரள நாள்; "
                "சத்தீஸ்கர் நாள்; "
                "நியூ பஞ்சாப் நாள்; "
                "புதுச்சேரி விடுதலை நாள்; "
                "மத்திய பிரதேச நாள்; "
                "ஹரியானா நாள்",
            ),
            ("2018-11-07", "தீபாவளி"),
            ("2018-11-08", "கோவர்தன் பூஜை"),
            ("2018-11-13", "சத் பூஜை"),
            ("2018-11-14", "குழந்தைகள் நாள்"),
            ("2018-11-15", "ஜார்கண்ட் உருவாக்க நாள்"),
            ("2018-11-21", "மீலாது உல் நபி"),
            ("2018-11-23", "குரு நானக் ஜெயந்தி"),
            ("2018-12-01", "நாகலாந்து மாநில தொடக்க நாள்"),
            ("2018-12-02", "அஸ்ஸாம் நாள்"),
            ("2018-12-19", "கோவா விடுதலை நாள்"),
            ("2018-12-25", "கிறிஸ்துமஸ்"),
        )

    def test_l10n_te(self):
        self.assertLocalizedHolidays(
            "te",
            ("2018-01-13", "లోహ్రీ"),
            ("2018-01-14", "ఉత్తరాయణం; పొంగల్; భోగాలీ బిహు; మకర సంక్రాంతి"),
            ("2018-01-15", "తిరువళ్ళువర్ దినోత్సవం / మట్టు పొంగల్"),
            ("2018-01-16", "రైతుల పండుగ"),
            ("2018-01-24", "ఉత్తర ప్రదేశ్ అవతరణ దినోత్సవం"),
            ("2018-01-26", "గణతంత్ర దినోత్సవం"),
            ("2018-02-13", "మహాశివరాత్రి"),
            ("2018-02-19", "ఛత్రపతి శివాజీ మహారాజ్ జయంతి"),
            ("2018-02-20", "మిజోరాం రాష్ట్ర దినోత్సవం"),
            ("2018-03-02", "హోలీ"),
            ("2018-03-18", "ఉగాది; గుడి పడ్వా"),
            ("2018-03-22", "బీహార్ దినోత్సవం"),
            ("2018-03-25", "మట్టల ఆదివారం; శ్రీరామనవమి"),
            ("2018-03-29", "మహావీర్ జయంతి"),
            ("2018-03-30", "గుడ్ ఫ్రైడే; రాజస్థాన్ దినోత్సవం"),
            ("2018-04-01", "ఈస్టర్ ఆదివారం; ఒడిశా దినోత్సవం (ఉత్కల దివస)"),
            ("2018-04-14", "డా. బి.ఆర్. అంబేద్కర్ జయంతి; పుతండు (తమిళ నూతన సంవత్సరం); వైశాఖి"),
            ("2018-04-15", "పొహెలా బొయిషాఖ్; మహా విషువ సంక్రాంతి / పానా సంక్రాంతి; హిమాచల్ దినోత్సవం"),
            ("2018-04-30", "బుద్ధ పూర్ణిమ"),
            ("2018-05-01", "కార్మిక దినోత్సవం; గుజరాత్ దినోత్సవం; మహారాష్ట్ర దినోత్సవం"),
            ("2018-05-09", "రవీంద్ర జయంతి"),
            ("2018-05-16", "సిక్కిం రాష్ట్ర దినోత్సవం"),
            ("2018-06-02", "తెలంగాణ అవతరణ దినోత్సవం"),
            ("2018-06-16", "ఈద్-ఉల్-ఫితర్; మహారాణా ప్రతాప్ జయంతి"),
            ("2018-08-06", "బోనాలు"),
            ("2018-08-15", "స్వాతంత్ర దినోత్సవం"),
            ("2018-08-16", "పుదుచ్చేరి చట్టబద్ధ బదిలీ దినోత్సవం"),
            ("2018-08-17", "పార్సీ నూతన సంవత్సరం (షహన్‌షాహీ)"),
            ("2018-08-22", "బక్రీద్"),
            ("2018-08-24", "ఓణం"),
            ("2018-08-26", "రాఖీ పౌర్ణమి"),
            ("2018-09-03", "కృష్ణాష్టమి"),
            ("2018-09-13", "వినాయక చవితి"),
            ("2018-09-21", "మొహర్రం"),
            ("2018-10-02", "గాంధీ జయంతి"),
            ("2018-10-08", "బతుకమ్మ పండుగ"),
            ("2018-10-10", "నవరాత్రి / శరద్ నవరాత్రి"),
            ("2018-10-17", "మహా నవమి"),
            ("2018-10-19", "విజయదశమి"),
            ("2018-10-31", "సర్దార్ వల్లభభాయి పటేల్ జయంతి"),
            (
                "2018-11-01",
                "ఆంధ్రప్రదేశ్ అవతరణ దినోత్సవం; "
                "కర్ణాటక రాజ్యోత్సవం; "
                "కేరళ అవతరణ దినోత్సవం; "
                "కొత్త పంజాబ్ దినోత్సవం; "
                "ఛత్తీస్‌గఢ్ అవతరణ దినోత్సవం; "
                "పుదుచ్చేరి విమోచన దినోత్సవం; "
                "మధ్యప్రదేశ్ అవతరణ దినోత్సవం; "
                "హర్యానా అవతరణ దినోత్సవం",
            ),
            ("2018-11-07", "దీపావళి"),
            ("2018-11-08", "గోవర్ధన పూజ"),
            ("2018-11-13", "ఛఠ్ పూజ"),
            ("2018-11-14", "బాలల దినోత్సవం"),
            ("2018-11-15", "ఝార్ఖండ్ అవతరణ దినోత్సవం"),
            ("2018-11-21", "మిలాద్-ఉన్-నబీ"),
            ("2018-11-23", "గురునానక్ జయంతి"),
            ("2018-12-01", "నాగాలాండ్ రాష్ట్ర ప్రారంభ దినోత్సవం"),
            ("2018-12-02", "అస్సాం దినోత్సవం"),
            ("2018-12-19", "గోవా విమోచన దినోత్సవం"),
            ("2018-12-25", "క్రిస్మస్"),
        )

    def test_deprecated(self):
        self.assertEqual(
            India(subdiv="DD", years=2023).keys(), India(subdiv="DH", years=2023).keys()
        )
        self.assertEqual(
            India(subdiv="OR", years=2023).keys(), India(subdiv="OD", years=2023).keys()
        )
