#  holidays
#  --------
#  A fast, efficient Python library for generating country, province and state
#  specific sets of holidays on the fly. It aims to make determining whether a
#  specific date is a holiday as fast and flexible as possible.
#
#  Authors: Vacanza Team and individual contributors (see CONTRIBUTORS file)
#           dr-prodigy <dr.prodigy.github@gmail.com> (c) 2017-2023
#           ryanss <ryanssdev@icloud.com> (c) 2014-2017
#  Website: https://github.com/vacanza/holidays
#  License: MIT (see LICENSE file)

from unittest import TestCase

from holidays.countries.bhutan import Bhutan
from tests.common import CommonCountryTests


class TestBhutan(CommonCountryTests, TestCase):
    @classmethod
    def setUpClass(cls):
        super().setUpClass(Bhutan)

    def test_birthday_anniversary_of_his_majesty_the_king(self):
        name = "ཟླཝ་བཅུ་གཉིས་པའི་ཚེས་ ༢༤ ལས་ ༢༥ ཚུན་མི་དབང་མངའ་བདག་རིན་པོ་ཆེའི་འཁྲུངས་སྐར་དུས་སྟོན་ངལ་གསོ།"
        self.assertHolidayName(
            name,
            (f"{year}-02-21" for year in self.full_range),
            (f"{year}-02-22" for year in self.full_range),
            (f"{year}-02-23" for year in self.full_range),
        )

    def test_birth_anniversary_third_druk_gyalpo(self):
        self.assertHolidayName(
            "ཟླཝ་གསུམ་པའི་ཚེས་ ༥ ལུ་ མི་དབང་འབྲུག་རྒྱལ་གསུམ་པའི་འཁྲུངས་སྐར་དུས་སྟོན་ངལ་གསོ།",
            (f"{year}-05-02" for year in self.full_range),
        )

    def test_coronation_his_majesty(self):
        self.assertHolidayName(
            "ཟླཝ་དགུ་པའི་ཚེས་ ༡༡ ལུ་ མི་དབང་མངའ་བདག་རིན་པོ་ཆེའི་གསེར་ཁྲི་མངའ་གསོལ་གྱིས་དུས་སྟོན་ངལ་གསོ།", (f"{year}-11-01" for year in self.full_range)
        )

    def test_birth_anniversary_fourth_druk_gyalpo(self):
        self.assertHolidayName(
            "ཟླཝ་དགུ་པའི་ཚེས་ ༢༢ ལུ་ མི་དབང་འབྲུག་རྒྱལ་བཞི་པའི་འཁྲུངས་སྐར་དུས་སྟོན་ངལ་གསོ།",
            (f"{year}-11-11" for year in self.full_range),
        )

    def test_national_day(self):
        self.assertHolidayName("ཟླཝ་བཅུ་པའི་ཚེས་ ༢༨ ལུ་བརྒྱུད་འཛིན་གྱིས་རྒྱལ་སྲིད་ཐོག་མ་དབུ་བརྙེས་པའི་རྒྱལ་ཡོངས་དུས་ཆེན་གྱི་ངལ་གསོལ།", (f"{year}-12-17" for year in self.full_range))

    def test_winter_solstice(self):
        name = "ཟླཝ་བཅུ་གཅིག་པའི་ཚེས་ ༠༣ ལུ་ དགུན་ཉི་ལྡོག་གི་ངལ་གསོ།"
        self.assertHolidayName(
            name,
            (
                f"{year}-01-02"
                for year in (
                    *range(self.start_year, 2019),
                    *range(2020, 2022),
                    *range(2023, self.end_year),
                )
            ),
            "2019-01-03",
            "2022-01-01",
        )

    def test_day_of_offering(self):
        name = "ཟླཝ་བཅུ་གཉིས་པའི་ཚེས་ ༠༡ ལུ་ སྔར་སྲོལ་འབུལ་བའི་ལོ་གསརགྱི་ངལ་གསོ།"
        self.assertHolidayName(
            name,
            "2020-01-25",
            "2021-01-14",
            "2022-01-03",
            "2023-01-22",
            "2024-01-12",
            "2025-01-30",
        )
        self.assertHolidayName(name, set(self.full_range) - {2031, 2040})

    def test_losar(self):
        name = "ཟླཝ་དང་པའི་ཚེས་ ༠༡ དང་ ༢ ལུ་ གནམ་ལོ་གསར་ཚེས་ཀྱིས་དུས་སྟོན་ངལ་གསོ།"
        self.assertHolidayName(
            name,
            "2020-02-24",
            "2021-02-12",
            "2022-03-03",
            "2023-02-21",
            "2024-02-11",
            "2025-02-28",
        )
        self.assertHolidayName(name, self.full_range)

    def test_death_of_zhabdrung(self):
        name = "ཟླཝ་གསུམ་པའི་ཚེས་ ༡༠ ལུ་ མཐུ་ཆེན་བདུད་འཇོམས་རྡོ་རྗེ་དགོངས་རྫོགས་དུས་དྲན་ངལ་གསོ།  ༼ཞབས་དྲུང་སྐུ་མཆོད༽"
        self.assertHolidayName(
            name,
            "2021-04-22",
            "2022-05-11",
            "2023-04-30",
            "2024-04-18",
            "2025-05-07",
        )
        self.assertHolidayName(name, set(self.full_range) - {2010, 2011, 2020})

    def test_lord_buddha_parinirvana(self):
        name = "ཟླཝ་བཞི་པའི་ཚེས་ ༡༥ ལུ་ སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་དུས་ཆེན་ལྔ་འཛོམས་ངལ་གསོ།"
        self.assertHolidayName(
            name,
            "2020-06-05",
            "2021-05-26",
            "2022-06-14",
            "2023-06-04",
            "2024-05-23",
            "2025-06-11",
        )
        self.assertHolidayName(name, self.full_range)

    def test_birth_anniversary_guru_rinpoche(self):
        name = "ཟླཝ་ལྔ་པའི་ཚེས་ ༡༠ ལུ་ ཨོ་རྒྱན་གུ་རུ་རིན་པོ་ཆེའི་འཁྲུངས་སྐར་དུས་ཆེན་ངལ་གསོ།"
        self.assertHolidayName(
            name,
            "2020-06-30",
            "2021-06-20",
            "2022-07-09",
            "2023-06-28",
            "2024-06-16",
            "2025-07-05",
        )
        self.assertHolidayName(name, range(self.start_year, 2027), range(2028, self.end_year))

    def test_first_sermon_lord_buddha(self):
        name = "ཟླཝ་དྲུག་པའི་ཚེས་ ༤ ལུ་ སྟོན་པ་མཆོག་ཝ་ར་ན་སིར་བདེན་བཞིའི་ཆོས་འཁོར་བསྐོར་བའི་དུས་ཆེན་ངལ་གསོ།"
        self.assertHolidayName(
            name,
            "2020-07-24",
            "2021-07-14",
            "2022-08-01",
            "2023-07-21",
            "2024-07-10",
            "2025-07-28",
        )
        self.assertHolidayName(name, self.full_range)

    def test_blessed_rainy_day(self):
        name = "ཟླཝ་བརྒྱད་པའི་ཚེས་ ༢ ལུ་ རྒྱལ་ཡོངས་ཁྲུས་བབས་ཀྱི་ངལ་གསོ།"
        self.assertHolidayName(
            name,
            "2020-09-23",
            "2021-09-23",
            "2022-09-23",
            "2023-09-24",
            "2024-09-23",
            "2025-09-23",
        )
        self.assertHolidayName(name, self.full_range)

    def test_dassain(self):
        name = "ཟླཝ་བརྒྱད་པའི་ཚེས་ ༡༠ ལུ་ ལྷོ་མཚམས་ད་སའིན་ཀྱི་ངལ་གསོ།"
        self.assertHolidayName(
            name,
            "2020-10-26",
            "2021-10-15",
            "2022-10-05",
            "2023-10-24",
            "2024-10-12",
            "2025-10-02",
        )
        self.assertHolidayName(name, (*range(self.start_year, 2012), *range(2014, 2025)))

    def test_descending_day_lord_buddha(self):
        name = "ཟླཝ་དགུ་པའི་ཚེས་ ༢༢ ལུ་ རྒྱལ་བ་ལྷ་ལས་བབས་པའི་དུས་ཆེན་ངལ་གསོལ།"
        self.assertHolidayName(
            name,
            "2020-11-07",
            "2021-10-27",
            "2022-11-15",
            "2023-11-04",
            "2024-11-22",
            "2025-11-11",
        )
        self.assertHolidayName(name, self.full_range)

    def test_thimphu_drubchoe(self):
        name = "ཟླཝ་བརྒྱད་པའི་ཚེས་ ༦ ལུ་ ཐིམ་རྫོང་ལྷ་མོ་གཙོ་མོའི་དངོས་འཆམ་མཇལ་རྒྱུའི་ངལ་གསོ།  ༼ཐིམ་ཕུག་ལུ་རྐྱངམ་ཅིག༽"
        self.assertNoHolidayName(name)
        for subdiv, holidays in self.subdiv_holidays.items():
            if subdiv == "15":
                self.assertHolidayName(
                    name,
                    holidays,
                    "2020-09-23",
                    "2021-09-12",
                    "2022-10-01",
                    "2023-09-21",
                    "2024-09-10",
                    "2025-09-29",
                )
                self.assertHolidayName(name, holidays, self.full_range)
            else:
                self.assertNoHolidayName(name, holidays)

    def test_thimphu_tshechu(self):
        name = "ཟླཝ་བརྒྱད་པའི་ཚེས་ ༡༠-༡༢ ཚུན་ ཐིམ་ཕུ་ཚེས་བཅུའི་ངལ་གསོ།  ༼ཐིམ་ཕུ་ལུ་རྐྱངམ་ཅིག༽"
        self.assertNoHolidayName(name)
        for subdiv, holidays in self.subdiv_holidays.items():
            if subdiv == "15":
                self.assertHolidayName(
                    name,
                    holidays,
                    "2020-09-26",
                    "2020-09-27",
                    "2020-09-28",
                    "2021-09-15",
                    "2021-09-16",
                    "2021-09-17",
                    "2022-10-04",
                    "2022-10-05",
                    "2022-10-06",
                    "2023-09-24",
                    "2023-09-25",
                    "2023-09-26",
                    "2024-09-13",
                    "2024-09-14",
                    "2024-09-15",
                    "2025-10-02",
                    "2025-10-03",
                    "2025-10-04",
                )
                self.assertHolidayNameCount(name, 3, holidays, self.full_range)
            else:
                self.assertNoHolidayName(name, holidays)

    def test_2025(self):
        self.assertHolidaysInYear(
            2025,
            ("2025-01-02", "ཟླཝ་བཅུ་གཅིག་པའི་ཚེས་ ༠༣ ལུ་ དགུན་ཉི་ལྡོག་གི་ངལ་གསོ།"),
            ("2025-01-30", "ཟླཝ་བཅུ་གཉིས་པའི་ཚེས་ ༠༡ ལུ་ སྔར་སྲོལ་འབུལ་བའི་ལོ་གསརགྱི་ངལ་གསོ།"),
            ("2025-02-21", "ཟླཝ་བཅུ་གཉིས་པའི་ཚེས་ ༢༤ ལས་ ༢༥ ཚུན་མི་དབང་མངའ་བདག་རིན་པོ་ཆེའི་འཁྲུངས་སྐར་དུས་སྟོན་ངལ་གསོ།"),
            ("2025-02-22", "ཟླཝ་བཅུ་གཉིས་པའི་ཚེས་ ༢༤ ལས་ ༢༥ ཚུན་མི་དབང་མངའ་བདག་རིན་པོ་ཆེའི་འཁྲུངས་སྐར་དུས་སྟོན་ངལ་གསོ།"),
            ("2025-02-23", "ཟླཝ་བཅུ་གཉིས་པའི་ཚེས་ ༢༤ ལས་ ༢༥ ཚུན་མི་དབང་མངའ་བདག་རིན་པོ་ཆེའི་འཁྲུངས་སྐར་དུས་སྟོན་ངལ་གསོ།"),
            ("2025-02-28", "ཟླཝ་དང་པའི་ཚེས་ ༠༡ དང་ ༢ ལུ་ གནམ་ལོ་གསར་ཚེས་ཀྱིས་དུས་སྟོན་ངལ་གསོ།"),
            ("2025-03-01", "ཟླཝ་དང་པའི་ཚེས་ ༠༡ དང་ ༢ ལུ་ གནམ་ལོ་གསར་ཚེས་ཀྱིས་དུས་སྟོན་ངལ་གསོ།"),
            ("2025-05-02", "ཟླཝ་གསུམ་པའི་ཚེས་ ༥ ལུ་ མི་དབང་འབྲུག་རྒྱལ་གསུམ་པའི་འཁྲུངས་སྐར་དུས་སྟོན་ངལ་གསོ།"),
            ("2025-05-07","ཟླཝ་གསུམ་པའི་ཚེས་ ༡༠ ལུ་ མཐུ་ཆེན་བདུད་འཇོམས་རྡོ་རྗེ་དགོངས་རྫོགས་དུས་དྲན་ངལ་གསོ།  ༼ཞབས་དྲུང་སྐུ་མཆོད༽"),
            ("2025-06-11", "ཟླཝ་བཞི་པའི་ཚེས་ ༡༥ ལུ་ སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་དུས་ཆེན་ལྔ་འཛོམས་ངལ་གསོ།"),
            ("2025-07-05", "ཟླཝ་ལྔ་པའི་ཚེས་ ༡༠ ལུ་ ཨོ་རྒྱན་གུ་རུ་རིན་པོ་ཆེའི་འཁྲུངས་སྐར་དུས་ཆེན་ངལ་གསོ།"),
            ("2025-07-28","ཟླཝ་དྲུག་པའི་ཚེས་ ༤ ལུ་ སྟོན་པ་མཆོག་ཝ་ར་ན་སིར་བདེན་བཞིའི་ཆོས་འཁོར་བསྐོར་བའི་དུས་ཆེན་ངལ་གསོ།"),
            ("2025-09-23", "ཟླཝ་བརྒྱད་པའི་ཚེས་ ༢ ལུ་ རྒྱལ་ཡོངས་ཁྲུས་བབས་ཀྱི་ངལ་གསོ།"),
            ("2025-10-02", "ཟླཝ་བརྒྱད་པའི་ཚེས་ ༡༠ ལུ་ ལྷོ་མཚམས་ད་སའིན་ཀྱི་ངལ་གསོ།"),
            ("2025-11-01", "ཟླཝ་དགུ་པའི་ཚེས་ ༡༡ ལུ་ མི་དབང་མངའ་བདག་རིན་པོ་ཆེའི་གསེར་ཁྲི་མངའ་གསོལ་གྱིས་དུས་སྟོན་ངལ་གསོ།"),
            ("2025-11-11", "ཟླཝ་དགུ་པའི་ཚེས་ ༢༢ ལུ་ མི་དབང་འབྲུག་རྒྱལ་བཞི་པའི་འཁྲུངས་སྐར་དུས་སྟོན་ངལ་གསོ།; ཟླཝ་དགུ་པའི་ཚེས་ ༢༢ ལུ་ རྒྱལ་བ་ལྷ་ལས་བབས་པའི་དུས་ཆེན་ངལ་གསོལ།"),
            ("2025-12-17","ཟླཝ་བཅུ་པའི་ཚེས་ ༢༨ ལུ་བརྒྱུད་འཛིན་གྱིས་རྒྱལ་སྲིད་ཐོག་མ་དབུ་བརྙེས་པའི་རྒྱལ་ཡོངས་དུས་ཆེན་གྱི་ངལ་གསོལ།"),
        )

    def test_l10n_default(self):
        self.assertLocalizedHolidays(
<<<<<<< HEAD
            ("2024-01-02", "དགུན་གྱི་ཉི་མ་ཐུང་ཤོས།"),
            ("2024-01-12", "ལུགས་སྲོལ་གྱི་མཆོད་པའི་ཉིན།"),
            ("2024-02-10", "ལོ་གསར།"),
            ("2024-02-11", "ལོ་གསར།"),
            ("2024-02-21", "རྒྱལ་པོ་མཆོག་གི་སྐུ་འཁྲུངས་དུས་ཆེན།"),
            ("2024-02-22", "རྒྱལ་པོ་མཆོག་གི་སྐུ་འཁྲུངས་དུས་ཆེན།"),
            ("2024-02-23", "རྒྱལ་པོ་མཆོག་གི་སྐུ་འཁྲུངས་དུས་ཆེན།"),
            ("2024-04-18", "ཞབས་དྲུང་གི་སྐུ་འདས་དུས་ཆེན།"),
            ("2024-05-02", "འབྲུག་རྒྱལ་པོ་གསུམ་པའི་སྐུ་འཁྲུངས་དུས་ཆེན།"),
            ("2024-05-23", "སངས་རྒྱས་ཀྱི་མྱང་འདས།"),
            ("2024-06-16", "གུ་རུ་རིན་པོ་ཆེའི་སྐུ་འཁྲུངས་དུས་ཆེན།"),
            ("2024-07-10", "སངས་རྒྱས་ཀྱི་ཆོས་འཁོར་དང་པོ།"),
            ("2024-09-10", "ཐིམ་ཕུའི་སྒྲུབ་ཆོད།"),
            ("2024-09-13", "ཐིམ་ཕུའི་ཚེས་བཅུ།"),
            ("2024-09-14", "ཐིམ་ཕུའི་ཚེས་བཅུ།"),
            ("2024-09-15", "ཐིམ་ཕུའི་ཚེས་བཅུ།"),
            ("2024-09-23", "བཀྲ་ཤིས་ཆར་པའི་ཉིན།"),
            ("2024-10-12", "ད་སེན།"),
            ("2024-11-01", "རྒྱལ་པོ་མཆོག་གི་ཁྲི་འདོན་དུས་ཆེན།"),
            ("2024-11-11", "འབྲུག་རྒྱལ་པོ་བཞི་པའི་སྐུ་འཁྲུངས་དུས་ཆེན་– རྩ་ཁྲིམས་ཀྱི་ཉིན།"),
            ("2024-11-22", "སངས་རྒྱས་ཀྱི་ལྷ་བབས་དུས་ཆེན།"),
            ("2024-12-17", "རྒྱལ་ཡོངས་ཀྱི་ཉིན།"),
=======
      ("2024-01-02", "ཟླཝ་བཅུ་གཅིག་པའི་ཚེས་ ༠༣ ལུ་ དགུན་ཉི་ལྡོག་གི་ངལ་གསོ།"),
            ("2024-01-12", "ཟླཝ་བཅུ་གཉིས་པའི་ཚེས་ ༠༡ ལུ་ སྔར་སྲོལ་འབུལ་བའི་ལོ་གསརགྱི་ངལ་གསོ།"),
            ("2024-02-10", "ཟླཝ་དང་པའི་ཚེས་ ༠༡ དང་ ༢ ལུ་ གནམ་ལོ་གསར་ཚེས་ཀྱིས་དུས་སྟོན་ངལ་གསོ།"),
            ("2024-02-11", "ཟླཝ་དང་པའི་ཚེས་ ༠༡ དང་ ༢ ལུ་ གནམ་ལོ་གསར་ཚེས་ཀྱིས་དུས་སྟོན་ངལ་གསོ།"),
            ("2024-02-21", "ཟླཝ་བཅུ་གཉིས་པའི་ཚེས་ ༢༤ ལས་ ༢༥ ཚུན་མི་དབང་མངའ་བདག་རིན་པོ་ཆེའི་འཁྲུངས་སྐར་དུས་སྟོན་ངལ་གསོ།"),
            ("2024-02-22", "ཟླཝ་བཅུ་གཉིས་པའི་ཚེས་ ༢༤ ལས་ ༢༥ ཚུན་མི་དབང་མངའ་བདག་རིན་པོ་ཆེའི་འཁྲུངས་སྐར་དུས་སྟོན་ངལ་གསོ།"),
            ("2024-02-23", "ཟླཝ་བཅུ་གཉིས་པའི་ཚེས་ ༢༤ ལས་ ༢༥ ཚུན་མི་དབང་མངའ་བདག་རིན་པོ་ཆེའི་འཁྲུངས་སྐར་དུས་སྟོན་ངལ་གསོ།"),
            ("2024-04-18", "ཟླཝ་གསུམ་པའི་ཚེས་ ༡༠ ལུ་ མཐུ་ཆེན་བདུད་འཇོམས་རྡོ་རྗེ་དགོངས་རྫོགས་དུས་དྲན་ངལ་གསོ།  ༼ཞབས་དྲུང་སྐུ་མཆོད༽"),
            ("2024-05-02", "ཟླཝ་གསུམ་པའི་ཚེས་ ༥ ལུ་ མི་དབང་འབྲུག་རྒྱལ་གསུམ་པའི་འཁྲུངས་སྐར་དུས་སྟོན་ངལ་གསོ།"),
            ("2024-05-23", "ཟླཝ་བཞི་པའི་ཚེས་ ༡༥ ལུ་ སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་དུས་ཆེན་ལྔ་འཛོམས་ངལ་གསོ།"),
            ("2024-06-16", "ཟླཝ་ལྔ་པའི་ཚེས་ ༡༠ ལུ་ ཨོ་རྒྱན་གུ་རུ་རིན་པོ་ཆེའི་འཁྲུངས་སྐར་དུས་ཆེན་ངལ་གསོ།"),
            ("2024-07-10", "ཟླཝ་དྲུག་པའི་ཚེས་ ༤ ལུ་ སྟོན་པ་མཆོག་ཝ་ར་ན་སིར་བདེན་བཞིའི་ཆོས་འཁོར་བསྐོར་བའི་དུས་ཆེན་ངལ་གསོ།"),
            ("2024-09-10", "ཟླཝ་བརྒྱད་པའི་ཚེས་ ༦ ལུ་ ཐིམ་རྫོང་ལྷ་མོ་གཙོ་མོའི་དངོས་འཆམ་མཇལ་རྒྱུའི་ངལ་གསོ།  ༼ཐིམ་ཕུག་ལུ་རྐྱངམ་ཅིག༽"),
            ("2024-09-13", "ཟླཝ་བརྒྱད་པའི་ཚེས་ ༡༠-༡༢ ཚུན་ ཐིམ་ཕུ་ཚེས་བཅུའི་ངལ་གསོ།  ༼ཐིམ་ཕུ་ལུ་རྐྱངམ་ཅིག༽"),
            ("2024-09-14", "ཟླཝ་བརྒྱད་པའི་ཚེས་ ༡༠-༡༢ ཚུན་ ཐིམ་ཕུ་ཚེས་བཅུའི་ངལ་གསོ།  ༼ཐིམ་ཕུ་ལུ་རྐྱངམ་ཅིག༽"),
            ("2024-09-15", "ཟླཝ་བརྒྱད་པའི་ཚེས་ ༡༠-༡༢ ཚུན་ ཐིམ་ཕུ་ཚེས་བཅུའི་ངལ་གསོ།  ༼ཐིམ་ཕུ་ལུ་རྐྱངམ་ཅིག༽"),
            ("2024-09-23", "ཟླཝ་བརྒྱད་པའི་ཚེས་ ༢ ལུ་ རྒྱལ་ཡོངས་ཁྲུས་བབས་ཀྱི་ངལ་གསོ།"),
            ("2024-10-12", "ཟླཝ་བརྒྱད་པའི་ཚེས་ ༡༠ ལུ་ ལྷོ་མཚམས་ད་སའིན་ཀྱི་ངལ་གསོ།"),
            ("2024-11-01", "ཟླཝ་དགུ་པའི་ཚེས་ ༡༡ ལུ་ མི་དབང་མངའ་བདག་རིན་པོ་ཆེའི་གསེར་ཁྲི་མངའ་གསོལ་གྱིས་དུས་སྟོན་ངལ་གསོ།"),
            ("2024-11-11", "ཟླཝ་དགུ་པའི་ཚེས་ ༢༢ ལུ་ མི་དབང་འབྲུག་རྒྱལ་བཞི་པའི་འཁྲུངས་སྐར་དུས་སྟོན་ངལ་གསོ།"),
            ("2024-11-22", "ཟླཝ་དགུ་པའི་ཚེས་ ༢༢ ལུ་ རྒྱལ་བ་ལྷ་ལས་བབས་པའི་དུས་ཆེན་ངལ་གསོལ།"),
            ("2024-12-17", "ཟླཝ་བཅུ་པའི་ཚེས་ ༢༨ ལུ་བརྒྱུད་འཛིན་གྱིས་རྒྱལ་སྲིད་ཐོག་མ་དབུ་བརྙེས་པའི་རྒྱལ་ཡོངས་དུས་ཆེན་གྱི་ངལ་གསོལ།"),
>>>>>>> 44737ded (Apply pre-commit fixes)
        )

    def test_l10n_en_us(self):
        self.assertLocalizedHolidays(
            "en_US",
            ("2024-01-02", "Winter Solstice"),
            ("2024-01-12", "Traditional Day of Offering"),
            ("2024-02-10", "Losar"),
            ("2024-02-11", "Losar"),
            ("2024-02-21", "Birth Anniversary of His Majesty the King"),
            ("2024-02-22", "Birth Anniversary of His Majesty the King"),
            ("2024-02-23", "Birth Anniversary of His Majesty the King"),
            ("2024-04-18", "Death Anniversary of Zhabdrung"),
            ("2024-05-02", "Birth Anniversary of the 3rd Druk Gyalpo"),
            ("2024-05-23", "Lord Buddha's Parinirvana"),
            ("2024-06-16", "Birth Anniversary of Guru Rinpoche"),
            ("2024-07-10", "First Sermon of Lord Buddha"),
            ("2024-09-10", "Thimphu Drubchoe"),
            ("2024-09-13", "Thimphu Tshechu"),
            ("2024-09-14", "Thimphu Tshechu"),
            ("2024-09-15", "Thimphu Tshechu"),
            ("2024-09-23", "Blessed Rainy Day"),
            ("2024-10-12", "Dassain"),
            ("2024-11-01", "Coronation of His Majesty the King"),
            ("2024-11-11", "Birth Anniversary of the 4th Druk Gyalpo - Constitution Day"),
            ("2024-11-22", "Descending Day of Lord Buddha"),
            ("2024-12-17", "National Day"),
        )
