Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/*.po
Languages: ar, ca, da, fr, gu, hi, is, ml, mr, mt, no, ps_af, sv, ta, th, uk

source: %s (estimado)
ca: %s (estimat)
th: %s (โดยประมาณ)
uk: %s (приблизна дата)

source: %s (observado, estimado)
uk: %s (вихідний, приблизна дата)

source: %s (observado)
uk: %s (вихідний)

source: Año Nuevo
ca: Cap d'Any
th: วันขึ้นปีใหม่
uk: Новий рік

source: Día de Reyes
uk: Богоявлення

source: Lunes de Carnaval
uk: Карнавальний понеділок

source: Martes de Carnaval
ca: Dimarts de Carnaval
th: วันอังคารคาร์นิวัล
uk: Карнавальний вівторок

source: Día Nacional de la Memoria por la Verdad y la Justicia
uk: Національний день памʼяті заради правди та правосуддя

source: Día del Veterano de Guerra
uk: День ветеранів війни

source: Día del Veterano y de los Caidos en la Guerra de Malvinas
uk: День ветеранів та загиблих на Мальвінській війні

source: Jueves Santo
ca: Dijous Sant
th: วันพฤหัสศักดิ์สิทธิ์
uk: Великий четвер

source: Viernes Santo
ca: Divendres Sant
th: วันศุกร์ประเสริฐ
uk: Страсна пʼятниця

source: Día del Trabajo
uk: День праці

source: Día de la Revolución de Mayo
uk: День Травневої революції

source: Corpus Christi
th: วันสมโภชพระคริสตวรกาย
uk: Свято Тіла і Крові Христових

source: Día de la Afirmación de los Derechos Argentinos sobre las Malvinas, Islas y Sector Antártico
uk: День утвердження прав Аргентини на Мальвінські острови, Aнтарктичний сектор та острови

source: Paso a la Inmortalidad del General Don Martín Miguel de Güemes
uk: День памʼяті генерала Мартіна Мігеля де Гуемеса

source: Paso a la Inmortalidad del General Don Manuel Belgrano
uk: День памʼяті генерала Мануеля Бельграно

source: Día de la Independencia
uk: День незалежності

source: Paso a la Inmortalidad del General Don José de San Martín
uk: День памʼяті генерала Хосе де Сан-Мартіна

source: Día de la Asunción
uk: Внебовзяття Пресвятої Діви Марії

source: Día del Respeto a la Diversidad Cultural
uk: День поваги до культурного різноманіття

source: Día de la Raza
uk: День Колумба

source: Todos Los Santos
uk: День усіх святих

source: Día de la Soberanía Nacional
uk: День національного суверенітету

source: Inmaculada Concepción de María
uk: Непорочне зачаття Діви Марії

source: Navidad
uk: Різдво Христове

source: Aniversario de la Batalla de Salta
uk: Річниця битви при Сальті

source: Dia de la memoria del Guerrero de la Independencia y Gobernador de la Provincia de Salta General Don Martín Miguel de Güemes
uk: День памʼяті генерала Мартіна Мігеля де Гуемеса

source: Festividades del Señor y de la Virgen del Milagro
uk: Свято Господа та Богородиці Чуда

source: Día de la Exaltación de la Santa Cruz
uk: День Воздвиження Хреста Господнього

source: Día de San Luis Rey de Francia
uk: День Святого Людовика

source: Día Provincial de la Memoria por la Verdad y la Justicia
uk: Провінційний день памʼяті заради правди та правосуддя

source: Conmemoración de la Batalla de Caseros
uk: День битви під Касеросом

source: Día del Trabajador Estatal
uk: День державного службовця

source: San Miguel Arcángel
uk: День Святого Архангела Михаїла

source: Día del fallecimiento de Juan Facundo Quiroga
uk: День смерті Хуана Факундо Кіроги

source: Día de la Autonomía Provincial
uk: День провінційної автономії

source: Día de la Memoria por la Verdad y la Justicia
uk: День памʼяті заради правди та правосуддя

source: Día de los Caídos en Malvinas
uk: День пам'яті на Мальвінах

source: Día de la fundación de La Rioja
uk: День заснування Ла-Ріохи

source: Día del Aniversario del Fallecimiento de Monseñor Enrique Angelelli
uk: День смерті Енріке Анхелельї

source: Día del Aniversario del Fallecimiento de Ángel Vicente Peñaloza
uk: День смерті Анхеля Вісенте Пеньялоса

source: Día del Tinkunaco Riojano
uk: Свято Тінкунако

source: Día del Maestro
uk: День учителя

source: Natalicio de Fray Mamerto Esquiú
uk: День народження Мамерто Ескуї

source: Autonomía de Catamarca
uk: День автономії Катамарки

source: Día del Milagro
uk: День дива

source: Día del Apóstol Santiago
uk: День Святого Якова

source: Aniversario de la Batalla de Tucumán
uk: Річниця битви при Тукумані

source: Plebiscito 1902 Trevelin
uk: Річниця плебісциту 1902 року

source: Aniversario del arribo de los primeros colonizadores galeses
uk: Річниця прибуття перших валлійських поселенців

source: Día del Petróleo Nacional
uk: Національний день нафти

source: Tehuelches y Mapuches declaran lealtad a la bandera Argentina
uk: День присяги теуелче та мапуче на вірність аргентинському прапору

source: Día de la Provincia de Tierra del Fuego, Antártida e Islas del Atlántico Sur
uk: День провінції Вогняна Земля, Антарктиди і Південноатлантичних островів

source: Día del Genocidio Selk'Nam
uk: День геноциду народу селькнам

source: Día del Aniversario del Fallecimiento del General Manuel José Joaquín del Corazón de Jesús Belgrano
uk: День смерті генерала Мануеля Бельграно

source: Día del Aniversario del Fallecimiento del General José Francisco de San Martín
uk: День смерті генерала Хосе де Сан-Мартіна

source: Día del Éxodo Jujeño
uk: День Виходу Хухуя

source: Autonomía Política de Jujuy
uk: День політичної автономії Хухуя

source: Día de la Pachamama
uk: День Пачамами

source: Día de la Virgen del Rosario de Río Blanco y Paypaya
uk: День Богородиці Вервиці Ріо-Бланко і Пайпаї

source: Día Grande de Jujuy
uk: Великий День Хухуя

source: Homenaje al Patrono de la Provincia San Juan Bosco
uk: День Святого Івана Боско

source: Día del Aniversario del Fallecimiento del ex Presidente de la Nación Doctor Néstor Carlos Kirchner
uk: День смерті Нестора Карлоса Кіршнера

source: Conmemoración a los obreros fusilados en las Huelgas Patagónicas
uk: Вшанування пам'яті робітників, розстріляних під час Патагонських страйків

source: Día de acción por la tolerancia y el respeto entre los pueblos
uk: День дій на підтримку толерантності та поваги між народами

source: Día del Bancario
uk: День банківських працівників

source: Día del Trabajador del Estado
uk: День державного службовця

source: Año Nuevo Judío (Rosh Hashana)
uk: Рош га-Шана

source: Día del Perdón (Iom Kipur)
uk: Йом Кіпур

source: Pascua Judía (Pésaj)
uk: Песах

source: Año Nuevo Musulmán (Hégira)
uk: Ісламський Новий рік

source: Día posterior a la culminación del ayuno (Id Al-Fitr)
uk: Рамазан-байрам

source: Día de la Fiesta del Sacrificio (Id Al-Adha)
uk: Курбан-байрам

source: Feriado con fines turísticos
uk: Додатковий вихідний

source: Bicentenario de la Revolución de Mayo
uk: 200-річчя Травневої революції

source: Bicentenario de la creación y primera jura de la bandera nacional
uk: 200-річчя створення та першої присяги державному прапору

source: Bicentenario de la Batalla de Tucumán
uk: 200-річчя битви при Тукумані

source: Bicentenario de la sesión inaugural de la Asamblea Nacional Constituyente del año 1813
uk: 200-річчя інавгураційної сесії Національних установчих зборів 1813 року

source: Bicentenario de la Batalla de Salta
uk: 200-річчя битви при Сальті

source: Censo Nacional 2010
uk: День національного перепису 2010

source: Cumbre de Líderes del Grupo de los 20 (G20)
uk: Саміт лідерів Групи двадцяти (G20)

source: Censo Nacional 2022
uk: День національного перепису 2022

source: Día de la Victoria de la Copa Mundial de la FIFA 2022
uk: День перемоги збірної Аргентини на Чемпіонаті світу з футболу 2022

source: Asueto bancario
uk: Банківський вихідний

source: ชดเชย%s
uk: %s (вихідний)

source: วันขึ้นปีใหม่
uk: Новий рік

source: วันเด็กแห่งชาติ
uk: Національний день дітей

source: วันลงนามในสัญญาพักรบระหว่างประเทศไทยกับประเทศอินโดจีนฝรั่งเศส
uk: День підписання перемирʼя між Таїландом та Францією

source: วันพระบาทสมเด็จพระพุทธยอดฟ้าจุฬาโลกมหาราช และวันที่ระลึกมหาจักรีบรมราชวงศ์
uk: День памʼяті короля Рами I та династії Чакрі

source: วันจักรี
uk: День Чакрі

source: วันที่ระลึกมหาจักรี
uk: День памʼяті Чакрі

source: วันสงกรานต์
uk: Тайський Новий рік

source: วันตรุษสงกรานต์และขึ้นปีใหม่
uk: Тайський Новий рік

source: วันตรุษสงกรานต์
uk: Тайський Новий рік

source: ตะรุษะสงกรานต์
uk: Тайський Новий рік

source: พระราชพิธีตะรุษะสงกรานต์ แลนักขัตฤกษ์
uk: Святкування Тайського Нового року

source: วันแรงงานแห่งชาติ
uk: Національний день праці

source: วันชาติ
uk: Національний день

source: วันขอพระราชทานรัฐธรรมนูญ
uk: День конституційної петиції

source: วันรัฐธรรมนูญชั่วคราว
uk: День тимчасової Конституції

source: วันฉัตรมงคล
uk: День коронації

source: พระราชพิธีฉัตรมงคล
uk: День королівської коронації

source: ทำบุญพระบรมอัษฐิ และพระราชพิธีฉัตรมงคล
uk: Церемонія вшанування королівського праху та День коронації

source: วันเฉลิมพระชนมพรรษาสมเด็จพระนางเจ้าสุทิดา พัชรสุธาพิมลลักษณ พระบรมราชินี
uk: День народження Її Величності королеви Сутіди

source: วันเฉลิมพระชนมพรรษาพระบาทสมเด็จพระปรเมนทรรามาธิบดีศรีสินทรมหาวชิราลงกรณ พระวชิรเกล้าเจ้าอยู่หัว
uk: День народження Його Величності короля Маха Вачіралонгкорна

source: วันเฉลิมพระชนมพรรษาสมเด็จพระบรมราชชนนีพันปีหลวง
uk: День народження Її Величності королеви-матері Сірікіт

source: วันเฉลิมพระชนมพรรษาสมเด็จพระนางเจ้าสิริกิติ์ พระบรมราชินีนาถ
uk: День народження Її Величності королеви Сірікіт

source: วันแม่แห่งชาติ
uk: Національний день матері

source: วันประกาศสันติภาพ
uk: День проголошення миру

source: วันนวมินทรมหาราช
uk: День памʼяті Його Величності короля Пуміпона Адульядета

source: วันคล้ายวันสวรรคตพระบาทสมเด็จพระบรมชนกาธิเบศร มหาภูมิพลอดุลยเดชมหาราช บรมนาถบพิตร
uk: Річниця смерті Його Величності короля Пуміпона Адульядета Великого

source: วันคล้ายวันสวรรคตพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดช บรมนาถบพิตร
uk: Річниця смерті Його Величності короля Пуміпона Адульядета

source: วันปิยมหาราช
uk: День памʼяті Його Величності короля Чулалонгкорна

source: วันสวรรคตแห่งพระบาทสมเด็จพระพุทธเจ้าหลวง
uk: Річниця смерті Його Величності короля Чулалонгкорна

source: ทำบุญพระบรมอัษฐิพระพุทธเจ้าหลวง
uk: Церемонія вшанування королівського праху Його Величності короля Чулалонгкорна

source: วันสหประชาชาติ
uk: День ООН

source: วันคล้ายวันเฉลิมพระชนมพรรษาพระบาทสมเด็จพระบรมชนกาธิเบศร มหาภูมิพลอดุลยเดชมหาราช บรมนาถบพิตร
uk: Річниця дня народження Його Величності короля Пуміпона Адульядета Великого

source: วันคล้ายวันเฉลิมพระชนมพรรษาพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดช บรมนาถบพิตร
uk: Річниця дня народження Його Величності короля Пуміпона Адульядета

source: วันเฉลิมพระชนมพรรษาพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดช บรมนาถบพิตร
uk: День народження Його Величності короля Пуміпона Адульядета

source: วันเฉลิมพระชนมพรรษา
uk: День народження Його Величності

source: วันเกิดในสมเด็จพระเจ้าอยู่หัว
uk: День народження Його Величності короля

source: วันเฉลิมพระชนม์พรรษา
uk: День народження Його Величності

source: เฉลิมพระชนม์พรรษา
uk: День народження Його Величності

source: เฉลิมพระชนมพรรษา
uk: День народження Його Величності

source: วันพ่อแห่งชาติ
uk: Національний день батька

source: วันรัฐธรรมนูญ
uk: День Конституції

source: วันสิ้นปี
uk: Переддень Нового року

source: วันมาฆบูชา
uk: Маха Буча

source: มาฆบูชา จาตุรงฅ์สันนิบาต
uk: Маха Буча, День чотиристороннього зібрання

source: วันวิสาขบูชา
uk: Вісака Буча

source: วันวิสาขะบูชา
uk: Вісака Буча

source: วิศาขะบูชา
uk: Вісака Буча

source: วิสาขะบูชา
uk: Вісака Буча

source: วันเข้าพรรษา
uk: Початок буддистського посту

source: เข้าปุริมพรรษา
uk: Початок буддистського посту

source: วันอาสาฬหบูชา
uk: Асарна Буча

source: วันกองทัพไทย
uk: День Королівських збройних сил Таїланду

source: วันหยุดเพิ่มเติมสำหรับการปิดบัญชีประจำปีของธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร
uk: Додатковий вихідний сільськогосподарського Банку та кооперативів

source: วันหยุดภาคครึ่งปีของสถาบันการเงินและสถาบันการเงินเฉพาะกิจ
uk: Вихідний середини року для фінансових установ

source: วันพืชมงคล
uk: Церемонія королівської оранки

source: วันครู
uk: День вчителя

source: วันทหารผ่านศึก
uk: День ветеранів

source: วันวิทยาศาสตร์แห่งชาติ
uk: Національний день науки

source: วันศิลปินแห่งชาติ
uk: Національний день художника

source: วันสตรีสากล
uk: Міжнародний жіночий день

source: วันอนุรักษ์ทรัพยากรป่าไม้ของชาติ
uk: Національний день охорони лісів

source: วันพ่อขุนรามคำแหงมหาราช
uk: День памʼяті короля Рамкхамхенга

source: วันการบินแห่งชาติ
uk: Національний день авіації

source: วันพระราชทานธงชาติไทย
uk: День національного прапора Таїланду

source: วันลอยกระทง
uk: Лой Кратонг

source: วันหยุดชดเชย
uk: Додатковий вихідний

source: วันเลือกตั้ง
uk: День виборів

source: วันหยุดพิเศษ (เพิ่มเติม)
uk: Проміжний вихідний

source: พระราชพิธีฉลองสิริราชสมบัติครบ 60 ปี พ.ศ. 2549
uk: 60-та річниця сходження на престол Його Величності короля Пуміпона Адульядета

source: วันหยุดพิเศษ (การเมือง)
uk: Надзвичайний стан (політичні заворушення)

source: วันหยุดพิเศษ (มหาอุทกภัย พ.ศ. 2554)
uk: Надзвичайний стан (повінь 2011 року)

source: วันพระราชพิธีถวายพระเพลิงพระบรมศพสมเด็จพระนางเจ้ารำไพพรรณี
uk: Церемонія кремації Її Величності королеви Рамбай Барні

source: พระราชพิธีกาญจนาภิเษก พ.ศ. 2539
uk: Золотий ювілей Його Величності короля Пуміпона Адульядета

source: วันหยุดพิเศษ (คมช.)
uk: Надзвичайний стан (військовий переворот)

source: วันหยุดพิเศษ (ร่วมถวายอาลัย ส่งดวงพระวิญญาณพระบรมศพ)
uk: День жалоби за Його Величністю королем Пуміпоном Адульядетом

source: วันพระราชพิธีถวายพระเพลิงพระบรมศพพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดช
uk: Церемонія кремації Його Величності короля Пуміпона Адульядета

source: พระราชพิธีบรมราชาภิเษก พระบาทสมเด็จพระวชิรเกล้าเจ้าอยู่หัว
uk: Коронація Його Величності короля Маха Вачіралонгкорна

source: %s (estimated)
gu: %s (અંદાજિત)
hi: %s (अनुमानित)
ml: %s (അനുമാനിച്ചിരിക്കുന്നു)
mr: %s (अंदाजित)
ta: %s (மதிப்பிடப்பட்டது)

source: Republic Day
gu: પ્રજાસત્તાક દિવસ
hi: गणतंत्र दिवस
ml: പ്രജാസ്വാമ്യ ദിനം
mr: प्रजासत्ताक दिन
mt: Jum ir-Repubblika
ta: குடியரசு நாள்

source: Independence Day
gu: સ્વતંત્રતા દિવસ
hi: स्वतंत्रता दिवस
ml: സ്വാതന്ത്ര്യ ദിനം
mr: स्वातंत्र्य दिन
mt: Jum l-Indipendenza
ta: விடுதலை நாள்

source: Gandhi Jayanti
gu: ગાંધી જયંતિ
hi: गांधी जयंती
mr: महात्मा गांधी जयंती
ta: காந்தி ஜெயந்தி

source: Buddha Purnima
gu: બુદ્ધ પૂર્ણિમા
hi: बुद्ध पूर्णिमा
ml: ബുദ്ധ പൂർണിമ
mr: बुद्ध पौर्णिमा
ta: புத்தர் பௌர்ணமி

source: Diwali
gu: દિવાળી
hi: दिवाली
mr: दिवाळी
ta: தீபாவளி

source: Janmashtami
gu: જન્માષ્ટમી
hi: जन्माष्टमी
ml: ജന്മാഷ്ടമി
mr: जन्माष्टमी
ta: ஜென்மாஷ்டமி

source: Dussehra
gu: દશેરા
hi: दशहरा
mr: दसरा
ta: விஜயதசமி

source: Mahavir Jayanti
gu: મહાવીર જયંતિ
hi: महावीर जयंती
ml: മഹാവീർ ജയന്തി
mr: महावीर जयंती
ta: மகாவீர் ஜெயந்தி

source: Maha Shivaratri
gu: મહાશિવરાત્રી
hi: महाशिवरात्रि
mr: महाशिवरात्री
ta: மகா சிவராத்திரி

source: Guru Nanak Jayanti
gu: ગુરુ નાનક જયંતિ
hi: गुरु नानक जयंती
mr: गुरु नानक जयंती
ta: குரு நானக் ஜெயந்தி

source: Muharram
gu: મોહરમ
hi: मुहर्रम
ml: മുഹറാം
mr: मोहरम
ta: முஹர்ரம்

source: Milad-un-Nabi
gu: મિલાદ-ઉન-નબી
hi: मिलाद-उन-नबी
mr: मिलाद-उन-नबी (ईद-ए-मिलाद)
ta: மீலாது உல் நபி

source: Id-ul-Fitr
gu: ઈદ-ઉલ-ફિત્ર
hi: ईद-उल-फितर
mr: ईद-उल-फित्र
ta: ஈத் உல்-பித்ர்

source: Bakrid
gu: બકરી ઈદ
hi: बकरीद
mr: बकरीद
ta: பகரீத்

source: Good Friday
gu: ગુડ ફ્રાઈડે
hi: गुड फ्राइडे
ml: ഗുഡ് ഫ്രൈഡേ
mr: गुड फ्रायडे
mt: Il-Ġimgħa l-Kbira
ta: புனித வெள்ளி

source: Christmas
gu: નાતાલ
hi: क्रिसमस
mr: नाताळ
ta: கிறிஸ்துமஸ்

source: Children's Day
gu: બાળ દિવસ
hi: बाल दिवस
mr: बालदिन
ta: குழந்தைகள் தினம்

source: Holi
gu: હોળી
hi: होली
ml: ഹോളി
mr: होळी
ta: ஹோலி

source: Ganesh Chaturthi
gu: ગણેશ ચતુર્થી
hi: गणेश चतुर्थी
mr: गणेश चतुर्थी
ta: விநாயகர் சதுர்த்தி

source: Govardhan Puja
gu: ગોવર્ધન પૂજા
hi: गोवर्धन पूजा
mr: गोवर्धन पूजा
ta: கோவர்த்தன பூஜை

source: Labour Day
gu: મજૂર દિવસ
hi: मजदूर दिवस
mr: कामगार दिन
ta: தொழிலாளர் தினம்

source: Maha Navami
gu: મહાનવમી
hi: महानवमी
mr: महानवमी
ta: மகா நவமி

source: Makar Sankranti
gu: મકરસંક્રાંતિ
hi: मकर संक्रांति
mr: मकर संक्रांती
ta: மகர சங்கராந்தி

source: Raksha Bandhan
gu: રક્ષાબંધન
hi: रक्षाबंधन
mr: रक्षाबंधन
ta: ரக்ஷா பந்தன்

source: Ram Navami
gu: રામ નવમી
hi: रामनवमी
ml: രാമ നവമി
mr: राम नवमी
ta: ராம நவமி

source: Navratri / Sharad Navratri
gu: નવરાત્રી / શરદ નવરાત્રી
hi: नवरात्र/शरद नवरात्र
mr: नवरात्री / शरद नवरात्री
ta: நவராத்திரி / சரத் நவராத்திரி

source: Easter Sunday
gu: ઈસ્ટર સન્ડે
hi: ईस्टर संडे
mr: इस्टर संडे
ta: ஈஸ்டர் ஞாயிறு

source: Palm Sunday
gu: પામ સન્ડે
hi: पाम संडे
mr: पाम संडे
ta: பனை ஞாயிறு

source: Dr. B. R. Ambedkar's Jayanti
gu: ડૉ. બી. આર. આંબેડકર જયંતિ
hi: डॉ. बी.आर. आम्बेडकर जयंती
mr: डॉ. बाबासाहेब आंबेडकर जयंती
ta: டாக்டர் பி. ஆர். அம்பேத்கர் ஜெயந்தி

source: Andhra Pradesh Foundation Day
gu: આંધ્ર પ્રદેશ સ્થાપના દિવસ
hi: आंध्र प्रदेश स्थापना दिवस
mr: आंध्र प्रदेश स्थापना दिन
ta: ஆந்திரா அஸ்தி தினம்

source: Ugadi
gu: ઉગાડી
hi: उगादि
mr: युगादी
ta: உகாதி

source: Magh Bihu
gu: માઘ બિહુ
hi: माघ बिहू
mr: माघ बिहू
ta: மாக் பிஹூ

source: Assam Day
gu: આસામ દિવસ
hi: असम दिवस
mr: आसाम दिन
ta: அஸ்ஸாம் தினம்

source: Chhath Puja
gu: છઠ પૂજા
hi: छठ पूजा
ml: ഛഠ് പൂജ
mr: छठ पूजा
ta: சாட் பூஜை

source: Bihar Day
gu: બિહાર દિવસ
hi: बिहार दिवस
mr: छठ पूजा
ta: பீகார் தினம்

source: Chhattisgarh Foundation Day
gu: છત્તીસગઢ સ્થાપના દિવસ
hi: छत्तीसगढ़ स्थापना दिवस
mr: छत्तीसगड स्थापना दिन
ta: சத்தீஸ்கர் அஸ்தி தினம்

source: Dadra and Nagar Haveli Liberation Day
gu: દાદરા અને નગર હવેલી મુક્તિ દિવસ

source: Daman and Diu Liberation Day
gu: દમણ અને દીવ મુક્તિ દિવસ

source: Goa Liberation Day
gu: ગોવા મુક્તિ દિવસ
hi: गोवा मुक्ति दिवस
mr: गोवा मुक्ती दिन
ta: கோவா விடுதலை தினம்

source: Uttarayan
gu: ઉત્તરાયણ
hi: उत्तरायण
mr: उत्तरायण
ta: உத்தராயண்

source: Gujarat Day
gu: ગુજરાત સ્થાપના દિવસ
hi: गुजरात दिवस
mr: गुजरात दिन
ta: குஜராத் தினம்

source: Sardar Vallabhbhai Patel Jayanti
gu: સરદાર વલ્લભભાઈ પટેલ જયંતિ
hi: सरदार वल्लभभाई पटेल जयंती
mr: सरदार वल्लभभाई पटेल जयंती
ta: சர்தார் வல்லபாய் படேல் ஜெயந்தி

source: Haryana Foundation Day
gu: હરિયાણા સ્થાપના દિવસ
hi: हरियाणा स्थापना दिवस
mr: हरियाणा स्थापना दिन
ta: அரியானா அஸ்தி தினம்

source: Himachal Day
gu: હિમાચલ દિવસ
hi: हिमाचल दिवस
mr: हिमाचल दिन
ta: இமாச்சல் தினம்

source: Jharkhand Formation Day
gu: ઝારખંડ સ્થાપના દિવસ
hi: झारखंड स्थापना दिवस
mr: झारखंड स्थापना दिन
ta: ஜார்கண்ட் உருவாக்க தினம்

source: Karnataka Rajyotsava
gu: કર્ણાટક રાજ્યોત્સવ
hi: कर्नाटक राज्योत्सव
mr: कर्नाटक राज्योत्सव
ta: கர்நாடக ராஜ்யோத்சவ

source: Onam
gu: ઓણમ
hi: ओणम
ml: ഓണം
mr: ओणम
ta: ஓணம்

source: Kerala Foundation Day
gu: કેરળ સ્થાપના દિવસ
hi: केरल स्थापना दिवस
ml: കേരള സ്ഥാപനം ദിനം
mr: केरल स्थापना दिन
ta: கேரளா அஸ்தி தினம்

source: Gudi Padwa
gu: ગુડી પડવો
hi: गुडी पाडवा
mr: गुढीपाडवा
ta: குடி பாத்வா

source: Chhatrapati Shivaji Maharaj Jayanti
gu: છત્રપતિ શિવાજી મહારાજ જયંતિ
hi: छत्रपति शिवाजी महाराज जयंती
mr: छत्रपती शिवाजी महाराज जयंती
ta: சத்ரபதி சிவாஜி மகாராஜ் ஜெயந்தி

source: Maharashtra Day
gu: મહારાષ્ટ્ર દિવસ
hi: महाराष्ट्र दिवस
mr: महाराष्ट्र दिन
ta: மகாராஷ்டிரா தினம்

source: Madhya Pradesh Foundation Day
gu: મધ્ય પ્રદેશ સ્થાપના દિવસ
hi: मध्य प्रदेश स्थापना दिवस
mr: मध्य प्रदेश स्थापना दिन
ta: மத்திய பிரதேச அஸ்தி தினம்

source: Mizoram State Day
gu: મિઝોરમ રાજ્ય દિવસ
hi: मिज़ोरम राज्य दिवस
mr: मिझोरम राज्य दिन
ta: மிசோரம் மாநில தினம்

source: Nagaland State Inauguration Day
gu: નાગાલેન્ડ રાજ્ય ઉદ્ઘાટન દિવસ
hi: नागालैंड राज्य उद्घाटन दिवस
mr: नागालँड राज्य उद्घाटन दिन
ta: நாகலாந்து மாநில தொடக்க தினம்

source: Odisha Day (Utkala Dibasa)
gu: ઓડિશા દિવસ (ઉત્કલ દિવસ)
hi: ओडिशा दिवस (उत्कल दिवस)
mr: ओडिशा दिन (उत्कल दिबस)
ta: ஒடிசா தினம் (உத்கள திபாசா)

source: Maha Vishuva Sankranti / Pana Sankranti
gu: મહા વિષુવ સંક્રાંતિ / પાના સંક્રાંતિ
hi: महा विषुव संक्रांति / पण संक्रांति
ml: മഹാ വിഷു സംക്രാന്തി / പാന സംക്രാന്തി
mr: महा विषुव संक्रांती / पाना संक्रांती
ta: மகா விஷுவ சங்கராந்தி / பானா சங்கராந்தி

source: Puducherry De Jure Transfer Day
gu: પુડુચેરી ડી જ્યુર ટ્રાન્સફર દિવસ
hi: पुडुचेरी डी ज्यूर स्थानांतरण दिवस
mr: पुडुचेरी डी ज्युअर ट्रान्सफर दिन
ta: புதுச்சேரி சட்டபூர்வ பரிமாற்ற தினம்

source: Puducherry Liberation Day
gu: પુડુચેરી મુક્તિ દિવસ
hi: पुडुचेरी मुक्ति दिवस
mr: पुडुचेरी मुक्ती दिन
ta: புதுச்சேரி விடுதலை தினம்

source: Guru Gobind Singh Jayanti
gu: ગુરુ ગોવિંદ સિંહ જયંતિ
hi: गुरु गोबिंद सिंह जयंती
mr: गुरु गोविंद सिंग जयंती
ta: குரு கோவிந்த் சிங் ஜெயந்தி

source: Vaisakhi
gu: વૈશાખી
hi: वैसाखी
mr: वैसाखी
ta: வைசாகி

source: Lohri
gu: લોહરી
hi: लोहड़ी
mr: लोहरी
ta: லோஹ்ரி

source: Punjab Day
gu: પંજાબ દિવસ
hi: पंजाब दिवस
mr: पंजाब दिन
ta: பஞ்சாப் தினம்

source: Rajasthan Day
gu: રાજસ્થાન દિવસ
hi: राजस्थान दिवस
mr: राजस्थान दिन
ta: ராஜஸ்தான் தினம்

source: Maharana Pratap Jayanti
gu: મહારાણા પ્રતાપ જયંતિ
hi: महाराणा प्रताप जयंती
mr: महाराणा प्रताप जयंती
ta: மகாராணா பிரதாப் ஜெயந்தி

source: Sikkim State Day
gu: સિક્કિમ રાજ્ય દિવસ
hi: सिक्किम राज्य दिवस
mr: सिक्कीम राज्य दिन
ta: சிக்கிம் மாநில தினம்

source: Pongal
gu: પોંગલ
hi: पोंगल
ml: പോങ്കൽ
mr: पोंगल
ta: பொங்கல்

source: Thiruvalluvar Day / Mattu Pongal
gu: તિરુવલ્લુવર દિવસ / મટ્ટુ પોંગલ
hi: तिरुवल्लुवर दिवस / मट्टू पोंगल
ml: തിരുവല്ലുവരുടെ ദിനം / മട്ടു പോങ്കൽ
mr: तिरुवल्लुवर दिन / मट्टू पोंगल
ta: திருவள்ளுவர் தினம் / மாட்டுப் பொங்கல்

source: Uzhavar Thirunal
gu: ઉઝાવર થિરુનલ
hi: उझावर थिरुनल
ml: ഉഴവർ തിരുനാൾ
mr: उझावर तिरुनल
ta: உழவர் திருநாள்

source: Puthandu (Tamil New Year)
gu: પુથંડુ (તમિલ નવું વર્ષ)
hi: पुत्ताण्डु (तमिल नव वर्ष)
mr: पुतांडु (तमिळ नवीन वर्ष)
ta: புத்தாண்டு (தமிழ் புத்தாண்டு)

source: Telangana Formation Day
gu: તેલંગાણા સ્થાપના દિવસ
hi: तेलंगाना स्थापना दिवस
mr: तेलंगणा स्थापना दिन
ta: தெலுங்கானா உருவாக்க தினம்

source: Bathukamma Festival
gu: બથુકમ્મા ઉત્સવ
hi: बतुकम्मा महोत्सव
mr: पोहेला बैशाख
ta: பதுக்கம்மா திருவிழா

source: UP Formation Day
gu: યુપી સ્થાપના દિવસ
hi: यूपी स्थापना दिवस
mr: उत्तर प्रदेश स्थापना दिन
ta: உத்தரப்பிரதேச உருவாக்க தினம்

source: Pohela Boishakh
gu: પોહેલા બોઈશાખ
hi: पोहेला बोइशाख
mr: पोहेला बैशाख
ta: பொஹேலா பொய்ஷாக்

source: Rabindra Jayanti
gu: રવીન્દ્ર જયંતિ
hi: रवींद्र जयंती
mr: रवींद्रनाथ टागोर जयंती
ta: ரபீந்திர ஜெயந்தி

source: Confraternização Universal
uk: День всесвітнього братання

source: Constituição da Republica
uk: День Конституції республіки

source: Sexta-feira Santa
uk: Страсна пʼятниця

source: Tiradentes
uk: День Тирадентіса

source: Dia do Trabalhador
uk: День трудящих

source: Descobrimento do Brasil
uk: День відкриття Бразилії

source: Abolição da escravidão no Brasil
uk: День скасування рабства в Бразилії

source: Liberdade e Independência dos Povos Americanos
uk: День свободи та незалежності американських народів

source: Independência do Brasil
uk: День незалежності Бразилії

source: Descobrimento da América
uk: День відкриття Америки

source: Nossa Senhora Aparecida
uk: День Богоматері Апаресіди

source: Finados
uk: День усіх померлих

source: Proclamação da República
uk: День проголошення республіки

source: Dia Nacional de Zumbi e da Consciência Negra
uk: Національний день Зумбі та свідомості темношкірих

source: Natal
uk: Різдво Христове

source: Carnaval
uk: Карнавал

source: Início da Quaresma
uk: Попільна середа

source: Dia do Servidor Público
uk: День громадського службовця

source: Véspera de Natal
uk: Святий вечір

source: Véspera de Ano-Novo
uk: Переддень Нового року

source: Dia do Evangélico
uk: Євангельський день

source: Dia Internacional da Mulher
uk: Міжнародний жіночий день

source: Aniversário do Acre
uk: День заснування Акрі

source: Dia da Amazônia
uk: День Амазонії

source: Assinatura do Tratado de Petrópolis
uk: День підписання Петрополіського договору

source: São João
uk: День Святого Івана

source: São Pedro
uk: День Святого Петра

source: Emancipação Política de Alagoas
uk: День політичного звільнення Алагоаса

source: Consciência Negra
uk: День свідомості темношкірих

source: Elevação do Amazonas à categoria de província
uk: День піднесення Амазонас до категорії провінцій

source: São José
uk: День Святого Йосипа

source: São Tiago
uk: День Святого Якова

source: Criação do Território Federal
uk: День створення федеральної території

source: Independência da Bahia
uk: День незалежності Баїї

source: Abolição da escravidão no Ceará
uk: День скасування рабства в Сеарі

source: Nossa Senhora da Assunção
uk: День Богоматері Внебовзяття

source: Fundação de Brasília
uk: День заснування Бразиліа
