Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/*.po
Languages: ar, ca, da, fr, gu, hi, is, ml, mr, mt, no, ps_af, sv, ta, th, uk

source: Dýri biðidagur
da: Store bededag
is: Kóngsbænadagur
no: Store bededag
sv: Stora bönedagen

source: Kristi himmalsferðardagur
da: Kristi himmelfartsdag
is: Uppstigningardagur
no: Kristi himmelfartsdag
sv: Kristi himmelsfärdsdag

source: Hvítusunnudagur
da: Pinsedag
is: Hvítasunnudagur
no: Første pinsedag
sv: Pingstdagen

source: Annar hvítusunnudagur
da: Anden pinsedag
is: Annar í hvítasunnu
no: Andre pinsedag
sv: Annandag pingst

source: Ólavsøkudagur
da: Olavsdag
is: Ólafsdagur
no: Olavsdag
sv: Olafsdagen

source: Jólaaftan
da: Juleaftensdag
is: Aðfangadagur
no: Julaften
sv: Julafton

source: Jóladagur
da: Juledag
no: Første juledag
sv: Juldagen

source: Annar jóladagur
da: Anden juledag
is: Annar í jólum
no: Andre juledag
sv: Annandag jul

source: Nýggjársaftan
da: Nytårsaften
is: Gamlársdagur
no: Nyttårsaften
sv: Nyårsafton

source: Flaggdagur
da: Flagdag
is: Fánadagur
no: Flaggdag
sv: Flaggdagen

source: Grundlógardagur
da: Grundlovsdag
is: Stjórnarskrárdagur
no: Grunnlovsdag
sv: Grundlagsdag

source: Ólavsøkuaftan
da: Olavsaften
is: Ólafsnótt
no: Olavsaften
sv: Olafsafton

source: %s (puente)
uk: %s (вихідний)

source: Día de los Mártires
uk: День мучеників

source: Día de la Constitución
uk: День Конституції

source: Separación de Panamá de Colombia
uk: День відокремлення від Колумбії

source: Día de Colón
uk: День Колона

source: Primer Grito de Independencia
uk: День початку повстання у Лос-Сантос

source: Independencia de Panamá de España
uk: День незалежності від Іспанії

source: Día de la Madre
uk: День матері

source: Día de Duelo Nacional
uk: День національної скорботи

source: Día de los Símbolos Patrios
uk: День національних символів

source: Toma posesión del Presidente de la república
uk: Інавгурація Президента Республіки

source: Ukiortaaq
is: Nýársdagur

source: Sisamanngortoq illernartoq
is: Skírdagur

source: Tallimanngorneq tannaartoq
is: Föstudagurinn langi

source: Poorskip ullua
is: Páskadagur

source: Poorskip-aappaa
is: Annar í páskum

source: Ulloq qinuffiusoq
is: Kóngsbænadagur

source: Qilaliarfik
is: Uppstigningardagur

source: Piinsip ullua
is: Hvítasunnudagur

source: Piinsip-aappaa
is: Annar í hvítasunnu

source: Juullip ullua
is: Jóladagur

source: Juullip-aappaa
is: Annar í jólum

source: Kunngit pingasut ulluat
is: Þrettándinn

source: Sulisartut ulluat
is: Frídagur verkalýðsins

source: Ullortuneq
is: Þjóðhátíðardagur

source: Juulliaraq
is: Aðfangadagur

source: Ukiortaami
is: Gamlársdagur

source: Новый год
th: วันขึ้นปีใหม่

source: Новогодние каникулы
th: วันหยุดขึ้นปีใหม่

source: Рождество Христово
th: วันคริสต์มาส
uk: Різдво Христове

source: День защитника Отечества
th: วันพิทักษ์ปิตุภูมิ

source: Международный женский день
th: วันสตรีสากล

source: Праздник Весны и Труда
th: วันหยุดเทศกาลฤดูใบไม้ผลิและแรงงาน

source: День международной солидарности трудящихся
th: วันสมานฉันท์แรงงานสากล

source: День Победы
th: วันแห่งชัยชนะ

source: День России
th: วันชาติรัสเซีย

source: День принятия Декларации о государственном суверенитете Российской Федерации
th: วันประกาศใช้คำประกาศอำนาจอธิปไตยรัฐแห่งสหพันธรัฐรัสเซีย

source: День народного единства
th: วันเอกภาพแห่งชาติ

source: День согласия и примирения
th: วันแห่งความตกลงและการปรองดอง

source: Годовщина Великой Октябрьской социалистической революции
th: วันครบรอบการปฏิวัติสังคมนิยมแห่งเดือนตุลาคมอันยิ่งใหญ่

source: Выходной (перенесено с %s)
th: วันหยุด (แทน %s)

source: Нова година
uk: Новий рік

source: Ден на Освобождението на България от османско иго
uk: День визволення Болгарії від османського іга

source: Велики петък
uk: Страсна пʼятниця

source: Велика събота
uk: Велика субота

source: Великден
uk: Великдень

source: Ден на труда и на международната работническа солидарност
uk: День праці та міжнародної солідарності трудящих

source: Гергьовден, Ден на храбростта и Българската армия
uk: День Святого Георгія та День хоробрості і болгарської армії

source: Ден на светите братя Кирил и Методий, на българската азбука, просвета и култура и на славянската книжовност
uk: День святих братів Кирила і Мефодія, болгарської писемності, освіти і культури та словʼянської літератури

source: Ден на Съединението
uk: День обʼєднання

source: Ден на Независимостта на България
uk: День незалежності Болгарїі

source: Бъдни вечер
uk: Святий вечір

source: %s (почивен ден)
uk: %s (вихідний)

source: Ден на народните будители
uk: День національних будителів

source: Feast of St. Paul's Shipwreck
mt: Il-Festa tan-Nawfraġju ta' San Pawl

source: Feast of St. Joseph
mt: Il-Festa ta' San Ġużepp

source: Freedom Day
mt: Jum il-Ħelsien

source: Worker's Day
mt: Jum il-Ħaddiem

source: Feast of St. Peter and St. Paul
mt: Il-Festa ta' San Pietru u San Pawl

source: Feast of the Assumption
mt: Il-Festa ta' Santa Marija

source: Feast of Our Lady of Victories
mt: Jum il-Vitorja

source: Feast of the Immaculate Conception
mt: Il-Festa tal-Immakulata Kunċizzjoni

source: Første nyttårsdag
th: วันขึ้นปีใหม่

source: Skjærtorsdag
th: วันพฤหัสศักดิสิทธิ์

source: Langfredag
th: วันศุกร์ประเสริฐ

source: Første påskedag
th: วันอาทิตย์อีสเตอร์

source: Andre påskedag
th: วันจันทร์อีสเตอร์

source: Arbeidernes dag
th: วันแรงงาน

source: Grunnlovsdag
th: วันรัฐธรรมนูญ

source: Kristi himmelfartsdag
th: วันสมโภชพระเยซูเจ้าเสด็จขึ้นสวรรค์

source: Første pinsedag
th: วันสมโภชพระจิตเจ้า

source: Andre pinsedag
th: วันจันทร์หลังวันสมโภชพระจิตเจ้า

source: Første juledag
th: วันคริสต์มาสวันแรก

source: Andre juledag
th: วันคริสต์มาสวันที่สอง

source: Søndag
th: วันอาทิตย์

source: Nieuwjaarsdag
th: วันขึ้นปีใหม่

source: Goede Vrijdag
th: วันศุกร์ประเสริฐ

source: Eerste paasdag
th: วันอาทิตย์อีสเตอร์

source: Tweede paasdag
th: วันจันทร์อีสเตอร์

source: Koningsdag
th: วันเฉลิมพระชนมพรรษาสมเด็จพระราชาธิบดี

source: Koninginnedag
th: วันเฉลิมพระชนมพรรษาสมเด็จพระราชินีนาถ

source: Bevrijdingsdag
th: วันประกาศอิสรภาพ

source: Hemelvaartsdag
th: วันสมโภชพระเยซูเจ้าเสด็จขึ้นสวรรค์

source: Eerste Pinksterdag
th: วันสมโภชพระจิตเจ้า

source: Tweede Pinksterdag
th: วันจันทร์หลังวันสมโภชพระจิตเจ้า

source: Eerste Kerstdag
th: วันคริสต์มาสวันแรก

source: Tweede Kerstdag
th: วันคริสต์มาสวันที่สอง
