Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/*.po
Languages: ar, ca, da, fr, gu, hi, is, ml, mr, mt, no, ps_af, sv, ta, th, uk

source: Nossa Senhora da Penha
uk: День Богоматері Пенья

source: Fundação da cidade de Goiás
uk: День заснування міста Гояс

source: Pedra fundamental de Goiânia
uk: День заснування Гоянії

source: Adesão do Maranhão à independência do Brasil
uk: День приєдання Мараньяна до незалежності Бразилії

source: Execução de Tiradentes
uk: День страти Тирадентіса

source: Criação do Estado
uk: День створення штату

source: Adesão do Grão-Pará à independência do Brasil
uk: День приєдання Гран-Пара до незалежності Бразилії

source: Fundação do Estado
uk: День заснування штату

source: Revolução Pernambucana
uk: День Пернамбуканської революції

source: Dia do Piauí
uk: День Піауї

source: Emancipação do Paraná
uk: День політичного звільнення Парани

source: São Jorge
uk: День Святого Георгія

source: Dia do Rio Grande do Norte
uk: День Ріо-Гранді-ду-Норті

source: Mártires de Cunhaú e Uruaçu
uk: День мучеників Куньяу та Уруасу

source: Dia do Gaúcho
uk: День Гаучо

source: Dia do Estado de Santa Catarina
uk: День штату Санта-Катарина

source: Dia de Santa Catarina de Alexandria
uk: День Святої Катерини Александрійської

source: Emancipação política de Sergipe
uk: День політичного звільнення Сержипі

source: Revolução Constitucionalista
uk: День Конституціоналістської революції

source: Dia da Autonomia
uk: День автономії

source: Nossa Senhora da Natividade
uk: День Богоматері Різдва

source: Lunes siguiente a %s (estimado)
ca: Dilluns següent a %s (estimat)
th: วันจันทร์หลัง%s (โดยประมาณ)

source: Lunes siguiente a %s
ca: Dilluns següent a %s
th: วันจันทร์หลัง%s

source: Epifanía del Señor
ca: Reis
th: วันสมโภชพระคริสต์แสดงองค์

source: Fiesta del Trabajo
ca: Festa del Treball
th: วันแรงงาน

source: Asunción de la Virgen
ca: Assumpció de la Verge
th: วันสมโภชแม่พระรับเกียรติยกขึ้นสวรรค์

source: Fiesta Nacional de España
ca: Festa Nacional d'Espanya
th: วันชาติสเปน

source: Todos los Santos
ca: Tots Sants
th: วันสมโภชนักบุญทั้งหลาย

source: Día de la Constitución Española
ca: Dia de la Constitució Espanyola
th: วันรัฐธรรมนูญสเปน

source: Inmaculada Concepción
ca: Immaculada Concepció
th: วันสมโภชแม่พระผู้ปฏิสนธินิรมล

source: Natividad del Señor
ca: Nativitat del Senyor
th: วันคริสต์มาส

source: Día de Andalucía
ca: Dia d'Andalusia
th: วันอันดาลูเซีย

source: Día de San Jorge
ca: Dia de Sant Jordi
th: วันสมโภชนักบุญจอร์จ

source: Día de Asturias
ca: Dia d'Astúries
th: วันอัสตูเรียส

source: Lunes de Pascua
ca: Dilluns de Pasqua
th: วันจันทร์อีสเตอร์

source: Santiago Apóstol
ca: Sant Jaume Apòstol
th: วันสมโภชนักบุญยากอบ อัครสาวก

source: Día de las Instituciones de Cantabria
ca: Dia de les Institucions de Cantàbria
th: วันสถาบันแห่งกันตาเบรีย

source: La Bien Aparecida
th: วันแม่พระแห่งอาปาเรซิดา

source: San Antonio
th: วันสมโภชนักบุญอันตน

source: Nuestra Señora de África
ca: Nostra Senyora d'Àfrica
th: วันแม่พระแห่งแอฟริกา

source: Día de Ceuta
ca: Dia de Ceuta
th: วันเซวตา

source: Fiesta del Sacrificio-Eidul Adha
ca: Festa del Sacrifici-Eidul Adha
th: วันอีดิ้ลอัฎฮา

source: San José
ca: Sant Josep
th: วันสมโภชนักบุญโยเซฟ

source: Fiesta de Castilla y León
ca: Festa de Castella i Lleó
th: วันกัสติยาและเลออน

source: Día de Castilla-La Mancha
ca: Dia de Castella-la Manxa
th: วันกัสติยา-ลามันชา

source: Día de Canarias
ca: Dia de les Canàries
th: วันหมู่เกาะคานารี

source: Día de la Pascua Granada
ca: Dia de la Pasqua Granada
th: วันจันทร์หลังวันสมโภชพระจิตเจ้า

source: San Juan
ca: Sant Joan
th: วันสมโภชนักบุญยอห์น แบปติสต์บังเกิด

source: Fiesta Nacional de Cataluña
ca: Diada Nacional de Catalunya
th: วันชาติคาตาลูญญา

source: San Esteban
ca: Sant Esteve
th: วันสมโภชนักบุญสเตเฟน

source: Día de Extremadura
ca: Dia d'Extremadura
th: วันเอกซ์เตรมาดูรา

source: Día de las Letras Gallegas
ca: Dia de les Lletres Gallegues
th: วันวรรณกรรมกาลิเซีย

source: Día Nacional de Galicia
ca: Dia Nacional de Galícia
th: วันชาติกาลิเซีย

source: Día de las Islas Baleares
ca: Dia de les Illes Balears
th: วันหมู่เกาะบาเลอาริก

source: Día de la Región de Murcia
ca: Dia de la Regió de Múrcia
th: วันมูร์เซีย

source: Fiesta de la Comunidad de Madrid
ca: Festa de la Comunitat de Madrid
th: วันมาดริด

source: Estatuto de Autonomía de la Ciudad de Melilla
ca: Estatut d'Autonomia de la Ciutat de Melilla
th: วันกฎธรรมนูญปกครองตนเองแห่งเมืองเมลียา

source: Día de Nuestra Señora la Virgen de la Victoria
th: วันแม่พระแห่งชัยชนะ

source: Día de Melilla
th: วันเมลียา

source: Fiesta del Eid Fitr
ca: Festa de l'Eid Fitr
th: วันอีฎิ้ลฟิตริ

source: Fiesta del Sacrificio-Aid Al Adha
ca: Festa del Sacrifici-Aid Al Adha
th: วันอีดิ้ลอัฎฮา

source: San Francisco Javier
ca: Sant Francesc Xavier
th: วันสมโภชนักบุญฟรังซิสเซเวียร์

source: Día del País Vasco
ca: Dia del País Basc
th: วันแคว้นบาสก์

source: Día de La Rioja
ca: Dia de La Rioja
th: วันลารีโอฆา

source: Día de la Comunidad Valenciana
ca: Dia de la Comunitat Valenciana
th: วันแคว้นบาเลนเซีย

source: Día siguiente a San José
ca: Dia següent a Sant Josep
th: วันหลังวันสมโภชนักบุญโยเซฟ

source: Traslado de San José
ca: Trasllat de Sant Josep
th: ชดเชยวันสมโภชนักบุญโยเซฟ

source: 80 Aniversario del primer Gobierno Vasco
ca: 80è Aniversari del primer Govern Basc
th: วันครบรอบ 80 ปี การก่อตั้งรัฐบาลแคว้นบาสก์ชุดแรก

source: V Centenario Vuelta al Mundo
ca: V Centenari de la Volta al Món
th: วันครบรอบ 500 ปี การเดินเรือรอบโลก

source: Lunes de Fallas
ca: Dilluns de les Falles
th: วันจันทร์เทศกาลเผาหุ่นฟายัส

source: %s 대체 휴일
th: ชดเชย%s

source: %s 전날
th: วันก่อน%s

source: %s 다음날
th: วันหลัง%s

source: 신정연휴
th: วันปีใหม่สากล

source: 설날
th: เทศกาลซอลลัล

source: 민속의 날
th: วันเทศกาลพื้นบ้าน

source: 삼일절
th: วันอิสรภาพ

source: 식목일
th: วันปลูกต้นไม้

source: 부처님오신날
th: วันวิสาขบูชา

source: 석가탄신일
th: วันประสูติของพระพุทธเจ้า

source: 어린이날
th: วันเด็ก

source: 현충일
th: วันรำลึกวีรชน

source: 제헌절
th: วันรัฐธรรมนูญ

source: 광복절
th: วันฉลองอิสรภาพ

source: 국군의 날
th: วันกองทัพ

source: 개천절
th: วันสถาปนาประเทศ

source: 한글날
th: วันฮันกึล

source: 국제연합일
th: วันสหประชาชาติ

source: 추석
th: เทศกาลชูซอก

source: 기독탄신일
th: วันคริสต์มาส

source: 국회의원 선거일
th: วันเลือกตั้งสมัชชาแห่งชาติ

source: 대통령 선거일
th: วันเลือกตั้งประธานาธิบดี

source: 지방선거일
th: วันเลือกตั้งท้องถิ่น

source: 근로자의날
th: วันแรงงาน

source: 임시공휴일
th: วันหยุดพิเศษ (เพิ่มเติม)

source: 대통령 취임식
th: วันสาบานตนประธานาธิบดี

source: 통일주체국민회의 선거일
th: วันเลือกตั้งสมัชชาแห่งชาติเพื่อการรวมชาติ

source: 유신헌법 국민투표일
th: วันลงประชามติแก้ไขรัฐธรรมนูญฉบับยูชิน

source: 5.16 군사혁명 기념일
th: วันครบรอบการรัฐประหาร 16 พ.ค.

source: 4.19 혁명 기념일
th: วันครบรอบการปฏิวัติ 19 เม.ย.

source: 이승만 대통령 탄신일
th: วันคล้ายวันเกิดประธานาธิบดี อี ซึง-มัน

source: 국제연합의 대한민국 정부 승인 경축 국민대회
th: เฉลิมฉลองการยอมรับของรัฐบาลสาธารณรัฐเกาหลีโดยสหประชาชาติ

source: 5.10 제헌의회선거 1주년 기념일
th: ครบรอบ 1 ปีการเลือกตั้งสมัชชาแห่งชาติ

source: 백범 김구 선생 국민장 영결식
th: พิธีศพ แพ็กบ็อม คิม กู

source: 부통령 선거일
th: วันเลือกตั้งรองประธานาธิบดี

source: 사방의 날
th: วันซาบัง

source: 신정부 경축의 날
th: วันเฉลิมฉลองรัฐบาลใหม่

source: 아폴로 11호 달 착륙 기념
th: วันรำลึกการลงจอดบนดวงจันทร์สำเร็จของยานอะพอลโล 11

source: 삼선 헌법 개정 국민투표일
th: วันลงประชามติแก้ไขรัฐธรรมนูญเรื่องการเข้ารับตำแหน่งสมัยที่ 3

source: 대통령 영부인 육영수 여사 국민장 영결식
th: พิธีศพสุภาพสตรีหมายเลขหนึ่ง ยุก ย็อง-ซู

source: 박정희 대통령 국장 영결식
th: พิธีศพประธานาธิบดี พัก จ็อง-ฮี

source: 제5공화국 헌법 개정 국민투표일
th: วันลงประชามติแก้ไขรัฐธรรมนูญของสาธารณรัฐเกาหลีที่ห้า

source: 선거를 위한 선거인단 선일
th: วันเลือกตั้งคณะผู้เลือกตั้ง

source: 제6공화국 헌법 개정 국민투표일
th: วันลงประชามติแก้ไขรัฐธรรมนูญของสาธารณรัฐเกาหลีที่หก

source: 1988 서울 올림픽 개막식
th: พิธีเปิดโอลิมปิกฤดูร้อน 1988 โซล

source: 2002년 한일 월드컵 대표팀 4강 진출
th: ฉลองทีมชาติเกาหลีเข้ารอบฟุตบอลโลก 2002 รอบรองชนะเลิศ

source: 전몰군인 합동위령제
th: วันร่วมรำลึกทหารที่เสียชีวิต

source: Uudenvuodenpäivä
th: วันขึ้นปีใหม่

source: Loppiainen
th: วันสมโภชพระคริสต์แสดงองค์

source: Pitkäperjantai
th: วันศุกร์ประเสริฐ

source: Pääsiäispäivä
th: วันอาทิตย์อีสเตอร์

source: Toinen pääsiäispäivä
th: วันจันทร์อีสเตอร์

source: Vappu
th: วันเมย์เดย์ (วันแรงงาน)

source: Helatorstai
th: วันสมโภชพระเยซูเจ้าเสด็จขึ้นสวรรค์

source: Helluntaipäivä
th: วันสมโภชพระจิตเจ้า

source: Juhannusaatto
th: วันมิดซัมเมอร์อีฟ (วันก่อนวันกลางฤดูร้อน)

source: Juhannuspäivä
th: วันมิดซัมเมอร์ (วันกลางฤดูร้อน)

source: Pyhäinpäivä
th: วันสมโภชนักบุญทั้งหลาย

source: Itsenäisyyspäivä
th: วันประกาศอิสรภาพฟินแลนด์

source: Jouluaatto
th: วันคริสต์มาสอีฟ

source: Joulupäivä
th: วันคริสต์มาส

source: Tapaninpäivä
th: วันคริสต์มาสวันที่สอง

source: Runebergin päivä
th: วันรูนแบร์ก

source: Minna Canthin päivä, tasa-arvon päivä
th: วันมินน่า คานท์, วันแห่งความความเสมอภาค

source: Mikael Agricolan päivä, suomen kielen päivä
th: วันมิคาเอล อากริโคลา, วันภาษาฟินแลนด์

source: Kansallinen veteraanipäivä
th: วันทหารผ่านศึกแห่งชาติ

source: Eurooppa-päivä
th: วันยุโรป

source: J.V. Snellmanin päivä, suomalaisuuden päivä
th: วันเจ.วี. สเนลล์มาน, วันมรดกฟินแลนด์

source: J.V. Snellmanin päivä
th: วันเจ.วี. สเนลล์มาน

source: Kaatuneitten muistopäivä
th: วันรำลึก

source: Eino Leinon päivä, runon ja suven päivä
th: วันไอนอ ไลโน, วันแห่งบทกวีและฤดูร้อน

source: Suomen luonnon päivä
th: วันสิ่งแวดล้อมฟินแลนด์

source: Miina Sillanpään ja kansalaisvaikuttamisen päivä
th: วันมีนา ซิลลันแป, วันส่งเสริมการมีส่วนร่วมของพลเมือง

source: Aleksis Kiven päivä, suomalaisen kirjallisuuden päivä
th: วันอเล็กซิส กีวี, วันวรรณกรรมฟินแลนด์

source: Aleksis Kiven päivä
th: วันอเล็กซิส กีวี

source: YK:n päivä
th: วันสหประชาชาติ

source: Ruotsalaisuuden päivä, Kustaa Aadolfin päivä
th: วันมรดกสวีเดน-ฟินแลนด์, วันกุสตาฟวัส อดอลฟัส

source: Isänpäivä
th: วันพ่อ

source: Lapsen oikeuksien päivä
th: วันสิทธิเด็ก

source: Jean Sibeliuksen päivä, suomalaisen musiikin päivä
th: วันฌอง ซิเบลิอุส, วันดนตรีฟินแลนด์

source: Kalevalan päivä, suomalaisen kulttuurin päivä
th: วันกาเลวาลา, วันวัฒนธรรมฟินแลนด์

source: Äitienpäivä
th: วันแม่

source: Puolustusvoimain lippujuhlan päivä
th: วันกองกำลังป้องกันฟินแลนด์

source: Suomen marsalkan syntymäpäivä
th: วันคล้ายวันเกิดจอมพลแห่งฟินแลนด์

source: Suomen lipun päivä
th: วันธงชาติฟินแลนด์

source: Ahvenanmaan itsehallintopäivä
th: วันปกครองตนเองหมู่เกาะโอลันด์

source: Mahatma Gandhi’s Birthday
ml: മഹാത്മാ ഗാന്ധി ജന്മദിനം

source: Diwali (Deepavali)
ml: ദീപാവലി

source: Dussehra (Vijay Dashami)
ml: ദശരാ (വിജയ് ദശമി)

source: Maha Shivratri
ml: മഹാ ശിവരാത്രി

source: Guru Nanak’s Birthday
ml: ഗുരു നാനക് ജന്മദിനം

source: Milad‑un‑Nabi / Id‑e‑Milad
ml: മിലാദ്‑ഉന്‍ നബി / ഇദ്‑എ‑മിലാദ്

source: Id‑ul‑Fitr
ml: ഇദ്‑ഉൽ‑ഫിതർ

source: Id‑ul‑Zuha (Bakrid)
ml: ഇദ്‑ഉൽ‑സുഹ (ബക്രിദ്)

source: Christmas Day
ml: ക്രിസ്മസ്
mt: Il-Milied

source: Ganesh Chaturthi / Vinayak Chaturthi
ml: ഗണേഷ് ചതുര്തി / വിനായക് ചതുര്തി

source: Vishu
ml: വിഷു

source: Puthandu
ml: പുതൻഡു (തമിഴ് പുതുവർഷം)

source: Eid al-Fitr (Optional)
ml: ഇദ്-ഉൽ-ഫിതർ (ഐച്ഛികം)

source: Eid al-Adha (Optional)
ml: ഇദ്-ഉൽ-സുഹ / ബക്രിദ് (ഐച്ഛികം)

source: Nehru Trophy Boat Race
ml: നെഹ്രു ട്രോഫി ബോട്ട് റേസ്

source: Attukal Pongala
ml: അറ്റുക്കൽ പൊങ്കാല

source: Vallamkali
ml: വള്ളംകളി

source: Thrissur Pooram
ml: തൃശ്ശൂർ പൂരം

source: Chingam 1 (Malayalam New Year)
ml: ചിങ്ങം 1 (മലയാളം പുതുവർഷം)

source: Buddha Purnima (Observed)
ml: ബുദ്ധ പൂർണിമ (കാഴ്ച)

source: Dussehra (Observed)
ml: ദശരാ (കാഴ്ച)

source: Special In Lieu Holiday
th: วันหยุดชดเชย

source: Thai Election Day
th: วันเลือกตั้ง

source: %s (in lieu)
th: ชดเชย%s

source: Bridge Public Holiday
th: วันหยุดพิเศษ (เพิ่มเติม)

source: HM King Bhumibol Adulyadej's Golden Jubilee
th: พระราชพิธีกาญจนาภิเษก พ.ศ. 2539

source: HM King Bhumibol Adulyadej's 60th Anniversary of Accession Event
th: พระราชพิธีฉลองสิริราชสมบัติครบ 60 ปี พ.ศ. 2549

source: Emergency Lockdown (Thai Military Coup d'etat)
th: วันหยุดพิเศษ (คมช.)

source: Emergency Lockdown (Thai Political Unrest)
th: วันหยุดพิเศษ (การเมือง)

source: Emergency Lockdown (2011 Thailand Floods)
th: วันหยุดพิเศษ (มหาอุทกภัย พ.ศ. 2554)

source: Day of Mourning for HM King Bhumibol Adulyadej
th: วันหยุดพิเศษ (ร่วมถวายอาลัย ส่งดวงพระวิญญาณพระบรมศพ)

source: HM King Bhumibol Adulyadej's Royal Cremation Ceremony
th: วันพระราชพิธีถวายพระเพลิงพระบรมศพพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดช

source: HM King Maha Vajiralongkorn's Coronation Celebrations
th: พระราชพิธีบรมราชาภิเษก พระบาทสมเด็จพระวชิรเกล้าเจ้าอยู่หัว

source: Songkran Festival
th: วันสงกรานต์

source: New Year's Day
mt: L-Ewwel tas-Sena
th: วันขึ้นปีใหม่

source: New Year's Eve
th: วันสิ้นปี

source: Chakri Memorial Day
th: วันจักรี

source: National Labour Day
th: วันแรงงานแห่งชาติ

source: National Day
th: วันชาติ

source: Coronation Day
th: วันฉัตรมงคล

source: HM Queen Suthida's Birthday
th: วันเฉลิมพระชนมพรรษาสมเด็จพระนางเจ้าสุทิดา พัชรสุธาพิมลลักษณ พระบรมราชินี

source: HM King Maha Vajiralongkorn's Birthday
th: วันเฉลิมพระชนมพรรษา พระบาทสมเด็จพระเจ้าอยู่หัว

source: HM Queen Sirikit's Birthday
th: วันเฉลิมพระชนมพรรษาสมเด็จพระนางเจ้าสิริกิติ์ พระบรมราชินีนาถ

source: HM Queen Sirikit The Queen Mother's Birthday
th: วันเฉลิมพระชนมพรรษาสมเด็จพระนางเจ้าสิริกิติ์ พระบรมราชินีนาถ พระบรมราชชนนีพันปีหลวง

source: National Mother's Day
th: วันแม่แห่งชาติ

source: HM King Bhumibol Adulyadej Memorial Day
th: วันคล้ายวันสวรรคตพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดช บรมนาถบพิตร

source: HM King Bhumibol Adulyadej the Great Memorial Day
th: วันคล้ายวันสวรรคตพระบาทสมเด็จพระบรมชนกาธิเบศร มหาภูมิพลอดุลยเดชมหาราช บรมนาถบพิตร

source: HM King Chulalongkorn Memorial Day
th: วันปิยมหาราช

source: HM King Bhumibol Adulyadej's Birthday
th: วันคล้ายวันเฉลิมพระชนมพรรษาพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดช บรมนาถบพิตร

source: HM King Bhumibol Adulyadej the Great's Birthday
th: วันคล้ายวันเฉลิมพระชนมพรรษาพระบาทสมเด็จพระบรมชนกาธิเบศร มหาภูมิพลอดุลยเดชมหาราช บรมนาถบพิตร

source: National Father's Day
th: วันพ่อแห่งชาติ

source: Constitution Day
th: วันรัฐธรรมนูญ

source: Makha Bucha
th: วันมาฆบูชา

source: Visakha Bucha
th: วันวิสาขบูชา

source: Asarnha Bucha
th: วันอาสาฬหบูชา

source: Buddhist Lent Day
th: วันเข้าพรรษา

source: Royal Ploughing Ceremony
th: วันพืชมงคล

source: %s (aproximada)
th: %s (โดยประมาณ)

source: Dia de Ano Novo
th: วันขึ้นปีใหม่

source: Dia dos Veteranos
th: วันทหารผ่านศึก

source: Sexta-Feira Santa
th: วันศุกร์ประเสริฐ

source: Dia Mundial do Trabalhador
th: วันแรงงานสากล

source: Dia da Restauração da Independência
th: วันรำลึกการกอบกู้เอกราชติมอร์-เลสเต

source: Festa do Corpo de Deus
th: วันสมโภชพระคริสตวรกาย

source: Dia da Consulta Popular
th: วันรำลึกการลงประชามติเอกราช

source: Dia de Todos os Santos
th: วันสมโภชนักบุญทั้งหลาย

source: Dia de Todos os Fiéis Defuntos
th: วันภาวนาอุทิศแด่ผู้ล่วงลับ

source: Dia Nacional da Mulher
th: วันสตรีแห่งชาติ

source: Dia Nacional da Juventude
th: วันเยาวชนแห่งชาติ

source: Dia da Proclamação da Independência
th: วันประกาศเอกราชติมอร์-เลสเต

source: Dia da Memória
th: วันรำลึกวีรชน

source: Dia de Nossa Senhora da Imaculada Conceição, padroeira de Timor-Leste
th: วันสมโภชแม่พระผู้ปฏิสนธินิรมลและแม่พระองค์อุปถัมภ์แห่งติมอร์-เลสเต

source: Dia de Natal
th: วันคริสต์มาส

source: Dia dos Heróis Nacionais
th: วันวีรบุรุษแห่งชาติ

source: Idul Fitri
th: วันอีฎิ้ลฟิตริ

source: Idul Adha
th: วันอีดิ้ลอัฎฮา

source: Quarta-Feira de Cinzas
th: วันพุธรับเถ้า

source: Quinta-Feira Santa
th: วันพฤหัสศักดิ์สิทธิ์

source: Dia da Ascensão de Jesus Cristo ao Céu
th: วันสมโภชพระเยซูเจ้าเสด็จขึ้นสวรรค์

source: Dia Mundial da Criança
th: วันเด็กสากล

source: Dia das Forças Armadas de Libertação Nacional de Timor-Leste (FALINTIL)
th: วันกองกำลังปลดปล่อยแห่งชาติติมอร์-เลสเต (FALINTIL)

source: Dia Mundial dos Direitos Humanos
th: วันสิทธิมนุษยชนสากล

source: Feriados Nacionais (Especiais)
th: วันหยุดพิเศษ (เพิ่มเติม)

source: Dia da Eleição Presidencial
th: วันเลือกตั้งประธานาธิบดี

source: Dia de Eleições Parlamentares
th: วันเลือกตั้งสมาชิกรัฐสภา

source: Dia de eleições locais
th: วันเลือกตั้งท้องถิ่น

source: Centenário da Revolta de Dom Boaventura
th: วันครบรอบ 100 ปีแห่งการลุกฮือของดอม โบอาเวนตูรา

source: Cerimónias Fúnebres de Fernando 'La Sama' de Araújo
th: พิธีศพเฟอร์นันโด 'ลา ซามา' เด อาเราโฆ

source: Celebrações do 20.º Aniversário da Consulta Popular
th: วันครบรอบ 20 ปีของการลงประชามติเอกราช

source: Celebrações do 25.º Aniversário da Consulta Popular
th: วันครบรอบ 25 ปีของการลงประชามติเอกราช

source: Visita de Sua Santidade o Papa Francisco a Timor-Leste
th: การเสด็จเยือนติมอร์-เลสเตของสมเด็จพระสันตะปาปาฟรานซิส

source: %s (ግምት)
ar: (تقدير) %s

source: የገና ወይም የልደት በዓል
ar: عيد الميلاد الإثيوبي (جنا)

source: የጥምቀት በዓል
ar: عيد الغطاس الإثيوبي (طمقت)

source: የአድዋ ድል በዓል
ar: عيد النصر في معركة عدوا

source: የስቅለት በዓል
ar: جمعة الآلام (سقلَت)

source: የትንሳኤ(ፋሲካ) በዓል
ar: عيد القيامة (فاسيكا)

source: የዓለም የሠራተኞች (የላብአደሮች) ቀን
ar: اليوم العالمي للعمال

source: የአርበኞች (የድል) ቀን በዓል
ar: يوم انتصار الوطنيين الإثيوبيين

source: ደርግ የወደቀበት ቀን
ar: يوم سقوط نظام الدرج

source: የዘመን መለወጫ (እንቁጣጣሽ) በዓል
ar: رأس السنة الإثيوبية (إنكوتاتاش)

source: የመስቀል በዓል
ar: عيد الصليب (مسقل)

source: የአብዮት ቀን
ar: يوم الثورة الشعبية

source: ገና
ar: عيد الميلاد

source: ጥምቀት
ar: عيد الغطاس

source: አድዋ
ar: العدوة

source: ስቅለት
ar: جمعة جيدة

source: ፋሲካ
ar: عيد الفصح

source: የሰራተኞች ቀን
ar: يوم العمال

source: የአርበኞች ቀን
ar: يوم الوطنيين

source: እንቁጣጣሽ
ar: السنة الإثيوبية الجديدة

source: መስቀል
ar: مسكل

source: የጥቅምት አብዮት ቀን
ar: يوم ثورة أكتوبر

source: የኢድ አልፈጥር
ar: عيد الفطر

source: የኢድ አልአድሃ (አረፋ)
ar: عيد الأضحى

source: የመውሊድ በዓል
ar: عيد المولد النبوي

source: የሰማዕታት ቀን
ar: يوم الشهداء

source: የብሔር ብሔረሰቦች ቀን
ar: يوم الأمم والقوميات والشعوب

source: ኢድ አልፈጥር
ar: عيد الفطر

source: አረፋ
ar: عيد الأضحى

source: መውሊድ
ar: عيد المولد النبوي

source: %s (проценето)
uk: %s (приблизна дата)

source: %s (неработен ден)
uk: %s (вихідний)

source: %s (неработен ден, проценето)
uk: %s (вихідний, приблизна дата)

source: Нова Година
uk: Новий рік

source: Божиќ
uk: Різдво Христове

source: Велигден
uk: Великодній понеділок

source: Ден на трудот
uk: День праці

source: Светите Кирил и Методиј - Ден на сесловенските просветители
uk: День Святих Кирила та Мефодія, всесловʼянських просвітителів

source: Ден на Републиката
uk: День Республіки

source: Ден на независноста
uk: День незалежності

source: Ден на народното востание
uk: День народного повстання

source: Ден на македонската револуционерна борба
uk: День македонської революційної боротьби

source: Свети Климент Охридски
uk: День Святого Климента Охридського

source: Рамазан Бајрам
uk: Рамазан-байрам

source: Ден на Албанската азбука
uk: День албанського алфавіту

source: Меѓународен ден на Бошњаците
uk: Міжнародний день босняків

source: Сите Светци
uk: День усіх святих

source: Јом Кипур
uk: Йом Кіпур

source: Курбан Бајрам
uk: Курбан-байрам

source: Бадник
uk: Святий вечір

source: Богојавление
uk: Богоявлення

source: Велики Петок
uk: Страсна пʼятниця

source: Успение на Пресвета Богородица
uk: Успіння Пресвятої Богородиці

source: Духовден
uk: Трійця

source: Меѓународен ден на Ромите
uk: Міжнародний день ромів

source: Свети Сава
uk: День Святого Сави

source: Ден на настава на турски јазик
uk: День викладання турецької мови

source: Национален ден на Власите
uk: Національний день влахів

source: Ден на изборите
uk: День виборів

source: Jour de l'an
th: วันขึ้นปีใหม่

source: Lundi de Pâques
th: วันจันทร์อีสเตอร์

source: Lundi de Pentecôte
th: วันจันทร์หลังวันสมโภชพระจิตเจ้า

source: Fête du Travail
th: วันแรงงาน

source: Fête du Travail et de la Concorde sociale
th: วันแรงงานและความสมานฉันท์ทางสังคม

source: 1er mai
th: วันเมย์เดย์

source: Fête de la Victoire
th: วันแห่งชัยชนะ

source: Ascension
th: วันสมโภชพระเยซูเจ้าเสด็จขึ้นสวรรค์

source: Fête nationale
th: วันชาติฝรั่งเศส

source: Assomption
th: วันสมโภชแม่พระรับเกียรติยกขึ้นสวรรค์

source: Toussaint
th: วันสมโภชนักบุญทั้งหลาย

source: Armistice
th: วันสงบศึก

source: Noël
th: วันคริสต์มาส

source: Vendredi saint
th: วันศุกร์ประเสริฐ

source: Saint Étienne
th: วันสมโภชนักบุญสเตเฟน

source: Mi-Carême
th: วันเฉลิมฉลองกลางเทศกาลมหาพรต

source: Abolition de l'esclavage
th: วันเลิกทาส

source: Fête de Victor Schoelcher
th: วันวิกตอร์ เชลแชร์

source: Fête de la Citoyenneté
th: วันแห่งความเป็นพลเมือง

source: Fête de la prise de possession
th: วันประกาศอธิปไตยเหนือดินแดน

source: Arrivée de l'Évangile
th: วันคริสตธรรมมาถึง

source: Fête de l'autonomie
th: วันปกครองตนเอง

source: Matāri'i
th: วันขึ้นปีใหม่โพลินีเซีย (มาตารีอิ)

source: Saint Pierre Chanel
th: วันสมโภชนักบุญเปโตร ชาเนล

source: Saints Pierre et Paul
th: วันสมโภชนักบุญเปโตรและเปาโล

source: Fête du Territoire
th: วันก่อตั้งดินแดน

source: %s (المقدرة)
fr: %s (estimé)

source: رأس السنة الميلادية
fr: Jour de l'An Grégorien

source: رأس السنة الأمازيغية
fr: Jour de l'An Amazigh

source: عيد العمال
fr: Fête du Travail

source: عيد الاستقلال
fr: Fête de l'Indépendance

source: عيد الاستقلال وجبهة التحرير الوطني
fr: Fête de l'Indépendance et du F.L.N.

source: عيد الثورة
fr: Fête de la Révolution

source: رأس السنة الهجرية
fr: Awal Moharram

source: عاشورة
fr: Achoura

source: عيد المولد النبوي
fr: El-Mawlid Ennabawi Echarif

source: عيد الفطر
fr: Aïd el-Fitr

source: عطلة عيد الفطر
fr: Congé de l'Aïd el-Fitr

source: عيد الأضحى
fr: Aïd el-Adha

source: عطلة عيد الأضحى
fr: Congé de l'Aïd el-Adha

source: إثنين الفصح
fr: Lundi de Pâques

source: عيد الصعود
fr: Ascension

source: إثنين العنصرة
fr: Lundi de Pentecôte

source: عيد انتقال السيدة العذراء
fr: Assomption

source: عيد الميلاد
fr: Noël

source: رأس السنة العبرية
fr: Roch Achana

source: يوم الغفران
fr: Youm Kippour

source: عيد الفصح اليهودي
fr: Pisah

source: روز آزادی
ps_af: د ازادۍ ورځ

source: روز شکست مجاهدین
ps_af: د مجاهدینو د ماتې ورځ

source: روز جهانی کارگر
ps_af: د کارګرو نړیواله ورځ

source: روز استقلال
ps_af: د خپلواکۍ ورځ

source: روز خروج آمریکایی‌ها
ps_af: د امریکا د وتلو ورځ

source: روز شهیدان
ps_af: د شهیدانو ورځ

source: روز عرفه
ps_af: د عرفه ورځ

source: میلاد پیامبر
ps_af: د پیغمبر الله صلی الله علیه وسلم د میلاد ورځ

source: اول رمضان
ps_af: د روژې لومړۍ نیټه

source: روز اول عید فطر
ps_af: د اختر لومړۍ ورځ

source: روز دوم عید فطر
ps_af: د اختر دوهمه ورځ

source: سومین روز عید فطر
ps_af: د اختر درېیمه ورځ

source: اول روز عید قربان
ps_af: د قربان لومړۍ ورځ

source: روز دوم عید قربان
ps_af: د قربان دوهمه ورځ

source: سومین روز عید قربان
ps_af: د قربان دریمه ورځ

source: %s (برآورد شده)
ps_af: %s (اټکل)

source: %s (مشاهده شده)
ps_af: %s (په دې وروستیو کې د افغانستان د کرکټ ملی)

source: %s (مشاهده شده، برآورد شده)
ps_af: %s (مشاهده شده، تخمین زده شده است)

source: روز پیروزی شوروی
ps_af: د شوروی د بریالیتوب ورځ

source: Πρωτοχρονιά
uk: Новий рік

source: Ημέρα των Θεοφανίων
uk: Богоявлення

source: Καθαρά Δευτέρα
uk: Чистий понеділок

source: Ημέρα της Ελληνικής Ανεξαρτησίας
uk: День незалежності Греції

source: Εθνική Ημέρα Κύπρου
uk: Національне свято Кіпру

source: Μεγάλη Παρασκευή
uk: Страсна пʼятниця

source: Κυριακή του Πάσχα
uk: Великдень

source: Δευτέρα της Διακαινησίμου
uk: Великодній понеділок

source: Πρωτομαγιά
uk: День праці

source: Δευτέρα του Αγίου Πνεύματος
uk: День Святого Духа

source: Κοίμηση της Θεοτόκου
uk: Успіння Пресвятої Богородиці

source: Ημέρα της Κυπριακής Ανεξαρτησίας
uk: День незалежності Кіпру

source: Ημέρα του Όχι
uk: День Охі

source: Παραμονή Χριστουγέννων
uk: Святий вечір

source: Χριστούγεννα
uk: Різдво Христове

source: Επομένη Χριστουγέννων
uk: Другий день Різдва

source: Τρίτη της Διακαινησίμου
uk: Великодній вівторок

source: Μεγάλο Σάββατο
uk: Велика субота

source: Nýggjársdagur
da: Nytårsdag
is: Nýársdagur
no: Nyttårsdag
sv: Nyårsdagen

source: Skírhósdagur
da: Skærtorsdag
is: Skírdagur
no: Skjærtorsdag
sv: Skärtorsdagen

source: Langifríggjadagur
da: Langfredag
is: Föstudagurinn langi
no: Langfredag
sv: Långfredagen

source: Páskadagur
da: Påskedag
no: Første påskedag
sv: Påskdagen

source: Annar páskadagur
da: Anden påskedag
is: Annar í páskum
no: Andre påskedag
sv: Annandag påsk
