Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/AD.po
Languages: uk

source: Cap d'Any
uk: Новий рік

source: Reis
uk: Богоявлення

source: Carnaval
uk: Карнавал

source: Dia de la Constitució
uk: День Конституції

source: Divendres Sant
uk: Страсна пʼятниця

source: Dilluns de Pasqua
uk: Великодній понеділок

source: Festa del treball
uk: День праці

source: Dilluns de Pentecosta
uk: День Святого Духа

source: Assumpció
uk: Внебовзяття Пресвятої Діви Марії

source: Nostra Senyora de Meritxell
uk: День Богоматері Мерічелльської

source: Tots Sants
uk: День усіх святих

source: Immaculada Concepció
uk: Непорочне зачаття Діви Марії

source: Nadal
uk: Різдво Христове

source: Sant Esteve
uk: День Святого Стефана

source: Sant Roc
uk: День Святого Роха

source: Sant Antoni
uk: День Святого Антонія

source: Sant Pere
uk: День Святого Петра

source: Sant Julià
uk: День Святого Юліана

source: Diada de Canòlich
uk: День Богоматері Каноліхської

source: Festa Major de Sant Julià de Lòria
uk: Свято парафії Сант-Жулія-де-Лорія

source: Festa Major d'Andorra la Vella
uk: Свято парафії Андорра-ла-Велья

source: Sant Miquel d'Engolasters
uk: День Святого Михаїла Енголастерського

source: Diada de la creació de la parròquia
uk: День створення парафії

source: Festa Major d'Escaldes-Engordany
uk: Свято парафії Ескальдес-Енгордань

source: %s (a partir de les 13h)
uk: %s (з 13:00)

source: Vigília de Reis
uk: Переддень Богоявлення

source: Dijous Sant
uk: Великий четвер

source: Vigília de Nadal
uk: Святий вечір

source: Vigília de Cap d'Any
uk: Переддень Нового року
