Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/AE.po
Languages: th

source: %s (المقدرة)
th: ชดเชย%s

source: رأس السنة الميلادية
th: วันขึ้นปีใหม่

source: يوم الشهيد
th: วันรำลึกผู้อุทิศตน

source: اليوم الوطني
th: วันชาติสหรัฐอาหรับเอมิเรตส์

source: عيد الفطر
th: วันอีฎิ้ลฟิตริ

source: عطلة عيد الفطر
th: เทศกาลอีฎิ้ลฟิตริ

source: وقفة عرفة
th: วันอารอฟะห์

source: عيد الأضحى
th: วันอีดิ้ลอัฎฮา

source: عطلة عيد الأضحى
th: เทศกาลอีดิ้ลอัฎฮา

source: رأس السنة الهجرية
th: วันขึ้นปีใหม่อิสลาม

source: ليلة المعراج
th: วันเมี๊ยะราจ

source: عيد المولد النبوي
th: วันเมาลิดนบี

source: وفاة الشيخ خليفة بن زايد آل نهيان
th: วันไว้ทุกข์แห่งชาติแด่ชีค คาลิฟา บิน ซายิด อัล นาห์ยัน

source: يوم زيارة البابا فرنسيس
th: สมเด็จพระสันตะปาปาฟรานซิสเสด็จเยือนสหรัฐอาหรับเอมิเรตส์
