Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/BF.po
Languages: fr

source: %s (estimated)
fr: %s (estimé)

source: %s (observed, estimated)
fr: %s (observé, estimé)

source: %s (observed)
fr: %s (observé)

source: New Year's Day
fr: Jour de l’An

source: Revolution Day
fr: Journée de la Révolution

source: International Women's Day
fr: Journée internationale des femmes

source: Easter Monday
fr: Lundi de Pâques

source: Labour Day
fr: Fête du Travail

source: Ascension Day
fr: Ascension

source: Independence Day
fr: Fête de l’Indépendance

source: Assumption Day
fr: Assomption

source: Martyrs' Day
fr: Journée des Martyrs

source: All Saints' Day
fr: Toussaint

source: Proclamation of Independence Day
fr: Proclamation de l’Indépendance

source: Christmas Day
fr: Fête de Noël

source: Eid al-Fitr
fr: Aïd el-Fitr

source: Eid al-Adha
fr: Aïd el-Adha
