Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/BY.po
Languages: ru, th

source: Выходны (перанесены з %s)
ru: Выходной (перенесено с %s)
th: วันหยุด (แทน %s)

source: Дзень Канстытуцыі
ru: День Конституции
th: วันรัฐธรรมนูญ

source: Дзень яднання народаў Беларусі і Расіі
ru: День единения народов Беларуси и России
th: วันแห่งความสามัคคีของประชาชนเบลารุสและรัสเซีย

source: Дзень Перамогі
ru: День Победы
th: วันแห่งชัยชนะ

source: Дзень Дзяржаўнага сцяга, Дзяржаўнага герба і Дзяржаўнага гімна Рэспублікі Беларусь
ru: День Государственного флага, Государственного герба и Государственного гимна Республики Беларусь
th: วันธงชาติ ตราแผ่นดิน และเพลงชาติแห่งสาธารณรัฐเบลารุส

source: Дзень Незалежнасці Рэспублікі Беларусь (Дзень Рэспублікі)
ru: День Независимости Республики Беларусь (День Республики)
th: วันประกาศอิสรภาพแห่งสาธารณรัฐเบลารุส (วันสาธารณรัฐ)

source: Дзень народнага адзінства
ru: День народного единства
th: วันแห่งความสามัคคีของประชาชน

source: Новы год
ru: Новый год
th: วันขึ้นปีใหม่

source: Дзень абаронцаў Айчыны і Узброеных Сіл Рэспублікі Беларусь
ru: День защитников Отечества и Вооруженных Сил Республики Беларусь
th: วันพิทักษ์ปิตุภูมิและกองทัพแห่งสาธารณรัฐเบลารุส

source: Дзень жанчын
ru: День женщин
th: วันสตรี

source: Свята працы
ru: Праздник труда
th: วันแรงงาน

source: Дзень Кастрычніцкай рэвалюцыі
ru: День Октябрьской революции
th: วันครบรอบการปฏิวัติเดือนตุลาคม

source: Нараджэнне Хрыстова (праваслаўнае Раство)
ru: Рождество Христово (православное Рождество)
th: วันประสูติของพระคริสต์ (คริสต์มาสนิกายออร์โธดอกซ์)

source: Каталiцкi Вялiкдзень
ru: Католическая Пасха
th: วันอีสเตอร์นิกายคาทอลิก

source: Праваслаўны Вялiкдзень
ru: Православная Пасха
th: วันอีสเตอร์นิกายออร์โธดอกซ์

source: Радаўніца
ru: Радуница
th: ราเดาว์นิตซา (วันแห่งความยินดี)

source: Дзень памяці
ru: День памяти
th: ดียาดี (วันภาวนาอุทิศแด่ผู้ล่วงลับ)

source: Нараджэнне Хрыстова (каталіцкае Раство)
ru: Рождество Христово (католическое Рождество)
th: วันประสูติของพระคริสต์ (คริสต์มาสนิกายคาทอลิก)
