Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/CH.po
Languages: th

source: Neujahrstag
th: วันขึ้นปีใหม่

source: Auffahrt
th: วันสมโภชพระเยซูเจ้าเสด็จขึ้นสวรรค์

source: Nationalfeiertag
th: วันชาติสวิตเซอร์แลนด์

source: Weihnachten
th: วันคริสต์มาส

source: Berchtoldstag
th: วันสมโภชนักบุญแบร์กโทลด์

source: Karfreitag
th: วันศุกร์ประเสริฐ

source: Ostermontag
th: วันจันทร์อีสเตอร์

source: Tag der Arbeit
th: วันแรงงาน

source: Pfingstmontag
th: วันจันทร์หลังวันสมโภชพระจิตเจ้า

source: Fronleichnam
th: วันสมโภชพระคริสตวรกาย

source: Mariä Himmelfahrt
th: วันสมโภชแม่พระรับเกียรติยกขึ้นสวรรค์

source: Allerheiligen
th: วันสมโภชนักบุญทั้งหลาย

source: Mariä Empfängnis
th: วันสมโภชแม่พระผู้ปฏิสนธินิรมล

source: Stephanstag
th: วันสมโภชนักบุญสเตเฟน

source: Genfer Bettag
th: วันถือศีลอดเจนีวา

source: Wiederherstellung der Republik
th: วันกอบกู้เอกราชสาธารณรัฐเจนีวา

source: Näfelser Fahrt
th: วันรำลึกชัยชนะยุทธการเนเฟลส์

source: Fest der Unabhängigkeit
th: วันประกาศเอกราชจูรา

source: Jahrestag der Ausrufung der Republik
th: วันครบรอบการสถาปนาสาธารณรัฐนอยชาแตล

source: Josefstag
th: วันสมโภชนักบุญโยเซฟ

source: Bruder Klaus
th: วันสมโภชนักบุญนิโคลัสแห่งฟลือเออ

source: Heilige Drei Könige
th: วันสมโภชพระคริสต์แสดงองค์

source: Peter und Paul
th: วันสมโภชนักบุญเปโตรและเปาโล

source: Bettagsmontag
th: วันจันทร์แห่งการอธิษฐาน

source: Knabenschiessen
th: คนาเบนชิสเซน

source: Vortag vor Karfreitag
th: วันก่อนวันศุกร์ประเสริฐ

source: Sechseläuten
th: เซ็กเซ่ะเล๊าเท่น

source: Heiligabend
th: วันคริสต์มาสอีฟ

source: Vortag vor Neujahr
th: วันสิ้นปี

source: Vortag vor Auffahrt
th: วันก่อนวันสมโภชพระเยซูเจ้าเสด็จขึ้นสวรรค์

source: Brückentag nach Auffahrt
th: วันหยุดเพิ่มเติมสำหรับวันสมโภชพระเยซูเจ้าเสด็จขึ้นสวรรค์

source: Brückentag
th: วันหยุดเพิ่มเติม
