Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/CV.po
Languages: de, es, fr

source: Ano Novo
de: Neujahr
es: Año Nuevo
fr: Nouvel An

source: Dia da Liberdade e da Democracia
de: Tag der Demokratie und Freiheit
es: Día de la Libertad y la Democracia
fr: Journée de la liberté et de la démocratie

source: Dia da Nacionalidade e dos Heróis Nacionais
de: Tag der Nationalhelden
es: Día de la Nacionalidad y de los Héroes Nacionales
fr: Journée de la nationalité et des héros nationaux

source: Quarta-feira de Cinzas
de: Aschermittwoch
es: Miércoles de Ceniza
fr: Mercredi des Cendres

source: Sexta-feira Santa
de: Karfreitag
es: Viernes Santo
fr: Vendredi Saint

source: Páscoa
de: Ostersonntag
es: Domingo de Pascua
fr: Dimanche de Pâques

source: Dia do Trabalhador
de: Tag der Arbeit
es: Día del Trabajador
fr: Fête du travail

source: Dia Mundial da Criança
de: Weltkindertag
es: Día Mundial de la Infancia
fr: Journée mondiale de l'enfance

source: Dia da Independência Nacional
de: Unabhängigkeitstag
es: Día de la Independencia Nacional
fr: Fête de l'Indépendance Nationale

source: Dia da Assunção
de: Mariä Himmelfahrt
es: Asunción de Nuestra Señora
fr: Assomption de Notre-Dame

source: Dia de Todos os Santos
de: Allerheiligen
es: Día de Todos los Santos
fr: Toussaint

source: Dia do Natal
de: Weihnachten
es: Navidad
fr: Noël

source: Quinta-Feira Santa
de: Gründonnerstag
es: Jueves Santo
fr: Jeudi Saint

source: Dia das Mães
de: Muttertag
es: Día de la Madre
fr: Fête des Mères

source: Dia dos Pais
de: Vatertag
es: Día del Padre
fr: Fête des Pères

source: Dia do Município da Brava
de: Tag der Gemeinde Brava
es: Día del Municipio de Brava
fr: Journée de la municipalité de Brava

source: Dia do Município da Boa Vista
de: Tag der Gemeinde Boa Vista
es: Día del Municipio de Boa Vista
fr: Journée de la municipalité de Boa Vista

source: Dia do Município de Santa Catarina de Santiago
de: Tag der Gemeinde Santa Catarina de Santiago
es: Día del Municipio de Santa Catarina de Santiago
fr: Journée de la municipalité de Santa Catarina de Santiago

source: Dia do Município de Santa Catarina do Fogo
de: Tag der Gemeinde Santa Catarina do Fogo
es: Día del Municipio de Santa Catarina do Fogo
fr: Journée de la municipalité de Santa Catarina do Fogo

source: Dia do Município de Santa Cruz
de: Tag der Gemeinde Santa Cruz
es: Día del Municipio de Santa Cruz
fr: Journée de la municipalité de Santa Cruz

source: Dia do Município do Maio
de: Tag der Gemeinde Maio
es: Día del Municipio de Maio
fr: Journée de la municipalité de Maio

source: Dia do Município dos Mosteiros
de: Tag der Gemeinde Mosteiros
es: Día del Municipio de Mosteiros
fr: Journée de la municipalité des Mosteiros

source: Dia da Ilha de Santo Antão
de: Tag der Insel Santo Antão
es: Día de la Isla de Santo Antão
fr: Journée de l'île de Santo Antão

source: Dia do Município do Paúl
de: Tag der Gemeinde Paúl
es: Día del Municipio de Paúl
fr: Journée de la municipalité de Paúl

source: Dia do Município do Porto Novo
de: Tag der Gemeinde Porto Novo
es: Día del Municipio de Porto Novo
fr: Journée de la municipalité de Porto Novo

source: Dia do Município da Praia
de: Tag der Gemeinde Praia
es: Día del Municipio de Praia
fr: Journée de la municipalité de Praia

source: Dia do Município de Ribeira Brava
de: Tag der Gemeinde Ribeira Brava
es: Día del Municipio de Ribeira Brava
fr: Journée de la municipalité de Ribeira Brava

source: Dia do Município de Ribeira Grande
de: Tag der Gemeinde Ribeira Grande
es: Día del Municipio de Ribeira Grande
fr: Journée de la municipalité de Ribeira Grande

source: Dia do Município de Ribeira Grande de Santiago
de: Tag der Gemeinde Ribeira Grande de Santiago
es: Día del Municipio de Ribeira Grande de Santiago
fr: Journée de la municipalité de Ribeira Grande de Santiago

source: Dia do Município de São Domingos
de: Tag der Gemeinde São Domingos
es: Día del Municipio de São Domingos
fr: Journée de la municipalité de São Domingos

source: Dia do Município de São Filipe
de: Tag der Gemeinde São Filipe
es: Día del Municipio de São Filipe
fr: Journée de la municipalité de São Filipe

source: Dia do Município do Sal
de: Tag der Gemeinde Sal
es: Día del Municipio de Sal
fr: Journée de la municipalité de Sal

source: Dia do Município de São Miguel
de: Tag der Gemeinde São Miguel
es: Día del Municipio de São Miguel
fr: Journée de la municipalité de São Miguel

source: Dia do Município de São Lourenço dos Órgãos
de: Tag der Gemeinde São Lourenço dos Órgãos
es: Día del Municipio de São Lourenço dos Órgãos
fr: Journée de la municipalité de São Lourenço dos Órgãos

source: Dia do Município de São Salvador do Mundo
de: Tag der Gemeinde São Salvador do Mundo
es: Día del Municipio de São Salvador do Mundo
fr: Journée de la municipalité de São Salvador do Mundo

source: Dia do Município de São Vicente
de: Tag der Gemeinde São Vicente
es: Día del Municipio de São Vicente
fr: Journée de la municipalité de São Vicente

source: Terça-feira de Carnaval
de: Faschingsdienstag
es: Martes de Carnaval
fr: Mardi du Carnaval

source: Dia do Município do Tarrafal de Santiago
de: Tag der Gemeinde Tarrafal de Santiago
es: Día del Municipio de Tarrafal de Santiago
fr: Journée de la municipalité de Tarrafal de Santiago

source: Dia do Município do Tarrafal de São Nicolau
de: Tag der Gemeinde Tarrafal de São Nicolau
es: Día del Municipio de Tarrafal de São Nicolau
fr: Journée de la municipalité de Tarrafal de São Nicolau
