Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/DK.po
Languages: th

source: Nytårsdag
th: วันขึ้นปีใหม่

source: Skærtorsdag
th: วันพฤหัสศักดิ์สิทธิ์

source: Langfredag
th: วันศุกร์ประเสริฐ

source: Påskedag
th: วันอาทิตย์อีสเตอร์

source: Anden påskedag
th: วันจันทร์อีสเตอร์

source: Store bededag
th: วันแห่งการอธิษฐานใหญ่

source: Kristi himmelfartsdag
th: วันสมโภชพระเยซูเจ้าเสด็จขึ้นสวรรค์

source: Pinsedag
th: วันสมโภชพระจิตเจ้า

source: Anden pinsedag
th: วันจันทร์หลังวันสมโภชพระจิตเจ้า

source: Juledag
th: วันคริสต์มาส

source: Anden juledag
th: วันคริสต์มาสวันที่สอง

source: Arbejdernes kampdag
th: วันแรงงาน

source: Grundlovsdag
th: วันรัฐธรรมนูญ

source: Juleaftensdag
th: วันคริสต์มาสอีฟ

source: Nytårsaften
th: วันสิ้นปี
