Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/EG.po
Languages: fr

source: %s (المقدرة)
fr: %s (estimé)

source: %s (ملاحظة)
fr: %s (observé)

source: %s (المقدرة، ملاحظة)
fr: %s (observé, estimé)

source: عيد الميلاد المجيد
fr: Fête de Noël

source: ثورة ٢٥ يناير وعيد الشرطة
fr: Révolution de 25 Janvier et la fête de la Police

source: عيد الشرطة
fr: Fête de la Police

source: عيد تحرير سيناء
fr: Fête de la Libération du Sinaï

source: عيد شم النسيم
fr: Cham Al-Nessim

source: عيد العمال
fr: Fête du Travail

source: عيد ثورة ٣٠ يونيو
fr: Fête de la Révolution du 30 Juin

source: عيد ثورة ٢٣ يوليو
fr: Fête de la Révolution du 23 Juillet

source: عيد القوات المسلحة
fr: Fête des Forces Armées

source: رأس السنة الهجرية
fr: Fête de l'Hégire

source: المولد النبوي الشريف
fr: Naissance du Prophète

source: عيد الفطر المبارك
fr: Aïd-Al-Fitr

source: وقفة عيد الأضحى المبارك
fr: Le jour d'Arafat

source: عيد الأضحى المبارك
fr: Aïd Al-Adha

source: عيد تحرير طابا
fr: Fête de la libération de Taba

source: عيد الجلاء
fr: Jour d'évacuation
