Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/EH.po
Languages: es, fr

source: %s (المقدرة)
es: %s (estimado)
fr: %s (estimé)

source: إعلان الجمهورية العربية الصحراوية الديمقراطية
es: Proclamación de la República Árabe Saharaui Democrática
fr: Proclamation de la République arabe sahraouie démocratique

source: يوم الشهيد الأول
es: Primer mártir
fr: Premier martyr

source: تأسيس الجبهة الشعبية لتحرير الساقية الحمراء ووادي الذهب
es: Creación del Frente POLISARIO
fr: Création du Front POLISARIO

source: اندلاع الكفاح المسلح
es: Inicio de la lucha armada
fr: Déclenchement de la lutte armée

source: يوم الشهداء
es: Día de los mártires
fr: Journée des martyrs

source: يوم الانتفاضة
es: Día de la insurrección
fr: Jour de l'insurrection

source: عيد الوحدة الوطنية
es: Fiesta de la unidad nacional
fr: Fête de l'unité nationale

source: عيد الفطر المبارك
es: Eid al-Fitr
fr: Aïd el-Fitr

source: رأس السنة الهجرية
es: Primer día del año de la Hégira
fr: Premier jour de l'an de l'Hégire

source: المولد النبوي الشريف
es: Santo Nacimiento del Profeta
fr: Naissance du Prophète

source: عيد الأضحى المبارك
es: Eid al-Adha
fr: Aïd al-Adha
