Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/GB.po
Languages: th

source: %s (observed)
th: ชดเชย%s

source: Good Friday
th: วันศุกร์ประเสริฐ

source: May Day
th: วันเมย์เดย์

source: Spring Bank Holiday
th: วันหยุดฤดูใบไม้ผลิของธนาคาร

source: Easter Monday
th: วันจันทร์อีสเตอร์

source: Whit Monday
th: วันจันทร์หลังวันสมโภชพระจิตเจ้า

source: Late Summer Bank Holiday
th: วันหยุดช่วงปลายฤดูร้อนของธนาคาร

source: New Year's Day
th: วันขึ้นปีใหม่

source: Christmas Day
th: วันคริสต์มาส

source: Boxing Day
th: วันเปิดกล่องของขวัญ

source: Saint Patrick's Day
th: วันนักบุญแพทริก

source: Battle of the Boyne
th: วันรำลึกยุทธการแม่น้ำบอยน์

source: New Year Holiday
th: หยุดวันขึ้นปีใหม่

source: Summer Bank Holiday
th: วันหยุดฤดูร้อนของธนาคาร

source: Saint Andrew's Day
th: วันนักบุญแอนดรูว์

source: Silver Jubilee of Elizabeth II
th: พระราชพิธีฉลองสิริราชสมบัติครบ 25 ปี สมเด็จพระราชินีนาถ

source: Wedding of Charles and Diana
th: พระราชพิธีอภิเษกสมรสระหว่างไดอาน่า สเปนเซอร์และเจ้าฟ้าชายชาร์ลส์ เจ้าชายแห่งเวลส์

source: Millennium Celebrations
th: วันเฉลิมฉลองสหัสวรรษ

source: Golden Jubilee of Elizabeth II
th: พระราชพิธีฉลองสิริราชสมบัติครบ 50 ปี สมเด็จพระราชินีนาถ

source: Wedding of William and Catherine
th: พระราชพิธีเสกสมรสระหว่างเจ้าชายวิลเลียมกับแคเธอริน มิดเดิลตัน

source: Diamond Jubilee of Elizabeth II
th: พระราชพิธีฉลองสิริราชสมบัติครบ 60 ปี สมเด็จพระราชินีนาถ

source: Platinum Jubilee of Elizabeth II
th: พระราชพิธีฉลองสิริราชสมบัติครบ 70 ปี สมเด็จพระราชินีนาถ

source: State Funeral of Queen Elizabeth II
th: พระราชพิธีพระบรมศพของสมเด็จพระราชินีนาถเอลิซาเบธที่ 2

source: Coronation of Charles III
th: พระราชพิธีราชาภิเษกของสมเด็จพระเจ้าชาลส์ที่ 3 แห่งสหราชอาณาจักร
