Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/GE.po
Languages: uk

source: ახალი წელი
uk: Новий рік

source: ქრისტეშობა
uk: Різдво Христове

source: ნათლისღება
uk: Богоявлення

source: დედის დღე
uk: День матері

source: ქალთა საერთაშორისო დღე
uk: Міжнародний жіночий день

source: ეროვნული ერთიანობის დღე
uk: День національної єдності

source: წითელი პარასკევი
uk: Страсна пʼятниця

source: დიდი შაბათი
uk: Велика субота

source: აღდგომა
uk: Великдень

source: შავი ორშაბათი
uk: Великодній понеділок

source: ფაშიზმზე გამარჯვების დღე
uk: День перемоги над фашизмом

source: წმინდა ანდრია პირველწოდებულის დღე
uk: День Святого Андрія Первозваного

source: ოჯახის სიწმინდისა და მშობლების პატივისცემის დღე
uk: День святості родини та поваги до батьків

source: დამოუკიდებლობის დღე
uk: День незалежності

source: მარიამობა
uk: Успіння Пресвятої Богородиці

source: მცხეთობის
uk: Свято Светіцховлоба, Ризи Господньої

source: გიორგობა
uk: День Святого Георгія

source: უქმე დღე
uk: Вихідний день
