Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/GR.po
Languages: uk

source: Πρωτοχρονιά
uk: Новий рік

source: Θεοφάνεια
uk: Богоявлення

source: Καθαρά Δευτέρα
uk: Чистий понеділок

source: Εικοστή Πέμπτη Μαρτίου
uk: День незалежності

source: Μεγάλη Παρασκευή
uk: Страсна пʼятниця

source: Δευτέρα του Πάσχα
uk: Великодній понеділок

source: Δευτέρα του Αγίου Πνεύματος
uk: День Святого Духа

source: Εργατική Πρωτομαγιά
uk: День праці

source: %s (παρατηρήθηκε)
uk: %s (вихідний)

source: Κοίμηση της Θεοτόκου
uk: Успіння Пресвятої Богородиці

source: Ημέρα του Όχι
uk: День Охі

source: Χριστούγεννα
uk: Різдво Христове

source: Σύναξη της Υπεραγίας Θεοτόκου
uk: Собор Пресвятої Богородиці

source: Παραμονή Χριστουγέννων
uk: Святий вечір

source: Παραμονή Πρωτοχρονιάς
uk: Переддень Нового року
