Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/HK.po
Languages: th, zh_cn

# %s（推定）
source: %s (estimated)
th: %s (โดยประมาณ)
zh_cn: %s（推定）

# %s（補假，推定）
source: %s (observed, estimated)
th: ชดเชย%s (โดยประมาณ)
zh_cn: %s（观察日，推定）

# %s（補假）
source: %s (observed)
th: ชดเชย%s
zh_cn: %s（观察日）

# 中秋節翌日
source: The Day following Mid-Autumn Festival
th: วันหลังวันไหว้พระจันทร์
zh_cn: 中秋节翌日

# 中秋節後第二日
source: The Second Day following Mid-Autumn Festival
th: วันไหว้พระจันทร์วันที่สอง
zh_cn: 中秋节后第二日

# 中秋節
source: Mid-Autumn Festival
th: วันไหว้พระจันทร์
zh_cn: 中秋节

# 農曆年初一
source: Chinese New Year
th: วันตรุษจีน
zh_cn: 农历年初一

# 農曆年初一的前一日
source: Chinese New Year's Eve
th: วันก่อนวันตรุษจีน
zh_cn: 农历年初一的前一日

# 農曆年初二
source: The second day of Chinese New Year
th: วันตรุษจีนวันที่สอง
zh_cn: 农历年初二

# 農曆年初三
source: The third day of Chinese New Year
th: วันตรุษจีนวันที่สาม
zh_cn: 农历年初三

# 農曆年初四
source: The fourth day of Chinese New Year
th: วันตรุษจีนวันที่สี่
zh_cn: 农历年初四

# 一月一日
source: New Year's Day
th: วันขึ้นปีใหม่
zh_cn: 一月一日

# 耶穌受難節
source: Good Friday
th: วันศุกร์ประเสริฐ
zh_cn: 耶稣受难节

# 耶穌受難節翌日
source: The day following Good Friday
th: วันหลังวันศุกร์ประเสริฐ
zh_cn: 耶稣受难节翌日

# 復活節星期一
source: Easter Monday
th: วันจันทร์อีสเตอร์
zh_cn: 复活节星期一

# 清明節
source: Tomb-Sweeping Day
th: วันเช็งเม้ง
zh_cn: 清明节

# 佛誕
source: The Buddha's Birthday
th: วันวิสาขบูชา
zh_cn: 佛诞

# 勞動節
source: Labor Day
th: วันแรงงาน
zh_cn: 劳动节

# 端午節
source: Dragon Boat Festival
th: วันไหว้บ๊ะจ่าง
zh_cn: 端午节

# 香港特別行政區成立紀念日
source: Hong Kong S.A.R. Establishment Day
th: วันสถาปนาเขตบริหารพิเศษฮ่องกง
zh_cn: 香港特别行政区成立纪念日

# 重陽節
source: Double Ninth Festival
th: วันไหว้บรรพบุรุษ
zh_cn: 重阳节

# 國慶日
source: National Day
th: วันชาติจีน
zh_cn: 国庆日

# 冬節
source: Winter Solstice
th: วันตงจื้อ(เหมายัน)
zh_cn: 冬节

# 聖誕節後第一個周日
source: The first weekday after Christmas Day
th: วันคริสต์มาสวันที่สอง
zh_cn: 圣诞节后第一个周日

# 聖誕節
source: Christmas Day
th: วันคริสต์มาส
zh_cn: 圣诞节

# 一月一日翌日
source: The day following New Year's Day
th: วันหลังวันขึ้นปีใหม่
zh_cn: 一月一日翌日

# 清明節翌日
source: The day following Tomb-Sweeping Day
th: วันหลังวันเช็งเม้ง
zh_cn: 清明节翌日

# 復活節星期一翌日
source: The day following Easter Monday
th: วันหลังวันจันทร์อีสเตอร์
zh_cn: 复活节星期一翌日

# 佛誕翌日
source: The day following the Buddha's Birthday
th: วันหลังวันวิสาขบูชา
zh_cn: 佛诞翌日

# 勞動節翌日
source: The day following Labor Day
th: วันหลังวันแรงงาน
zh_cn: 劳动节翌日

# 端午節翌日
source: The day following Dragon Boat Festival
th: วันหลังวันไหว้บ๊ะจ่าง
zh_cn: 端午节翌日

# 香港特別行政區成立紀念日翌日
source: The day following Hong Kong S.A.R. Establishment Day
th: วันหลังวันสถาปนาเขตบริหารพิเศษฮ่องกง
zh_cn: 香港特别行政区成立纪念日翌日

# 重陽節翌日
source: The day following Double Ninth Festival
th: วันหลังวันไหว้บรรพบุรุษ
zh_cn: 重阳节翌日

# 國慶日翌日
source: The day following National Day
th: วันหลังวันชาติจีน
zh_cn: 国庆日翌日

# 聖誕節後第二個周日
source: The second weekday after Christmas Day
th: วันคริสต์มาสวันที่สาม
zh_cn: 圣诞节后第二个周日

# 英女皇壽辰
source: Queen's Birthday
th: วันเฉลิมพระชนมพรรษาสมเด็จพระราชินีนาถ
zh_cn: 英女王生日

# 靈降臨節後星期一
source: Monday after Pentecost
th: วันจันทร์หลังวันสมโภชพระจิตเจ้า
zh_cn: 圣灵降临节后星期一

# 中華民國國慶日
source: National Day of the Republic of China
th: วันชาติสาธารณรัฐจีน(ไต้หวัน)
zh_cn: 中华民国国庆日

# 和平紀念日後星期一
source: Monday after Remembrance Day
th: วันจันทร์หลังวันรำลึก
zh_cn: 和平纪念日后星期一

# 重光紀念日
source: Anniversary of the liberation of Hong Kong
th: วันครบรอบการปลดปล่อยฮ่องกง
zh_cn: 重光纪念日

# 英國王儲查理斯王子與戴安娜婚禮
source: Wedding of Prince Charles and Diana
th: พระราชพิธีอภิเษกสมรสระหว่างไดอาน่า สเปนเซอร์และเจ้าฟ้าชายชาร์ลส์ เจ้าชายแห่งเวลส์
zh_cn: 英国王储查尔斯王子与戴安娜婚礼

# 英女王伊利沙伯二世伉儷訪港的第二天
source: Second day of Queen Elizabeth II and her husband's visit to Hong Kong
th: วันที่สองของการเสด็จเยือนฮ่องกงของ่สมเด็จพระราชินีนาถเอลิซาเบธที่ 2 และพระราชสวามี
zh_cn: 英女王伊丽莎白二世伉俪访港的第二天

# 中國人民抗日戰爭勝利70周年紀念日
source: 70th Anniversary of the Victory of the Chinese People's War of Resistance against Japanese Aggression and the World Anti-Fascist War
th: วันครบรอบ 70 ปีแห่งการได้รับชัยชนะจากสงครามต่อต้านญี่ปุ่น
zh_cn: 中国人民抗日战争胜利70周年纪念日

# 抗日戰爭勝利紀念日
source: Sino-Japanese War Victory Day
th: วันรำลึกชัยชนะสงครามต่อต้านญี่ปุ่น
zh_cn: 抗日战争胜利纪念日

# 額外公眾假期
source: Additional public holiday
th: วันหยุดเพิ่มเติม
zh_cn: 额外公众假期
