Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/holidays.po
Languages: ml

source: %s (estimated)
ml: %s (അനുമാനിച്ചിരിക്കുന്നു)

source: New Year's Day
ml: പുതുവത്സര ദിനം

source: Republic Day
ml: പ്രജാസ്വാമ്യത ദിനം

source: Independence Day
ml: സ്വാതന്ത്ര്യ ദിനം

source: Gandhi Jayanti
ml: ഗാന്ധിജയന്തി

source: Onam
ml: ഓണം

source: Kerala Foundation Day
ml: കേരള സ്ഥാപിത ദിനം

source: Christmas
ml: ക്രിസ്മസ്

source: Maha Vishuva Sankranti / Pana Sankranti
ml: വിഷു / പണ സംക്രാന്തി

source: Thiruvalluvar Day / Mattu Pongal
ml: തിരുവള്ളവർ ദിനം / മട്ടു പൊങ്കല്‍

source: Pongal
ml: പൊങ്കല്‍

source: Labour Day
ml: കൊഴിയുന്നവരുടെ ദിനം

source: Holi
ml: ഹോളി

source: Diwali
ml: ദീപാവലി

source: Id-ul-Fitr
ml: ഇദ്-ഉല്-ഫിതർ

source: Bakrid
ml: ബക്രീദ്

source: Good Friday
ml: ഗുഡ് ഫ്രൈഡേ

source: Guru Nanak Jayanti
ml: ഗുരു നാനക് ജയന്തി

source: Buddha Purnima
ml: ബുദ്ധ പൂർണിമ

source: Christmas Eve
ml: ക്രിസ്മസ് ഇവ്

source: Maha Shivaratri
ml: മഹാശിവരാത്രി

source: Raksha Bandhan
ml: രക്ഷാബന്ധൻ

source: Ram Navami
ml: റാം നവമി

source: Navratri / Sharad Navratri
ml: നവർത്രി / ശരദ് നവർത്രി

source: Ganesh Chaturthi
ml: ഗണേഷ് ചതുര്‍ഥി

source: Maha Navami
ml: മഹ നവമി

source: Lohri
ml: ലോഹരി
