Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/IL.po
Languages: th, uk, yi

source: %s (נצפה)
th: ชดเชย%s

source: ראש השנה
th: เทศกาลรอช ฮาชานาห์ (วันปีใหม่ยิว)
uk: Рош га-Шана
yi: נייע יאר

source: יום כיפור
th: วันยม คิปปูร์
uk: Йом Кіпур

source: סוכות
th: วันสุคคต
uk: Суккот
yi: סוכות, סוכות

source: שמחת תורה/שמיני עצרת
th: วันซิมหัต โทราห์ / วันเชมินี อัตเซเรต
uk: Сімхат Тора / Шміні Ацерет
yi: עצרת שמחת תורה/שמיני

source: פסח
th: วันเพสสะห์
uk: Песах

source: שביעי של פסח
th: วันเพสสะห์วันที่เจ็ด
uk: Сьомий день Песаха
yi: זיבעטן פּסח

source: יום העצמאות
th: วันชาติอิสราเอล
uk: День незалежності
yi: זעלבסטשטענדיגקייט טאג

source: שבועות
th: วันชาวูโอท
uk: Шавуот
yi: וואָכן

source: חול המועד סוכות
th: เทศกาลสุคคต
uk: Свято Суккот
yi: דער יום־טובֿ סוכות

source: סיגד
th: เทศกาลซิกด์
uk: Сігд
yi: געבוקט

source: פורים
th: เทศกาลปูริม
uk: Пурім

source: חול המועד פסח
th: เทศกาลเพสสะห์
uk: Свято Песах
yi: פּסח יום טוּב

source: יום הזיכרון לחללי מערכות ישראל ונפגעי פעולות האיבה
th: วันรำลึกถึงทหารผู้สละชีพและเหยื่อการก่อการร้าย
uk: День памʼяті
yi: אנדענק טאג פאר די מארטירער פון ישראל'ס סיסטעמען און קרבנות פון שינאה

source: יום ירושלים
th: วันเยรูซาเล็ม
uk: День Єрусалиму
yi: טאג ירושלים

source: תשעה באב
th: วันทิชอา เบอัฟ
uk: Тиша Бе-Ав

source: חנוכה
th: เทศกาลฮานุกกะห์
uk: Ханука

source: תענית אסתר
th: วันทาอานิต เอสเธอร์
uk: Тааніт-Естер
yi: תנית אסתר

source: ל"ג בעומר
th: วันแล็ก บาโอเมอร์
uk: Лаг ба-Омер

source: (נצפה) %s
uk: %s (вихідний)
yi: (באמערקט) %s
