Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/KE.po
Languages: sw

source: %s (estimated)
sw: %s (inakadiriwa)

source: %s (observed)
sw: %s (imezingatiwa)

source: %s (observed, estimated)
sw: %s (inazingatiwa, inakadiriwa)

source: New Year's Day
sw: Siku ya Mwaka Mpya

source: Good Friday
sw: Ijumaa Kuu

source: Easter Monday
sw: Jumatatu ya Pasaka

source: Labour Day
sw: Siku ya Kazi

source: Madaraka Day
sw: Siku ya Madaraka

source: Mazingira Day
sw: Siku ya Mazingira

source: Utamaduni Day
sw: Siku ya Utamaduni

source: Moi Day
sw: Siku ya Moi

source: Mashujaa Day
sw: Siku ya Mashujaa

source: Kenyatta Day
sw: Siku ya Kenyatta

source: Jamhuri Day
sw: Siku ya Jamhuri

source: Independence Day
sw: Siku ya Uhuru

source: Christmas Day
sw: Siku ya Krismasi

source: Boxing Day
sw: Siku ya Ndondi

source: Idd-ul-Fitr
sw: Sikukuu ya Idd-ul-Fitr

source: Idd-ul-Azha
sw: Sikukuu ya Idd-ul-Azha

source: Election Day
sw: Siku ya Uchaguzi

source: Inauguration Day
sw: Siku ya Uzinduzi

source: Day of Mourning for Queen Elizabeth II
sw: Siku ya Maombolezo kwa Malkia Elizabeth II

source: National Tree Growing Day
sw: Siku ya Kitaifa ya Kupanda Miti

source: Visit of Pope Francis to Kenya
sw: Ziara ya Papa Francis nchini Kenya

source: President Moi Memorial Day
sw: Siku ya Kumbukumbu ya Rais Moi

source: State Funeral for Former President Mwai Kibaki
sw: Mazishi ya Kiserikali ya Aliyekuwa Rais Mwai Kibaki
