Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/KH.po
Languages: th

# ថ្ងៃឈប់សម្រាកសងជំនួសឲ្យពិធីបុណ្យចូលឆ្នាំថ្មីប្រពៃណីជាតិ
source: Khmer New Year's Replacement Holiday
th: วันหยุดชดเชยเทศกาลขึ้นปีใหม่ประเพณี

# ថ្ងៃឈប់សម្រាកសងជំនួស
source: Special Public Holiday
th: วันหยุดชดเชย

# ទិវាចូលឆ្នាំសាកល
source: International New Year Day
th: วันปีใหม่สากล

# ទិវាជ័យជម្នះលើរបបប្រល័យពូជសាសន៍
source: Day of Victory over the Genocidal Regime
th: วันชัยชนะเหนือระบอบฆ่าล้างเผ่าพันธุ์เขมรแดง

# ទិវាអន្តរជាតិនារី
source: International Women's Rights Day
th: วันสตรีสากล

# ពិធីបុណ្យចូលឆ្នាំថ្មីប្រពៃណីជាតិ
source: Khmer New Year's Day
th: เทศกาลขึ้นปีใหม่ประเพณี

# ទិវាពលកម្មអន្តរជាតិ
source: International Labor Day
th: วันแรงงานสากล

# ព្រះរាជពិធីបុណ្យចម្រើនព្រះជន្ម ព្រះករុណា ព្រះបាទសម្តេចព្រះបរមនាថ នរោត្តម សីហមុនី
source: HM King Norodom Sihamoni's Birthday
th: พระราชพิธีเฉลิมพระชนมพรรษา พระบาทสมเด็จพระบรมนาถ นโรดมสีหมุนี พระมหากษัตริย์แห่งราชอาณาจักรกัมพูชา

# ទិវាជាតិនៃការចងចាំ
source: National Day of Remembrance
th: วันแห่งความทรงจำ

# ទិវាកុមារអន្តរជាតិ
source: International Children Day
th: วันเด็กสากล

# ទិវាប្រកាសរដ្ឋធម្មនុញ្ញ
source: Constitution Day
th: วันรัฐธรรมนูญ

source: HM King Norodom Sihanouk Mourning Day
th: วันสดุดีพระบาทสมเด็จพระบรมนาถนโรดม สีหนุ พระบิดาแห่งเอกราช บูรณภาพแห่งดินแดน และเอกภาพของชาติกัมพูชา

# ទិវារំលឹកសន្ធិសញ្ញាសន្តិភាពទីក្រុងប៉ារីស
source: Paris Peace Agreement's Day
th: วันรำลึกข้อตกลงสันติภาพกรุงปารีส

source: HM King Norodom Sihamoni's Coronation Day
th: พระราชพิธีเฉลิมฉลองการขึ้นครองราชสมบัติ พระบาทสมเด็จพระบรมนาถ นโรดมสีหมุนี พระมหากษัตริย์แห่งราชอาณาจักรกัมพูชา

# ពិធីបុណ្យឯករាជ្យជាតិ
source: National Independence Day
th: วันประกาศเอกราชจากฝรั่งเศส

# ទិវាសិទ្ធិមនុស្សអន្តរជាតិ
source: International Human Rights Day
th: วันสิทธิมนุษยชนโลก

# ពិធីបុណ្យមាឃបូជា
source: Meak Bochea Day
th: วันมาฆบูชา

# ពិធីបុណ្យវិសាខបូជា
source: Visaka Bochea Day
th: วันวิสาขบูชา

# ព្រះរាជពិធីច្រត់ព្រះនង្គ័ល
source: Royal Ploughing Ceremony
th: พระราชพิธีบุญจรดพระนังคัลแรกนาขวัญ

# ពិធីបុណ្យភ្ផុំបិណ្ឌ
source: Pchum Ben Day
th: เทศกาลงานวันสาร์ทภจุมบิณฑ์เขมร

# ព្រះរាជពិធីបុណ្យអុំទូក បណ្តែតប្រទីប និងសំពះព្រះខែអកអំបុក
source: Water Festival
th: พระราชพิธีบุญแข่งเรือลอยกระทงไฟไหว้พระจันทร์และกินข้าวเม่า
