Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/KZ.po
Languages: uk

source: %s (бағаланған)
uk: %s (приблизна дата)

source: %s (қайта белгіленген демалыс)
uk: %s (вихідний)

source: %s (қайта белгіленген демалыс, бағаланған)
uk: %s (вихідний, приблизна дата)

source: Жаңа жыл
uk: Новий рік

source: Православиелік Рождество
uk: Православне Різдво

source: Халықаралық әйелдер күні
uk: Міжнародний жіночий день

source: Наурыз мейрамы
uk: Свято Новруз

source: Қазақстан халқының бірлігі мерекесі
uk: Свято єдності народу Казахстану

source: Отан Қорғаушы күні
uk: День захисника Вітчизни

source: Жеңіс күні
uk: День Перемоги

source: Астана күні
uk: День Столиці

source: Қазақстан Республикасының Конституциясы күні
uk: День Конституції Республіки Казахстан

source: Республика күні
uk: День Республіки

source: Қазақстан Республикасының Тұңғыш Президенті күні
uk: День першого президента Республіки Казахстан

source: Тəуелсіздік күні
uk: День незалежності

source: Құрбан айт
uk: Курбан-байрам

source: Демалыс күні (%s бастап ауыстырылды)
uk: Вихідний день (перенесено з %s)
