Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/LA.po
Languages: th

# ພັກຊົດເຊີຍ%s
source: %s (in lieu)
th: ชดเชย%s

# ວັນປີໃໝ່ສາກົນ
source: New Year's Day
th: วันปีใหม่สากล

# ວັນແມ່ຍິງສາກົນ
source: International Women's Rights Day
th: วันสตรีสากล

# ບຸນປີໃໝ່ລາວ
source: Lao New Year's Day
th: วันปีใหม่ลาว

# ວັນກຳມະກອນສາກົນ
source: International Labor Day
th: วันแรงงานสากล

# ວັນເດັກສາກົນ
source: International Children Day
th: วันเด็กสากล

# ວັນຊາດ
source: Lao National Day
th: วันชาติ สปป. ลาว

# ວັນບຸນທາດຫລວງ
source: Boun That Luang Festival
th: วันงานพระธาตุหลวง

# ມື້ປິດການໃຫ້ບໍລິການຂອງທະນາຄານຕົວແທນ
source: Special Bank Holiday
th: วันหยุดทำการพิเศษของสถาบันการเงิน

# ພັກບຸນປີໃໝ່ລາວ
source: Lao New Year's Day (Special)
th: ชดเชยวันปีใหม่ลาว

# ວັນສ້າງຕັ້ງທະນາຄານແຫ່ງ ສປປ ລາວ
source: Establishment Day of the BOL
th: วันก่อตั้งธนาคารแห่ง สปป. ลาว

# ສາມວັນລັດຖະການສຸດທ້າຍຂອງທຸກໆປີ
source: Lao Year-End Bank Holiday
th: วันหยุดสิ้นปีของสถาบันการเงิน

# ວັນບຸນມາຂະບູຊາ
source: Makha Bousa Festival
th: วันมาฆบูชา

# ວັນບຸນວິສາຂະບູຊາ
source: Visakha Bousa Festival
th: วันวิสาขบูชา

# ວັນບຸນເຂົ້າພັນສາ
source: Begin of Buddhist Lent
th: วันเข้าพรรษา

# ວັນບຸນຫໍ່ເຂົ້າປະດັບດິນ
source: Boun Haw Khao Padapdin
th: วันบุญข้าวประดับดิน

# ວັນບຸນຫໍ່ເຂົ້າສະຫຼາກ
source: Boun Haw Khao Salark
th: วันข้าวบุญข้าวสาก

# ວັນບຸນອອກພັນສາ
source: End of Buddhist Lent
th: วันออกพรรษา

# ວັນບຸນຊ່ວງເຮືອ ນະຄອນຫຼວງວຽງຈັນ
source: Vientiane Boat Racing Festival
th: วันงานบุญแข่งเรือ นครหลวงเวียงจันทน์

# ວັນຄູແຫ່ງຊາດ
source: National Teacher Day
th: วันครูแห่งชาติ

# ວັນສ້າງຕັ້ງກອງທັບປະຊາຊົນລາວ
source: Lao People's Armed Force Day
th: วันก่อตั้งกองทัพประชาชนลาว

# ວັນສ້າງຕັ້ງສະຫະພັນກໍາມະບານລາວ
source: Lao Federation of Trade Union's Day
th: วันก่อตั้งสหพันธ์กำมะบานลาว

# ວັນສ້າງຕັ້ງພັກປະຊາຊົນປະຕິວັດລາວ
source: Establishment Day of the Lao People's Revolutionary Party
th: วันก่อตั้งพรรคประชาชนปฏิวัติลาว

# ວັນສ້າງຕັ້ງສູນກາງຊາວໜຸ່ມປະຊາຊົນປະຕິວັດລາວ
source: Lao People's Revolutionary Youth Union Day
th: วันก่อตั้งศูนย์ซาวหนุ่มประชาชนปฏิวัติลาว

# ວັນປູກຕົ້ນໄມ້ແຫ່ງຊາດ
source: National Arbor Day
th: วันปลูกต้นไม้แห่งชาติ

# ວັນຄ້າຍວັນເກີດ ທ່ານ ປະທານ ສຸພານຸວົງ
source: President Souphanouvong's Birthday
th: วันคล้ายวันเกิดท่านประธานสุภานุวงศ์

# ວັນປ່ອຍປາ ແລະ ວັນອະນຸລັກສັດນ້ຳ-ສັດປ່າແຫ່ງຊາດ
source: The National Day for Wildlife and Aquatic Animal Conservation
th: วันอนุรักษ์สัตว์น้ำ สัตว์ป่า และวันปล่อยปลาแห่งชาติ

# ວັນສ້າງຕັ້ງສະຫະພັນແມ່ຍິງລາວ
source: Establishment Day of the Lao Women's Union
th: วันก่อตั้งสหภาพแม่หญิงลาว

# ວັນສື່ມວນຊົນແຫ່ງຊາດ ແລະ ວັນພິມຈໍາໜ່າຍ
source: Lao National Mass Media and Publishing Day
th: วันสื่อสารมวลชนและการพิมพ์แห่งชาติ

# ວັນລັດຖະທໍາມະນູນແຫ່ງຊາດ
source: Lao National Constitution Day
th: วันรัฐธรรมนูญแห่งชาติ

# ວັນຍຶດອຳນາດທົ່ວປະເທດ
source: National Uprising Day
th: วันยึดอำนาจทั่วประเทศ

# ວັນປະກາດເອກະລາດ
source: Indepedence Declaration Day
th: วันประกาศเอกราช

# ວັນຄ້າຍວັນເກີດ ທ່ານ ປະທານ ໄກສອນ ພົມວິຫານ
source: President Kaysone Phomvihane's Birthday
th: วันคล้ายวันเกิดท่านประธานไกสอน พมวิหาน
