Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/LC.po
Languages: fr_lc

source: %s (estimated)
fr_lc: %s (Estimé)

source: New Year's Day
fr_lc: Premye Janvye

source: New Year's Day Two
fr_lc: Dezyèm Janvye

source: Independence Day
fr_lc: Jou Endepandans

source: Good Friday
fr_lc: Vandredi Sen

source: Easter Monday
fr_lc: Lendi Pak

source: Labour Day
fr_lc: Jou Travay

source: Whit Monday
fr_lc: Lendi Pantekòt

source: Corpus Christi
fr_lc: Fèt-Dié

source: Emancipation Day
fr_lc: Jou Liberasyon

source: National Day
fr_lc: Jou Nasyonal

source: Christmas Day
fr_lc: Nwèl

source: Boxing Day
fr_lc: Landemèn Nwèl
