Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/LI.po
Languages: uk

# Neujahr
source: New Year's Day
uk: Новий рік

# Berchtoldstag
source: Saint Berchtold's Day
uk: День Святого Бертольда

# Heilige Drei Könige
source: Epiphany
uk: Богоявлення

# Mariä Lichtmess
source: Candlemas
uk: Стрітення

# Fasnachtsdienstag
source: Shrove Tuesday
uk: Масний вівторок

# Josefstag
source: Saint Joseph's Day
uk: День Святого Йосипа

# Karfreitag
source: Good Friday
uk: Страсна пʼятниця

# Ostersonntag
source: Easter Sunday
uk: Великдень

# Ostermontag
source: Easter Monday
uk: Великодній понеділок

# Tag der Arbeit
source: Labor Day
uk: День праці

# Auffahrt
source: Ascension Day
uk: Вознесіння Господнє

# Pfingstsonntag
source: Whit Sunday
uk: Трійця

# Pfingstmontag
source: Whit Monday
uk: День Святого Духа

# Fronleichnam
source: Corpus Christi
uk: Свято Тіла і Крові Христових

# Staatsfeiertag
source: National Day
uk: Національне свято

# Mariä Geburt
source: Nativity of Mary
uk: Різдво Пресвятої Богородиці

# Allerheiligen
source: All Saints' Day
uk: День усіх святих

# Mariä Empfängnis
source: Immaculate Conception
uk: Непорочне зачаття Діви Марії

# Heiligabend
source: Christmas Eve
uk: Святий вечір

# Weihnachten
source: Christmas Day
uk: Різдво Христове

# Stefanstag
source: St. Stephen's Day
uk: День Святого Стефана

# Silvester
source: New Year's Eve
uk: Переддень Нового року
