Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/LK.po
Languages: ta_lk

source: %s (අනුමානිත)
ta_lk: %s (அனுமானம்)

source: දෙමළ තෛපොංැලල් දිනය
ta_lk: தமிழ் தைப்பொங்கல் தினம்

source: නිදහස් සමරු දිනය
ta_lk: சுதந்திர தினம்

source: සිංහල හා දෙමළ අලුත් අවුරුදු දිනය
ta_lk: சிங்கள, தமிழ் புத்தாண்டு தினம்

source: සිංහල හා දෙමළ අලුත් අවුරුදු දිනට පෙර දිනය
ta_lk: சிங்கள, தமிழ் புத்தாண்டிற்கு முன்னைய தினம்

source: මහ සිකුරාදා දිනය
ta_lk: பெரிய வெள்ளிக்கிழமை

source: ලොක කම්කරු දිනය
ta_lk: சர்வதேச தொழிலாளர்கள் தினம்

source: නත්තල් උත්සව දිනය
ta_lk: நத்தார் பண்டிகை

source: මහ සිවරාත්රි දිනය
ta_lk: மகா சிவராத்திரி தினம்

source: දීපවාලි උත්සව දිනය
ta_lk: தீபாவளிப் பண்டிகை தினம்

source: දුරුතු පුර පසළොස්වක පෝය දිනය
ta_lk: துருத்து முழு நோன்மதி தினம்

source: නවම් පුර පසළොස්වක පෝය දිනය
ta_lk: நவம் முழு நோன்மதி தினம்

source: මැදින් පුර පසළොස්වක පෝය දිනය
ta_lk: மெதின் முழு நோன்மதி தினம்

source: බක් පුර පසළොස්වක පෝය දිනය
ta_lk: பக் முழு நோன்மதி தினம்

source: වෙසක් පුර පසළොස්වක පෝය දිනය
ta_lk: வெசாக் முழு நோன்மதி தினம்

source: වෙසක් පුර පසළොස්වක පෝය දිනට පසු දිනය
ta_lk: வெசாக் முழு நோன்மதி தினத்திற்கு அடுத்த நாள்

source: පොසොන් පුර පසළොස්වක පෝය දිනය
ta_lk: பொசொன் முழு நோன்மதி தினம்

source: ඇසල පුර පසළොස්වක පෝය දිනය
ta_lk: எசல முழு நோன்மதி தினம்

source: නිකිණි පුර පසළොස්වක පෝය දිනය
ta_lk: நிக்கினி முழு நோன்மதி தினம்

source: බිනර පුර පසළොස්වක පෝය දිනය
ta_lk: பினர முழு நோன்மதி தினம்

source: වප් පුර පසළොස්වක පෝය දිනය
ta_lk: வப் முழு நோன்மதி தினம்

source: ඉල් පුර පසළොස්වක පෝය දිනය
ta_lk: இல் முழு நோன்மதி தினம்

source: උඳුවප් පුර පසළොස්වක පෝය දිනය
ta_lk: உந்துவப் முழு நோன்மதி தினம்

source: ඊදුල් ෆීතර්
ta_lk: ஈதுல் பித்ர்

source: ඊදුල් අල්හා
ta_lk: ஈதுல் அழ்ஹா

source: නබි නායකතුමාගේ උපන් දිනය
ta_lk: நபிகள் நாயகத்தின் பிறந்த தினம்

source: අධි බිනර පුර පසළොස්වක පෝය දිනය
ta_lk: அதி-பினர முழு நோன்மதி தினம்

source: අධි ඇසල පුර පසළොස්වක පෝය දිනය
ta_lk: அதி-எசல முழு நோன்மதி தினம்

source: අධි පොසොන් පුර පසළොස්වක පෝය දිනය
ta_lk: அதி-பொசொன் முழு நோன்மதி தினம்

source: අධි වප් පුර පසළොස්වක පෝය දිනය
ta_lk: அதி-வப் முழு நோன்மதி தினம்

source: අධි වෙසක් පුර පසළොස්වක පෝය දිනය
ta_lk: அதி-வெசாக் முழு நோன்மதி தினம்

source: දින භාගයක විශේෂ බැංකු නිවාඩු දිනය
ta_lk: அரை நாள் விசேட வங்கி விடுமுறை

source: රාජ්ය අංශයේ නිවාඩු දිනය
ta_lk: பொதுத்துறை விடுமுறை

source: විශේෂ බැංකු නිවාඩු දිනය
ta_lk: விசேட வங்கி விடுமுறை

source: විශේෂ රජයේ නිවාඩු දිනය
ta_lk: விசேட பொது விடுமுறை
