Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/LU.po
Languages: fr, uk

# Neijoerschdag
source: New Year's Day
fr: Jour de l'An
uk: Новий рік

# Ouschterméindeg
source: Easter Monday
fr: Lundi de Pâques
uk: Великодній понеділок

# Dag vun der Aarbecht
source: Labor Day
fr: Fête du Travail
uk: День праці

# Europadag
source: Europe Day
fr: Jour de l'Europe
uk: День Європи

# Christi Himmelfaart
source: Ascension Day
fr: Ascension
uk: Вознесіння Господнє

# Péngschtméindeg
source: Whit Monday
fr: Lundi de Pentecôte
uk: День Святого Духа

# Nationalfeierdag
source: National Day
fr: Fête nationale
uk: Національне свято

# Léiffrawëschdag
source: Assumption Day
fr: Assomption
uk: Внебовзяття Пресвятої Діви Марії

# Allerhellgen
source: All Saints' Day
fr: Toussaint
uk: День усіх святих

# Chrëschtdag
source: Christmas Day
fr: Noël
uk: Різдво Христове

# Stiefesdag
source: St. Stephen's Day
fr: Saint Etienne
uk: День Святого Стефана
