Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/MA.po
Languages: fr

source: (تقدير) %s
fr: %s (estimé)

source: رأس السنة الميلادية
fr: Nouvel an

source: ذكرى تقديم وثيقة الاستقلال
fr: Manifeste de l'indépendance

source: رأس السنة الأمازيغية
fr: Nouvel an Amazigh

source: عيد العمال
fr: Fête du Travail

source: عيد العرش
fr: Fête du Trône

source: ذكرى استرجاع إقليم وادي الذهب
fr: Allégeance Oued Eddahab

source: ذكرى ثورة الملك و الشعب
fr: La révolution du roi et du peuple

source: عيد الشباب
fr: Fête de la Jeunesse

source: ذكرى المسيرة الخضراء
fr: La marche verte

source: عيد الإستقلال
fr: Fête de l'indépendance

source: عيد الفطر
fr: Fête de la rupture du jeûne

source: عيد الأضحى
fr: Fête du sacrifice

source: رأس السنة الهجرية
fr: Nouvel an musulman

source: عيد المولد النبوي
fr: Anniversaire du prophète
