Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/MM.po
Languages: th

# %s (ခန့်မှန်း)
source: %s (estimated)
th: %s (โดยประมาณ)

# နိုင်ငံတကာနှစ်သစ်ကူးနေ့
source: New Year's Day
th: วันขึ้นปีใหม่

# လွတ်လပ်ရေးနေ့
source: Independence Day
th: วันเอกราช

# ပြည်ထောင်စုနေ့
source: Union Day
th: วันสหภาพ

# တောင်သူလယ်သမားနေ့
source: Peasants' Day
th: วันชาวนา

# တပ်မတော်နေ့
source: Armed Forces Day
th: วันกองทัพพม่า

# တော်လှန်ရေးနေ့
source: Revolution Day
th: วันครบรอบการปฏิวัติ

# မေဒေးနေ့
source: May Day
th: วันเมย์เดย์ (วันแรงงาน)

# အာဇာနည်နေ့
source: Martyrs' Day
th: วันผู้เสียสละแห่งพม่า

# ခရစ္စမတ်နေ့
source: Christmas Day
th: วันคริสต์มาส

# အီဒုလ်အဿွဟာနေ့
source: Eid al-Adha
th: วันอีดิ้ลอัฎฮา

# တရုတ်နှစ်သစ်ကူးနေ့
source: Chinese New Year
th: วันตรุษจีน

# မြန်မာနှစ်သစ်ကူး ရုံးပိတ်ရက်များ
source: Myanmar New Year
th: วันตะจาน

# တပေါင်းလပြည့်နေ့
source: Full Moon Day of Tabaung
th: วันเพ็ญเดือนดะบ้อง

# ကဆုန်လပြည့်နေ့
source: Full Moon Day of Kason
th: วันเพ็ญเดือนกะโซน

# ဝါဆိုလပြည့်နေ့
source: Full Moon Day of Waso
th: วันเพ็ญเดือนวาโซ

# သီတင်းကျွတ်ပိတ်ရက်များ
source: Thadingyut Holidays
th: วันเทศกาลตะดิ่งจุ๊ต

# ဒီပါဝလီနေ့
source: Diwali
th: วันดีปาวลี

# တန်ဆောင်တိုင်လပြည့်နေ့
source: Full Moon Day of Tazaungmon
th: วันเพ็ญเดือนดะซองโม่น

# အမျိုးသားနေ့
source: National Day
th: วันชาติ

# ကရင်နှစ်သစ်ကူးနေ့
source: Karen New Year
th: วันขึ้นปีใหม่กะเหรี่ยง

# %d-%m-%Y
source: %m/%d/%Y
th: %d/%m/%Y

# အလုပ်ပိတ်ရက် (%s မှ ပြန်လဲထားသည်)
source: Day off (substituted from %s)
th: วันหยุด (แทน %s)
