Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/MO.po
Languages: pt_mo, th, zh_cn

# %s（推定）
source: %s (estimated)
pt_mo: %s (estimado)
th: %s (โดยประมาณ)

# 元旦
source: New Year's Day
pt_mo: Fraternidade Universal
th: วันขึ้นปีใหม่
zh_cn: 元旦

# 農曆正月初一
source: Chinese New Year's Day
pt_mo: 1.º dia do Novo Ano Lunar
th: วันตรุษจีน
zh_cn: 农历正月初一

# 農曆正月初二
source: The second day of Chinese New Year
pt_mo: 2.º dia do Novo Ano Lunar
th: วันตรุษจีนวันที่สอง
zh_cn: 农历正月初二

# 農曆正月初三
source: The third day of Chinese New Year
pt_mo: 3.º dia do Novo Ano Lunar
th: วันตรุษจีนวันที่สาม
zh_cn: 农历正月初三

# 勞動節
source: Labor Day
pt_mo: Dia do Trabalhador
th: วันแรงงาน
zh_cn: 劳动节

# 重陽節
source: Double Ninth Festival
pt_mo: Chong Yeong (Culto dos Antepassados)
th: วันไหว้บรรพบุรุษ
zh_cn: 重阳节

# 中華人民共和國國慶日
source: National Day of the People's Republic of China
pt_mo: Implantação da República Popular da China
th: วันชาติจีน
zh_cn: 中华人民共和国国庆日

# 清明節
source: Tomb-Sweeping Day
pt_mo: Cheng Ming (Dia de Finados)
th: วันเช็งเม้ง
zh_cn: 清明节

# 葡國日、賈梅士日暨葡僑日
source: Day of Portugal, Camões, and the Portuguese Communities
pt_mo: Dia de Portugal, de Camões e das Comunidades Portuguesas
th: วันชาติโปรตุเกส วันกาม๊อยช์ และวันแห่งประชาคมโปรตุเกส
zh_cn: 葡国日、贾梅士日暨葡侨日

# 中秋節
source: Mid-Autumn Festival
pt_mo: Chong Chao (Bolo Lunar)
th: วันไหว้พระจันทร์
zh_cn: 中秋节

# 中秋節翌日
source: The Day following Mid-Autumn Festival
pt_mo: Dia seguinte ao Chong Chao (Bolo Lunar)
th: วันหลังวันไหว้พระจันทร์
zh_cn: 中秋节翌日

# 澳門特別行政區成立紀念日
source: Macao S.A.R. Establishment Day
pt_mo: Dia Comemorativo do Estabelecimento da Região Administrativa Especial de Macau
th: วันสถาปนาเขตบริหารพิเศษมาเก๊า
zh_cn: 澳门特别行政区成立纪念日

# 耶穌受難日
source: Good Friday
pt_mo: Morte de Cristo
th: วันศุกร์ประเสริฐ
zh_cn: 耶稣受难日

# 聖周星期五
source: Good Friday
pt_mo: Sexta-Feira Santa
th: วันศุกร์ประเสริฐ
zh_cn: 圣周星期五

# 復活節前日
source: The Day before Easter
pt_mo: Véspera da Ressurreição de Cristo
th: วันก่อนวันอาทิตย์อีสเตอร์
zh_cn: 复活节前日

# 聖周星期六
source: Holy Saturday
pt_mo: Sábado Santo
th: วันเสาร์ศักดิ์สิทธิ์
zh_cn: 圣周星期六

# 端午節
source: Dragon Boat Festival
pt_mo: Tung Ng (Barco Dragão)
th: วันไหว้บ๊ะจ่าง
zh_cn: 端午节

# 追思節
source: All Soul's Day
pt_mo: Dia de Finados
th: วันภาวนาอุทิศแด่ผู้ล่วงลับ
zh_cn: 追思节

# 聖母無原罪瞻禮
source: Immaculate Conception
pt_mo: Imaculada Conceição
th: วันสมโภชแม่พระผู้ปฏิสนธินิรมล
zh_cn: 圣母无原罪瞻礼

# 冬至
source: Winter Solstice
pt_mo: Solstício de Inverno
th: วันตงจื้อ(เหมายัน)
zh_cn: 冬至

# 聖誕節前日
source: Christmas Eve
pt_mo: Véspera de Natal
th: วันคริสต์มาสอีฟ
zh_cn: 圣诞节前日

# 聖誕節前夕
source: Christmas Eve
pt_mo: Véspera de Natal
th: วันคริสต์มาสอีฟ
zh_cn: 圣诞节前夕

# 聖誕前夕
source: Christmas Eve
pt_mo: Véspera de Natal
th: วันคริสต์มาสอีฟ
zh_cn: 圣诞前夕

# 聖誕節
source: Christmas Day
pt_mo: Natal
th: วันคริสต์มาส
zh_cn: 圣诞节

# 聖誕
source: Christmas Day
pt_mo: Natal
th: วันคริสต์มาส
zh_cn: 圣诞

# 聖母升天
source: Assumption Day
pt_mo: Assunção de Nossa Senhora
th: วันสมโภชแม่พระรับเกียรติยกขึ้นสวรรค์
zh_cn: 圣母升天

# 諸聖節
source: All Saints' Day
pt_mo: Dia de Todos os Santos
th: วันสมโภชนักบุญทั้งหลาย
zh_cn: 诸圣节

# 基督聖體聖血節
source: Corpus Christi
pt_mo: Corpo de Deus
th: วันสมโภชพระคริสตวรกาย
zh_cn: 基督圣体圣血节

# 自由日
source: Freedom Day
pt_mo: Dia da Liberdade
th: วันแห่งเสรีภาพ
zh_cn: 自由日

# 葡萄牙共和國國慶日
source: Republic Day
pt_mo: Implantação da República Portuguesa
th: วันสถาปนาสาธารณรัฐโปรตุเกส
zh_cn: 葡萄牙共和国成立日

# 恢復獨立紀念日
source: Restoration of Independence Day
pt_mo: Restauração da Independência
th: วันรำลึกการกอบกู้เอกราชโปรตุเกส
zh_cn: 恢复独立纪念日

# 佛誕節
source: The Buddha's Birthday
pt_mo: Dia do Buda
th: วันวิสาขบูชา
zh_cn: 佛诞节

# 中華人民共和國國慶日翌日
source: The day following National Day of the People's Republic of China
pt_mo: Dia seguinte à Implantação da República Popular da China
th: วันหลังวันชาติจีน
zh_cn: 中华人民共和国国庆日翌日

# %s（下午）
source: %s (Afternoon)
pt_mo: %s (na parte da tarde)
th: %s (ครึ่งบ่าย)
zh_cn: %s（下午）

# 農曆除夕
source: Chinese New Year's Eve
pt_mo: Véspera do Novo Ano Lunar
th: วันก่อนวันตรุษจีน
zh_cn: 农历除夕

# 農曆正月初四
source: The fourth day of Chinese New Year
pt_mo: 4.º dia do Novo Ano Lunar
th: วันตรุษจีนวันที่สี่
zh_cn: 农历正月初四

# 農曆正月初五
source: The fifth day of Chinese New Year
pt_mo: 5.º dia do Novo Ano Lunar
th: วันตรุษจีนวันที่ห้า
zh_cn: 农历正月初五

# 除夕
source: New Year's Eve
pt_mo: Véspera do Dia da Fraternidade Universal
th: วันสิ้นปี
zh_cn: 除夕

# %s的補假
source: Compensatory rest day for %s
pt_mo: Dia de descanso compensatório relativo ao %s
th: ชดเชย%s
zh_cn: %s的补假

# %s後首個工作日
source: The first working day after %s
pt_mo: 1.º dia útil após %s
th: วันทำงานวันแรกหลัง%s
zh_cn: %s后首个工作日

# %s的補假（推定）
source: Compensatory rest day for %s (estimated)
pt_mo: Dia de descanso compensatório relativo ao %s (estimado)
th: ชดเชย%s (โดยประมาณ)

# %s後首個工作日（推定）
source: The first working day after %s (estimated)
pt_mo: 1.º dia útil após %s (estimado)
th: วันทำงานวันแรกหลัง%s (โดยประมาณ)

# 海島市日
source: Day of the Municipality of Ilhas
pt_mo: Dia do Município das Ilhas
th: วันเทศบาลอิลฮาส
zh_cn: 海岛市日

# 澳門市日
source: Macau City Day
pt_mo: Dia da Cidade de Macau
th: วันเมืองมาเก๊า
zh_cn: 澳门市日

# 額外公眾假期
source: Additional Public Holiday
pt_mo: Feriado Público Adicional
th: วันหยุดเพิ่มเติม
zh_cn: 额外公众假期

# 額外公眾半日假
source: Additional Half-Day Public Holiday
pt_mo: Meio Dia de Feriado Público Adicional
th: วันหยุดครึ่งวันเพิ่มเติม
zh_cn: 额外公众半日假

# 中國人民抗日戰爭暨世界反法西斯戰爭勝利七十周年紀念日
source: 70th Anniversary of the Victory of the Chinese People's War of Resistance against Japanese Aggression and the World Anti-Fascist War
pt_mo: Dia Comemorativo do 70.º Aniversário da Vitória do Povo Chinês na Guerra contra o Japão e da Vitória Mundial contra o Fascismo
th: วันครบรอบ 70 ปีแห่งการได้รับชัยชนะจากสงครามต่อต้านญี่ปุ่นและลัทธิฟาสซิสต์โลก
zh_cn: 中国人民抗日战争暨世界反法西斯战争胜利七十周年纪念日

# 中華人民共和國國慶日翌日及中秋節翌日重疊
source: Overlapping of the Day following National Day of the People's Republic of China and the Day following Mid-Autumn Festival
pt_mo: Sobreposição do Dia seguinte à Implantação da República Popular da China e do Dia seguinte ao Chong Chao (Bolo Lunar)
th: วันหยุดชดเชยเนื่องในโอกาสวันหลังวันชาติจีนและวันหลังวันไหว้พระจันทร์หยุดตรงกัน
zh_cn: 中华人民共和国国庆日翌日及中秋节翌日重迭

# 中華人民共和國國慶日翌日及重陽節重疊
source: Overlapping of the Day following National Day of the People's Republic of China and the Double Ninth Festival
pt_mo: Sobreposição do Dia seguinte à Implantação da República Popular da China e do Chong Yeong (Culto dos Antepassados)
th: วันหยุดชดเชยเนื่องในโอกาสวันหลังวันชาติจีนและวันไหว้บรรพบุรุษหยุดตรงกัน
zh_cn: 中华人民共和国国庆日翌日及重阳节重迭

# 中華人民共和國國慶日及中秋節翌日重疊
source: Overlapping of the National Day of the People's Republic of China and the Day following Mid-Autumn Festival
pt_mo: Sobreposição da Implantação da República Popular da China e do Dia seguinte ao Chong Chao (Bolo Lunar)
th: วันหยุดชดเชยเนื่องในโอกาสวันชาติจีนและวันหลังวันไหว้พระจันทร์หยุดตรงกัน
zh_cn: 中华人民共和国国庆日及中秋节翌日重迭

# 額外政府假期
source: Additional Government Holiday
pt_mo: Feriado Governamental Adicional
th: วันหยุดราชการเพิ่มเติม
zh_cn: 额外政府假期

# 澳門回歸祖國暨中華人民共和國澳門特別行政區成立日
source: The Handover of Macau to China and the Establishment of the Macau Special Administrative Region of the People's Republic of China
pt_mo: Dia do Retorno de Macau à Mãe-Pátria e do Estabelecimento da Região Administrativa Especial de Macau da República Popular da China
th: วันส่งมอบมาเก๊ากลับคืนสู่จีนและการสถาปนาเขตบริหารพิเศษมาเก๊าแห่งสาธารณรัฐประชาชนจีน
zh_cn: 澳门回归祖国暨中华人民共和国澳门特别行政区成立日

# 澳門回歸祖國暨中華人民共和國澳門特別行政區成立日翌日
source: The day following the Handover of Macau to China and the Establishment of the Macau Special Administrative Region of the People's Republic of China
pt_mo: Dia seguinte ao do Retorno de Macau à Mãe-Pátria e do Estabelecimento da Região Administrativa Especial de Macau da República Popular da China
th: วันหลังวันส่งมอบมาเก๊ากลับคืนสู่จีนและการสถาปนาเขตบริหารพิเศษมาเก๊าแห่งสาธารณรัฐประชาชนจีน
zh_cn: 澳门回归祖国暨中华人民共和国澳门特别行政区成立日翌日
