Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/NA.po
Languages: uk

source: %s (observed)
uk: %s (вихідний)

source: New Year's Day
uk: Новий рік

source: Independence Day
uk: День незалежності

source: Good Friday
uk: Страсна пʼятниця

source: Easter Monday
uk: Великодній понеділок

source: Workers' Day
uk: День трудящих

source: Cassinga Day
uk: День Кассінги

source: Africa Day
uk: День Африки

source: Genocide Remembrance Day
uk: День памʼяті жертв геноциду

source: Ascension Day
uk: Вознесіння Господнє

source: Heroes' Day
uk: День Героїв

source: Day of the Namibian Women and International Human Rights Day
uk: День намібійських жінок та Міжнародний день прав людини

source: International Human Rights Day
uk: Міжнародний день прав людини

source: Christmas Day
uk: Різдво Христове

source: Family Day
uk: День родини

source: Y2K changeover
uk: Y2K-перехід

source: General Election Day
uk: День загальних виборів

source: Regional Election Day
uk: День місцевих виборів

source: Walvis Bay Reintegration Day
uk: День реінтеграції Волфіш-Бей

source: Public Holiday
uk: Вихідний день

source: Day of Mourning for Honourable Moses Garoeb
uk: День жалоби за Мозесом Гароебом

source: Burial ceremony of Dr. Hage Gottfried Geingob
uk: Церемонія поховання Хаге Готтфріда Гейнгоба

source: Burial ceremony of Dr. Sam Shafiishuna Nujoma
uk: Церемонія поховання Сема Шафіішуна Нуйоми
