Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/NP.po
Languages: ne

source: %s (estimated)
ne: %s (अनुमानित)

source: Martyr's Day
ne: शहीद दिवस

source: National Democracy Day
ne: राष्ट्रिय प्रजातन्त्र दिवस

source: Republic Day
ne: गणतन्त्र दिवस

source: Ram Navami
ne: राम नवमी

source: Janai Poornima
ne: जनै पूर्णिमा

source: Shree Krishna Janmashtami
ne: श्रीकृष्ण जन्माष्टमी

source: Ghatasthapana
ne: घटस्थापना

source: Duwadashi (Dashain)
ne: दुवादशी (दशैं)

source: Prithvi Jayanti
ne: पृथ्वी जयन्ती

source: International Women's Day
ne: अन्तर्राष्ट्रिय महिला दिवस

source: Nepali New Year
ne: नेपाली नयाँ वर्ष

source: International Labour Day
ne: अन्तर्राष्ट्रिय श्रम दिवस

source: Constitution Day
ne: संविधान दिवस

source: Christmas Day
ne: क्रिसमसको दिन

source: Maghe Sankranti
ne: माघे संक्रान्ति

source: Sonam Lhochhar
ne: सोनम ल्होछार

source: Maha Shivaratri
ne: महाशिवरात्रि

source: Gyalpo Lhosar
ne: ग्याल्पो ल्होसार

source: Fagu Poornima
ne: फागुपुर्णिमा

source: Fagu Poornima (Terai)
ne: फागुपूर्णिमा (तराई)

source: Buddha Jayanti
ne: बुद्ध जयन्ती

source: Fulpati
ne: फुलपाती

source: Maha Ashtami
ne: महा अष्टमी

source: Maha Navami
ne: महा नवमी

source: Bijaya Dashami
ne: विजया दशमी

source: Ekadashi (Dashain)
ne: एकादशी (दशैं)

source: Laxmi Pooja
ne: लक्ष्मी पुजा

source: Gai Tihar
ne: गाई तिहार

source: Gobardhan Pooja
ne: गोवर्धन पूजा

source: Mha Pooja
ne: म्ह पूजा

source: Bhai Tika
ne: भाइटीका

source: Chhath Parva
ne: छठ पर्व

source: Tamu Lhochhar
ne: तमु ल्हाेसार

source: Id-ul-Fitr
ne: इद उल फित्र

source: Bakrid
ne: बकरिद

source: Day of National Mourning
ne: राष्ट्रिय शोक दिवस

source: Tihar Holiday
ne: तिहार बिदा

source: People War's Day
ne: जनयुद्ध दिवस
