Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/PK.po
Languages: ur_pk

source: %s (estimated)
ur_pk: %s (اندازاً)

source: Kashmir Solidarity Day
ur_pk: یوم یکجہتی کشمیر

source: Pakistan Day
ur_pk: یوم پاکستان

source: Labour Day
ur_pk: یوم مزدور

source: Youm-e-Takbeer
ur_pk: یوم تکبیر

source: Independence Day
ur_pk: یوم آزادی

source: Iqbal Day
ur_pk: یوم اقبال

source: Quaid-e-Azam Day
ur_pk: یوم قائداعظم

source: Eid-ul-Fitr
ur_pk: عید الفطر

source: Eid-ul-Adha
ur_pk: عید الاضحی

source: Eid Milad-un-Nabi
ur_pk: عید میلاد النبی

source: Ashura
ur_pk: عاشورہ
