Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/SM.po
Languages: uk

source: Capodanno
uk: Новий рік

source: Epifania
uk: Богоявлення

source: Anniversario della Liberazione della Repubblica e Festa di Sant'Agata
uk: Річниця визволення Республіки та День Святої Агати

source: Anniversario dell'Arengo
uk: Річниця Аренго

source: Pasqua
uk: Великдень

source: Lunedì dell'angelo
uk: Великодній понеділок

source: Investitura Capitani Reggenti
uk: Інвеститура капітанів-регентів

source: Festa dei lavoratori
uk: День трудящих

source: Corpus Domini
uk: Свято Тіла і Крові Христових

source: Anniversario della Caduta del Fascismo e Festa della Libertà
uk: Річниця падіння фашизму та День свободи

source: Assunzione della B.V. Maria
uk: Внебовзяття Пресвятої Діви Марії

source: San Marino, Anniversario di Fondazione della Repubblica
uk: Річниця заснування Республіки та День Святого Марина

source: Tutti i Santi
uk: День усіх святих

source: Commemorazione dei defunti
uk: День вшанування померлих

source: Immacolata Concezione
uk: Непорочне зачаття Діви Марії

source: Natale
uk: Різдво Христове

source: Santo Stefano
uk: День Святого Стефана

source: Vigilia di Natale
uk: Святий вечір

source: Ultimo dell'anno
uk: Переддень Нового року
