Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/TJ.po
Languages: ru

source: %s (таҳминан)
ru: %s (приблизительная дата)

source: Соли Нав
ru: Новый год

source: Рӯзи Модар
ru: День Матери

source: Иди байналмилалии Наврӯз
ru: Международный праздник Навруз

source: Рӯзи байналхалқии якдилии меҳнаткашон
ru: Международный день солидарности трудящихся

source: Рӯзи Ғалаба дар Ҷанги Бузурги Ватанӣ
ru: День Победы в Великой Отечественной войне

source: Рӯзи Ваҳдати миллӣ
ru: День Национального единства

source: Рӯзи Истиқлолияти давлатии Ҷумҳурии Тоҷикистон
ru: День Государственной независимости Республики Таджикистан

source: Рӯзи Конститутсияи Ҷумҳурии Тоҷикистон
ru: День Конституции Республики Таджикистан

source: Рӯзи иди Рамазон
ru: Ураза-байрам

source: Рӯзи иди Қурбон
ru: Курбан-байрам
