Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/TM.po
Languages: ru

source: %s (çak edilýär)
ru: %s (приблизительная дата)

source: %s (dynç güni)
ru: %s (выходной)

source: %s (dynç güni, çak edilýär)
ru: %s (выходной, приблизительная дата)

source: Täze ýyl
ru: Новый год

source: Türkmenistanyň Döwlet baýdagynyň güni
ru: День государственного флага

source: Milli bahar baýramy
ru: Национальный праздник весны

source: Halkara zenanlar güni
ru: Международный женский день

source: 1941-1945-nji ýyllaryň Beýik Watançylyk urşunda ýeňiş güni
ru: День Победы в Великой Отечественной войне 1941-1945 годов

source: Türkmenistanyň Konstitusiýasynyň we Döwlet baýdagynyň güni
ru: День Конституции Туркменистана и Государственного флага Туркменистана

source: Türkmenistanyň Konstitusiýasynyň we Makhtumkuli Pyragynyň şygryýet güni
ru: День Конституции Туркменистана и поэзии Махтумкули Фраги

source: Galkynyş, Agzybirlik we Magtymguly Pyragynyň şygryýet güni
ru: День возрождения, единства и поэзии Махтумкули Фраги

source: Türkmenistanyň Garaşsyzlyk güni
ru: День независимости

source: Hatyra güni
ru: День поминовения

source: Milli ýatlama güni
ru: Национальный день поминовения

source: Halkara Bitaraplyk güni
ru: Международный день нейтралитета

source: Oraza baýramy
ru: Ораза байрам

source: Gurban baýramy
ru: Курбан байрам
