Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/UA.po
Languages: ar, th

source: %s (вихідний)
ar: (يوم عطلة) %s
th: ชดเชย%s

source: Новий рік
ar: السنة الجديدة
th: วันขึ้นปีใหม่

source: Міжнародний жіночий день
ar: اليوم العالمي للمرأة
th: วันสตรีสากล

source: Великдень (Пасха)
ar: عيد الفصح
th: วันอาทิตย์อีสเตอร์

source: Трійця
ar: الثالوث
th: วันสมโภชพระตรีเอกภาพ

source: День праці
ar: عيد العمال
th: วันแรงงาน

source: День міжнародної солідарності трудящих
ar: يوم التضامن العمالي العالمي
th: วันสมานฉันท์แรงงานสากล

source: День памʼяті та перемоги над нацизмом у Другій світовій війні 1939-1945 років
ar: يوم إحياء الذكرى والانتصار على النازية في الحرب العالمية الثانية 1939-1945
th: วันแห่งความทรงจำและชัยชนะเหนือระบอบชาติสังคมนิยมในสงครามโลกครั้งที่สอง 1939-1945

source: День перемоги над нацизмом у Другій світовій війні (День перемоги)
ar: يوم النصر على النازية في الحرب العالمية الثانية (يوم النصر)
th: วันแห่งชัยชนะเหนือระบอบชาติสังคมนิยมในสงครามโลกครั้งที่สอง (วันแห่งชัยชนะ)

source: День перемоги
ar: يوم النصر
th: วันแห่งชัยชนะ

source: День Конституції України
ar: يوم الدستور في أوكرانيا
th: วันรัฐธรรมนูญยูเครน

source: День Української Державності
ar: يوم الدولة الأوكرانية
th: วันรัฐยูเครน

source: День незалежності України
ar: عيد استقلال أوكرانيا
th: วันประกาศอิสรภาพยูเครน

source: День захисників і захисниць України
ar: يوم المدافعين عن أوكرانيا
th: วันแห่งผู้พิทักษ์ยูเครน

source: День захисника України
ar: يوم المدافع عن أوكرانيا
th: วันผู้พิทักษ์ยูเครน

source: Річниця Великої Жовтневої соціалістичної революції
ar: ذكرى ثورة أكتوبر الاشتراكية العظمى
th: วันครบรอบการปฏิวัติสังคมนิยมแห่งเดือนตุลาคมอันยิ่งใหญ่

source: Різдво Христове
ar: عيد الميلاد
th: วันคริสต์มาส

source: Вихідний день (перенесено з %s)
ar: يوم عطلة (استبدل من %s)
th: วันหยุด (แทน %s)

source: Вихідний згідно указу Президента
ar: العطلة بمرسوم رئاسي
th: วันหยุดตามประกาศคำสั่งประธานาธิบดี
