Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/US.po
Languages: th

source: %s (observed)
th: ชดเชย%s

source: %s (estimated)
th: %s (โดยประมาณ)

source: %s (observed, estimated)
th: ชดเชย%s (โดยประมาณ)

source: New Year's Day
th: วันขึ้นปีใหม่

source: Birthday of Martin Luther King, Jr.
th: วันเกิดมาร์ติน ลูเทอร์ คิง จูเนียร์

source: Washington's Birthday
th: วันเกิดวอชิงตัน

source: Veterans Day
th: วันทหารผ่านศึก

source: Armistice Day
th: วันสงบศึก

source: Memorial Day
th: วันรำลึก

source: Juneteenth National Independence Day
th: วันประกาศอิสรภาพแห่งชาติจูนทีนท์

source: Independence Day
th: วันประกาศอิสรภาพ

source: Labor Day
th: วันแรงงาน

source: Columbus Day
th: วันโคลัมบัส

source: Thanksgiving Day
th: วันขอบคุณพระเจ้า

source: Christmas Day
th: วันคริสต์มาส

source: Christmas Eve
th: วันคริสต์มาสอีฟ

source: Martin Luther King Jr. Day
th: วันมาร์ติน ลูเทอร์ คิง จูเนียร์

source: Martin Luther King Jr.'s Birthday
th: วันเกิดมาร์ติน ลูเทอร์ คิง จูเนียร์

source: Lincoln's Birthday
th: วันเกิดลิงคอล์น

source: Presidents' Day
th: วันประธานาธิบดี

source: Seward's Day
th: วันซีเวิร์ด

source: Indigenous Peoples' Day
th: วันแห่งชนพื้นเมือง

source: Alaska Day
th: วันอะลาสกา

source: Martin Luther King, Jr & Robert E. Lee's Birthday
th: วันเกิดมาร์ติน ลูเทอร์ คิง จูเนียร์และโรเบิร์ต อี. ลี

source: George Washington & Thomas Jefferson's Birthday
th: วันเกิดจอร์จ วอชิงตัน และทอมัส เจฟเฟอร์สัน

source: Confederate Memorial Day
th: วันรำลึกถึงฝ่ายสมาพันธรัฐ

source: Jefferson Davis Birthday
th: วันเกิดเจฟเฟอร์สัน เดวิส

source: Columbus Day / American Indian Heritage Day / Fraternal Day
th: วันโคลัมบัส / วันอนุรักษ์มรดกชนพื้นเมืองอเมริกัน / วันภราดรภาพ

source: Columbus Day / Fraternal Day
th: วันโคลัมบัส / วันภราดรภาพ

source: Dr. Martin Luther King Jr. and Robert E. Lee's Birthdays
th: วันเกิด ดร. มาร์ติน ลูเทอร์ คิง จูเนียร์และโรเบิร์ต อี. ลี

source: George Washington's Birthday and Daisy Gatson Bates Day
th: วันเกิดจอร์จ วอชิงตันและวันเดซี่ แกตสัน เบตส์

source: American Samoa Flag Day
th: วันธงชาติอเมริกันซามัว

source: Manu'a Islands Cession Day
th: วันส่งมอบหมู่เกาะมานูอา

source: White Sunday
th: วันอาทิตย์ขาว

source: Dr. Martin Luther King Jr. / Civil Rights Day
th: วัน ดร. มาร์ติน ลูเทอร์ คิง จูเนียร์ / วันสิทธิพลเมือง

source: Lincoln/Washington Presidents' Day
th: วันประธานาธิบดีลิงคอล์น/วอชิงตัน

source: Susan B. Anthony Day
th: วันซูซาน บี. แอนโทนี

source: Cesar Chavez Day
th: วันซีซาร์ ชาเวซ

source: Day After Thanksgiving
th: วันหลังวันขอบคุณพระเจ้า

source: Diwali
th: วันดีปาวลี

source: Washington-Lincoln Day
th: วันวอชิงตัน-ลิงคอล์น

source: Frances Xavier Cabrini Day
th: วันฟรานเซส ซาเวียร์ คาบรินี

source: Good Friday
th: วันศุกร์ประเสริฐ

source: Inauguration Day
th: วันสาบานตนประธานาธิบดี

source: Emancipation Day
th: วันเลิกทาส

source: Election Day
th: วันเลือกตั้ง

source: Friday After Thanksgiving
th: ศุกร์หลังวันขอบคุณพระเจ้า

source: Robert E. Lee's Birthday
th: วันเกิดโรเบิร์ต อี. ลี

source: State Holiday
th: วันหยุดประจำรัฐ

source: Guam Discovery Day
th: วันค้นพบกวม

source: Liberation Day (Guam)
th: วันปลดปล่อย (กวม)

source: All Souls' Day
th: วันภาวนาอุทิศแด่ผู้ล่วงลับ

source: Lady of Camarin Day
th: วันแม่พระแห่งคามาริน

source: Prince Jonah Kuhio Kalanianaole Day
th: วันเจ้าชายโจนาห์ คูฮิโอ คาลานิอาเนาโอะเล

source: Kamehameha Day
th: วันคาเมฮาเมฮา

source: Statehood Day
th: วันครบรอบการได้รัฐภาพ

source: Martin Luther King Jr. / Idaho Human Rights Day
th: วันมาร์ติน ลูเทอร์ คิง จูเนียร์ / วันสิทธิมนุษยชนไอดาโฮ

source: Casimir Pulaski Day
th: วันคาซิเมียร์ พูลาสกี้

source: Primary Election Day
th: วันเลือกตั้งขั้นต้น

source: New Year's Eve
th: วันสิ้นปี

source: Mardi Gras
th: วันมาร์ดิกราส์

source: Evacuation Day
th: วันอพยพ

source: Patriots' Day
th: วันแพทริออต

source: American Indian Heritage Day
th: วันอนุรักษ์มรดกชนพื้นเมืองอเมริกัน

source: Washington's and Lincoln's Birthday
th: วันเกิดวอชิงตันและลิงคอล์น

source: Truman Day
th: วันทรูแมน

source: Commonwealth Covenant Day
th: วันปฏิญญาเครือรัฐ

source: Commonwealth Cultural Day
th: วันวัฒนธรรมแห่งเครือรัฐ

source: Citizenship Day
th: วันแห่งความเป็นพลเมือง

source: Constitution Day
th: วันรัฐธรรมนูญ

source: Lincoln's and Washington's Birthdays
th: วันลิงคอล์นและวอชิงตัน

source: Day After Christmas
th: วันหลังวันคริสต์มาส

source: Arbor Day
th: วันปลูกต้นไม้

source: Presidents Day
th: วันประธานาธิบดี

source: Nevada Day
th: วันเนวาดา

source: Family Day
th: วันครอบครัว

source: Epiphany
th: วันสมโภชพระคริสต์แสดงองค์

source: Birthday of Eugenio María de Hostos
th: วันเกิดเอวเฮนิโอ มารีอา เด โฮสโตส

source: George Washington Day, Presidents' Day, and the Day of the Women and Men Heroes of Puerto Rico
th: วันจอร์จ วอชิงตัน, วันประธานาธิบดี และวันวีรบุรุษและวีรสตรีแห่งเปอร์โตริโก

source: George Washington Day, Presidents' Day, and the Day of the Hero and the Illustrious Woman of Puerto Rico
th: วันจอร์จ วอชิงตัน, วันประธานาธิบดี และวันวีรบุรุษและสตรีผู้ทรงเกียรติแห่งเปอร์โตริโก

source: George Washington Day, Presidents' Day, and the Puerto Rican Heroes Day
th: วันจอร์จ วอชิงตัน, วันประธานาธิบดี และวันวีรบุรุษเปอร์โตริโก

source: George Washington Day
th: วันจอร์จ วอชิงตัน

source: José de Diego Day
th: วันโฮเซ เด ดิเอโก

source: Luis Muñoz Rivera Day
th: วันหลุยส์ มุญโญซ ริเบรา

source: Puerto Rico Constitution Day
th: วันรัฐธรรมนูญเปอร์โตริโก

source: Occupation Day
th: วันยึดครอง

source: José Celso Barbosa Day
th: วันโฮเซ เซลโซ บาร์โบซา

source: Puerto Rican Identity Day
th: วันเอกลักษณ์เปอร์โตริโก

source: Puerto Rican Culture and Discovery of Puerto Rico Day
th: วันวัฒนธรรมเปอร์โตริโกและการค้นพบเปอร์โตริโก

source: Discovery of Puerto Rico Day
th: วันค้นพบเปอร์โตริโก

source: %s (from 12pm)
th: %s (ตั้งแต่ 12:00 น.)

source: Victory Day
th: วันแห่งชัยชนะ

source: Indigenous Peoples' Day / Columbus Day
th: วันแห่งชนพื้นเมือง / วันโคลัมบัส

source: President's Day
th: วันประธานาธิบดี

source: Native Americans' Day
th: วันชนพื้นเมืองอเมริกัน

source: Texas Independence Day
th: วันประกาศอิสรภาพเท็กซัส

source: San Jacinto Day
th: วันรำลึกยุทธการซานฮาซินโต

source: Emancipation Day In Texas
th: วันเลิกทาสในเท็กซัส

source: Lyndon Baines Johnson Day
th: วันลินดอน เบนส์ จอห์นสัน

source: Washington and Lincoln Day
th: วันวอชิงตันและลิงคอล์น

source: Pioneer Day
th: วันผู้บุกเบิก

source: Lee Jackson Day
th: วันลี-แจ็กสัน

source: Three Kings Day
th: วันสมโภชพระคริสต์แสดงองค์

source: Transfer Day
th: วันส่งมอบดินแดน

source: Holy Thursday
th: วันพฤหัสศักดิ์สิทธิ์

source: Easter Monday
th: วันจันทร์อีสเตอร์

source: Columbus Day and Puerto Rico Friendship Day
th: วันโคลัมบัส และวันมิตรภาพกับเปอร์โตริโก

source: Liberty Day
th: วันเลิกทาส

source: Christmas Second Day
th: วันคริสต์มาสวันที่สอง

source: Town Meeting Day
th: วันประชาคมท้องถิ่น

source: Bennington Battle Day
th: วันรำลึกยุทธการเบนนิงตัน

source: Native American Heritage Day
th: วันอนุรักษ์มรดกชนพื้นเมืองอเมริกัน

source: West Virginia Day
th: วันเวสต์เวอร์จิเนีย

source: Valentine's Day
th: วันวาเลนไทน์

source: Saint Patrick's Day
th: วันนักบุญแพทริก

source: Mother's Day
th: วันแม่

source: Father's Day
th: วันพ่อ

source: Halloween
th: วันฮาโลวีน

source: Groundhog Day
th: วันกราวน์ฮ็อก

source: Fasting and Humiliation Day
th: วันถือศีลอดและถ่อมตนต่อพระเจ้า

source: Public Humiliation and Prayer Day
th: วันถ่อมตนร่วมกันและสวดภาวนา

source: Public Thanksgiving and Prayer Day
th: วันขอบคุณพระเจ้าร่วมกันและสวดภาวนา

source: %s (half-day closing)
th: %s (ปิดครึ่งวัน)

source: National Day of Mourning for former President Ronald Reagan
th: วันไว้ทุกข์แห่งชาติแด่อดีตประธานาธิบดีโรนัลด์ เรแกน

source: National Day of Mourning for former President Gerald R. Ford
th: วันไว้ทุกข์แห่งชาติแด่อดีตประธานาธิบดีเจอรัลด์ อาร์. ฟอร์ด

source: National Day of Mourning for former President George H. W. Bush
th: วันไว้ทุกข์แห่งชาติแด่อดีตประธานาธิบดีจอร์จ เอช. ดับเบิลยู. บุช

source: National Day of Mourning for former President Jimmy Carter
th: วันไว้ทุกข์แห่งชาติแด่อดีตประธานาธิบดีจิมมี คาร์เตอร์
