Repository: vacanza/holidays
Catalog: holidays/locale/*/LC_MESSAGES/VA.po
Languages: th

source: Solennità di Maria Santissima Madre di Dio
th: วันสมโภชพระนางมารีอา พระชนนีพระเป็นเจ้า

source: Epifania del Signore
th: วันสมโภชพระคริสต์แสดงองค์

source: Anniversario della istituzione dello Stato della Città del Vaticano
th: วันครบรอบการสถาปนานครรัฐวาติกัน

source: Onomastico del Santo Padre
th: วันฉลองพระนามเดิมสมเด็จพระสันตะปาปา

source: Anniversario dell'Elezione del Santo Padre
th: วันคล้ายวันเลือกตั้งสมเด็จพระสันตะปาปา

source: San Giuseppe
th: วันสมโภชนักบุญโยเซฟ

source: Giovedì Santo
th: วันพฤหัสศักดิ์สิทธิ์

source: Venerdì Santo
th: วันศุกร์ประเสริฐ

source: Sabato Santo
th: วันเสาร์ศักดิ์สิทธิ์

source: Pasqua di Resurrezione
th: วันอาทิตย์อีสเตอร์

source: Lunedì dell'Angelo
th: วันจันทร์อีสเตอร์

source: Martedì in Albis
th: วันอังคารอีสเตอร์

source: San Giuseppe Artigiano
th: วันฉลองนักบุญโยเซฟ กรรมกร

source: Solennità della Pentecoste
th: วันสมโภชพระจิตเจ้า

source: Solennità della Santissima Trinità
th: วันสมโภชพระตรีเอกภาพ

source: Ascensione del Signore
th: วันสมโภชพระเยซูเจ้าเสด็จขึ้นสวรรค์

source: Corpus Domini
th: วันสมโภชพระคริสตวรกาย

source: Santi Pietro e Paolo
th: วันสมโภชนักบุญเปโตรและเปาโล

source: Vigilia dell'Assunzione di Maria Santissima
th: วันก่อนวันสมโภชแม่พระรับเกียรติยกขึ้นสวรรค์

source: Assunzione di Maria Santissima
th: วันสมโภชแม่พระรับเกียรติยกขึ้นสวรรค์

source: Giorno Successivo all'Assunzione di Maria Santissima
th: วันหลังวันสมโภชแม่พระรับเกียรติยกขึ้นสวรรค์

source: Tutti i Santi
th: วันสมโภชนักบุญทั้งหลาย

source: Tutti i Fedeli Defunti
th: วันภาวนาอุทิศแด่ผู้ล่วงลับ

source: Immacolata Concezione
th: วันสมโภชแม่พระผู้ปฏิสนธินิรมล

source: Vigilia di Natale
th: วันคริสต์มาสอีฟ

source: Natale
th: วันคริสต์มาส

source: Santo Stefano
th: วันสมโภชนักบุญสเตเฟน

source: San Giovanni
th: วันสมโภชนักบุญยอห์น

source: Ultimo giorno dell'anno
th: วันสิ้นปี
