Repository: vacanza/holidays
Catalog: holidays/locale/coa_CC/LC_MESSAGES/CC.po
Languages: coa_cc

source: %s (observed)
coa_cc: %s (disambut)

source: %s (estimated)
coa_cc: %s (dianggarkan)

source: %s (observed, estimated)
coa_cc: %s (disambut, dianggarkan)

source: New Year's Day
coa_cc: Hari Tahun Baru

source: Australia Day
coa_cc: Hari Australia

source: Act of Self Determination Day
coa_cc: Hari Penentuan Diri

source: Good Friday
coa_cc: Jumat Agung

source: Easter Monday
coa_cc: Isnin Paskah

source: ANZAC Day
coa_cc: Hari ANZAC

source: King's Birthday
coa_cc: Hari Ulang Tahun Raja

source: Queen's Birthday
coa_cc: Hari Ulang Tahun Ratu

source: Boxing Day
coa_cc: Hari Boxing

source: Christmas Day
coa_cc: Hari Natal

source: Islamic New Year
coa_cc: Tahun Baru Hijriah

source: Prophet's Birthday
coa_cc: Hari Maulaud Nabi

source: Eid al-Fitr
coa_cc: Hari Raya Puasa

source: Eid al-Adha
coa_cc: Hari Raya Haji

source: National Day of Mourning for Queen Elizabeth II
coa_cc: Hari Berkabung Negara untuk Ratu Elizabeth II
