#  holidays
#  --------
#  A fast, efficient Python library for generating country, province and state
#  specific sets of holidays on the fly. It aims to make determining whether a
#  specific date is a holiday as fast and flexible as possible.
#
#  Authors: Vacanza Team and individual contributors (see CONTRIBUTORS file)
#           dr-prodigy <dr.prodigy.github@gmail.com> (c) 2017-2023
#           ryanss <ryanssdev@icloud.com> (c) 2014-2017
#  Website: https://github.com/vacanza/holidays
#  License: MIT (see LICENSE file)

from unittest import TestCase

from holidays.financial.stock_exchange_of_thailand import StockExchangeOfThailand
from tests.common import CommonFinancialTests


class TestStockExchangeOfThailand(CommonFinancialTests, TestCase):
    @classmethod
    def setUpClass(cls):
        super().setUpClass(StockExchangeOfThailand)

    def test_special_holidays(self):
        self.assertHoliday(
            "1996-03-01",
            "1996-06-10",
            "1998-01-02",
            "2002-12-30",
            "2006-04-19",
            "2006-06-12",
            "2006-06-13",
            "2009-01-02",
            "2009-07-06",
            "2010-05-20",
            "2010-05-21",
            "2010-08-13",
            "2011-05-16",
            "2012-01-03",
            "2012-04-09",
            "2013-12-30",
            "2014-08-11",
            "2015-01-02",
            "2015-05-04",
            "2016-05-06",
            "2016-07-18",
            "2017-01-03",
            "2017-10-26",
            "2019-05-06",
            "2020-12-11",
            "2021-02-12",
            "2021-09-24",
            "2022-07-29",
            "2022-10-14",
            "2023-05-05",
            "2023-12-29",
            "2024-04-12",
            "2025-06-02",
            "2025-08-11",
            "2026-01-02",
            "2026-10-16",
        )

    def test_special_holidays_observed(self):
        self.assertHolidayName("ชดเชยวันมาฆบูชา", "1996-02-29")
        self.assertHolidayName("ชดเชยวันสิ้นปี", "2004-01-02")
        self.assertHolidayName("ชดเชยวันเลือกตั้ง", "2007-12-24")
        self.assertHolidayName("ชดเชยวันสงกรานต์", "2020-07-27", "2020-09-04", "2020-09-07")
        self.assertHolidayName("ชดเชยวันปิยมหาราช", "2021-10-22")
        self.assertNoHoliday(
            "1996-03-04",
            "2021-10-25",
        )

    def test_government_special_holidays_not_adopted(self):
        self.assertNoHoliday(
            "2000-12-29",
            "2006-06-09",
            "2006-09-20",
            "2009-04-10",
            "2009-04-16",
            "2009-04-17",
            "2011-10-27",
            "2011-10-28",
            "2011-10-31",
            "2016-10-14",
            "2020-11-19",
            "2020-11-20",
            "2021-04-12",
            "2022-07-15",
            "2022-12-30",
            "2023-07-31",
            "2024-12-30",
        )

    def test_buddhist_lent_day(self):
        name = "วันเข้าพรรษา"
        self.assertHolidayName(
            name,
            "1992-07-15",
            "1993-08-03",
            "1995-07-12",
            "1996-07-30",
            "1998-07-09",
            "1999-07-28",
            "2000-07-17",
            "2001-07-06",
            "2002-07-25",
            "2003-07-14",
            "2006-07-11",
        )
        self.assertNoHolidayName(name, range(2007, self.end_year))
        obs_dts = (
            "1994-07-25",
            "1997-07-21",
            "2004-08-02",
        )
        self.assertHolidayName(f"ชดเชย{name}", obs_dts)
        self.assertNoNonObservedHoliday(obs_dts)
        self.assertNoHoliday(
            "2022-07-14",
            "2023-08-02",
            "2025-07-11",
            "2026-07-30",
        )

    def test_mid_year_closing_day(self):
        name = "วันหยุดภาคครึ่งปีของสถาบันการเงินและสถาบันการเงินเฉพาะกิจ"
        self.assertHolidayName(name, (f"{year}-07-01" for year in range(self.start_year, 2019)))
        self.assertNoHolidayName(name, range(2019, self.end_year))
        self.assertNoHoliday("2017-07-03", "2018-07-02")

    def test_coronation_day(self):
        name = "วันฉัตรมงคล"
        self.assertHolidayName(name, (f"{year}-05-05" for year in range(self.start_year, 2017)))
        self.assertHolidayName(name, (f"{year}-05-04" for year in range(2020, self.end_year)))
        self.assertNoHolidayName(name, 2017, 2018, 2019)

    def test_songkran_festival(self):
        name = "วันสงกรานต์"
        self.assertHolidayName(
            name,
            (f"{year}-04-{day}" for year in range(self.start_year, 1998) for day in (12, 13, 14)),
        )
        self.assertHolidayName(
            name,
            (
                f"{year}-04-{day}"
                for year in range(1998, self.end_year)
                if year != 2020
                for day in (13, 14, 15)
            ),
        )
        self.assertNoHolidayName(name, 2020)
        obs_dts = (
            "1996-04-15",
            "1997-04-15",
            "2001-04-16",
            "2002-04-16",
            "2013-04-16",
            "2018-04-16",
            "2024-04-16",
            "2029-04-16",
        )
        self.assertHolidayName(f"ชดเชย{name}", obs_dts)
        self.assertNoNonObservedHoliday(obs_dts)
        self.assertNoHoliday(
            "2003-04-16",
            "2006-04-17",
            "2017-04-17",
            "2023-04-17",
            "2025-04-16",
        )

    def test_new_years_eve(self):
        name = "วันสิ้นปี"
        self.assertHolidayName(
            name, (f"{year}-12-31" for year in self.full_range if year not in {1997, 2003})
        )
        self.assertHolidayName(name, "1998-01-02")
        self.assertNoHoliday("1997-12-31", "2003-12-31")
        obs_dts = (
            "1996-01-02",
            "2001-01-02",
            "2018-01-02",
            "2023-01-02",
            "2029-01-02",
        )
        self.assertHolidayName(f"ชดเชย{name}", obs_dts)
        self.assertNoNonObservedHoliday(obs_dts)
        self.assertNoHoliday(
            "2023-01-03",
            "2024-01-02",
        )

    def test_asarnha_bucha(self):
        name = "วันอาสาฬหบูชา"
        self.assertNoHolidayName(name, range(self.start_year, 2007))
        self.assertHolidayName(
            name,
            "2022-07-13",
            "2023-08-01",
            "2024-07-20",
            "2025-07-10",
            "2026-07-29",
            "2027-07-18",
        )
        obs_dts = (
            "2007-07-30",
            "2017-07-10",
            "2020-07-06",
            "2024-07-22",
            "2027-07-19",
        )
        self.assertHolidayName(f"ชดเชย{name}", obs_dts)
        self.assertNoNonObservedHoliday(obs_dts)
        self.assertNoHoliday("2027-07-20")

    def test_shared_in_lieu_day(self):
        self.assertHolidayName("ชดเชยวันขึ้นปีใหม่", "1995-01-02", "2006-01-02", "2023-01-02")
        self.assertHolidayName("ชดเชยวันวิสาขบูชา", "2023-06-05")
        self.assertHolidayName(
            "ชดเชยวันเฉลิมพระชนมพรรษาสมเด็จพระนางเจ้าสุทิดา พัชรสุธาพิมลลักษณ พระบรมราชินี",
            "2023-06-05",
        )
        self.assertNoHoliday(
            "1995-01-03",
            "2006-01-03",
            "2023-01-03",
            "2023-06-06",
        )

    def test_in_lieu_day_after_holiday(self):
        self.assertHolidayName("ชดเชยวันฉัตรมงคล", "2001-05-08")
        self.assertNoHolidayName("ชดเชยวันฉัตรมงคล", "2001-05-07")

    def test_1993(self):
        self.assertHolidayDatesInYear(
            1993,
            "1993-01-01",
            "1993-03-07",
            "1993-03-08",
            "1993-04-06",
            "1993-04-12",
            "1993-04-13",
            "1993-04-14",
            "1993-05-01",
            "1993-05-03",
            "1993-05-05",
            "1993-06-04",
            "1993-07-01",
            "1993-08-03",
            "1993-08-12",
            "1993-10-23",
            "1993-10-25",
            "1993-12-05",
            "1993-12-06",
            "1993-12-10",
            "1993-12-31",
        )

    def test_2017(self):
        self.assertHolidayDatesInYear(
            2017,
            "2017-01-01",
            "2017-01-02",
            "2017-01-03",
            "2017-02-11",
            "2017-02-13",
            "2017-04-06",
            "2017-04-13",
            "2017-04-14",
            "2017-04-15",
            "2017-05-01",
            "2017-05-10",
            "2017-07-01",
            "2017-07-08",
            "2017-07-10",
            "2017-07-28",
            "2017-08-12",
            "2017-08-14",
            "2017-10-13",
            "2017-10-23",
            "2017-10-26",
            "2017-12-05",
            "2017-12-10",
            "2017-12-11",
            "2017-12-31",
        )

    def test_2020(self):
        self.assertHolidayDatesInYear(
            2020,
            "2020-01-01",
            "2020-02-08",
            "2020-02-10",
            "2020-04-06",
            "2020-05-01",
            "2020-05-04",
            "2020-05-06",
            "2020-06-03",
            "2020-07-05",
            "2020-07-06",
            "2020-07-27",
            "2020-07-28",
            "2020-08-12",
            "2020-09-04",
            "2020-09-07",
            "2020-10-13",
            "2020-10-23",
            "2020-12-05",
            "2020-12-07",
            "2020-12-10",
            "2020-12-11",
            "2020-12-31",
        )

    def test_2022(self):
        self.assertHolidayDatesInYear(
            2022,
            "2022-01-01",
            "2022-01-03",
            "2022-02-16",
            "2022-04-06",
            "2022-04-13",
            "2022-04-14",
            "2022-04-15",
            "2022-05-01",
            "2022-05-02",
            "2022-05-04",
            "2022-05-15",
            "2022-05-16",
            "2022-06-03",
            "2022-07-13",
            "2022-07-28",
            "2022-07-29",
            "2022-08-12",
            "2022-10-13",
            "2022-10-14",
            "2022-10-23",
            "2022-10-24",
            "2022-12-05",
            "2022-12-10",
            "2022-12-12",
            "2022-12-31",
        )

    def test_2023(self):
        self.assertHolidayDatesInYear(
            2023,
            "2023-01-01",
            "2023-01-02",
            "2023-03-06",
            "2023-04-06",
            "2023-04-13",
            "2023-04-14",
            "2023-04-15",
            "2023-05-01",
            "2023-05-04",
            "2023-05-05",
            "2023-06-03",
            "2023-06-05",
            "2023-07-28",
            "2023-08-01",
            "2023-08-12",
            "2023-08-14",
            "2023-10-13",
            "2023-10-23",
            "2023-12-05",
            "2023-12-10",
            "2023-12-11",
            "2023-12-29",
            "2023-12-31",
        )

    def test_2024(self):
        self.assertHolidayDatesInYear(
            2024,
            "2024-01-01",
            "2024-02-24",
            "2024-02-26",
            "2024-04-06",
            "2024-04-08",
            "2024-04-12",
            "2024-04-13",
            "2024-04-14",
            "2024-04-15",
            "2024-04-16",
            "2024-05-01",
            "2024-05-04",
            "2024-05-06",
            "2024-05-22",
            "2024-06-03",
            "2024-07-20",
            "2024-07-22",
            "2024-07-28",
            "2024-07-29",
            "2024-08-12",
            "2024-10-13",
            "2024-10-14",
            "2024-10-23",
            "2024-12-05",
            "2024-12-10",
            "2024-12-31",
        )

    def test_2025(self):
        self.assertHolidayDatesInYear(
            2025,
            "2025-01-01",
            "2025-02-12",
            "2025-04-06",
            "2025-04-07",
            "2025-04-13",
            "2025-04-14",
            "2025-04-15",
            "2025-05-01",
            "2025-05-04",
            "2025-05-05",
            "2025-05-11",
            "2025-05-12",
            "2025-06-02",
            "2025-06-03",
            "2025-07-10",
            "2025-07-28",
            "2025-08-11",
            "2025-08-12",
            "2025-10-13",
            "2025-10-23",
            "2025-12-05",
            "2025-12-10",
            "2025-12-31",
        )

    def test_2027(self):
        self.assertHolidayDatesInYear(
            2027,
            "2027-01-01",
            "2027-02-21",
            "2027-02-22",
            "2027-04-06",
            "2027-04-13",
            "2027-04-14",
            "2027-04-15",
            "2027-05-01",
            "2027-05-03",
            "2027-05-04",
            "2027-05-20",
            "2027-06-03",
            "2027-07-18",
            "2027-07-19",
            "2027-07-28",
            "2027-08-12",
            "2027-10-13",
            "2027-10-23",
            "2027-10-25",
            "2027-12-05",
            "2027-12-06",
            "2027-12-10",
            "2027-12-31",
        )

    def test_l10n_default(self):
        self.assertLocalizedHolidays(
            ("2026-01-01", "วันขึ้นปีใหม่"),
            ("2026-01-02", "วันหยุดพิเศษ (เพิ่มเติม)"),
            ("2026-03-03", "วันมาฆบูชา"),
            (
                "2026-04-06",
                "วันพระบาทสมเด็จพระพุทธยอดฟ้าจุฬาโลกมหาราช และวันที่ระลึกมหาจักรีบรมราชวงศ์",
            ),
            ("2026-04-13", "วันสงกรานต์"),
            ("2026-04-14", "วันสงกรานต์"),
            ("2026-04-15", "วันสงกรานต์"),
            ("2026-05-01", "วันแรงงานแห่งชาติ"),
            ("2026-05-04", "วันฉัตรมงคล"),
            ("2026-05-31", "วันวิสาขบูชา"),
            ("2026-06-01", "ชดเชยวันวิสาขบูชา"),
            (
                "2026-06-03",
                "วันเฉลิมพระชนมพรรษาสมเด็จพระนางเจ้าสุทิดา พัชรสุธาพิมลลักษณ พระบรมราชินี",
            ),
            (
                "2026-07-28",
                "วันเฉลิมพระชนมพรรษาพระบาทสมเด็จพระปรเมนทรรามาธิบดี"
                "ศรีสินทรมหาวชิราลงกรณ พระวชิรเกล้าเจ้าอยู่หัว",
            ),
            ("2026-07-29", "วันอาสาฬหบูชา"),
            ("2026-08-12", "วันเฉลิมพระชนมพรรษาสมเด็จพระบรมราชชนนีพันปีหลวง; วันแม่แห่งชาติ"),
            ("2026-10-13", "วันนวมินทรมหาราช"),
            ("2026-10-16", "วันหยุดพิเศษ (เพิ่มเติม)"),
            ("2026-10-23", "วันปิยมหาราช"),
            (
                "2026-12-05",
                "วันคล้ายวันเฉลิมพระชนมพรรษาพระบาทสมเด็จพระบรมชนกาธิเบศร "
                "มหาภูมิพลอดุลยเดชมหาราช บรมนาถบพิตร; วันชาติ; วันพ่อแห่งชาติ",
            ),
            (
                "2026-12-07",
                "ชดเชยวันคล้ายวันเฉลิมพระชนมพรรษาพระบาทสมเด็จพระบรมชนกาธิเบศร "
                "มหาภูมิพลอดุลยเดชมหาราช บรมนาถบพิตร; ชดเชยวันชาติ; ชดเชยวันพ่อแห่งชาติ",
            ),
            ("2026-12-10", "วันรัฐธรรมนูญ"),
            ("2026-12-31", "วันสิ้นปี"),
        )

    def test_l10n_en_us(self):
        self.assertLocalizedHolidays(
            "en_US",
            ("2026-01-01", "New Year's Day"),
            ("2026-01-02", "Bridge Public Holiday"),
            ("2026-03-03", "Makha Bucha"),
            ("2026-04-06", "Chakri Memorial Day"),
            ("2026-04-13", "Songkran Festival"),
            ("2026-04-14", "Songkran Festival"),
            ("2026-04-15", "Songkran Festival"),
            ("2026-05-01", "National Labor Day"),
            ("2026-05-04", "Coronation Day"),
            ("2026-05-31", "Visakha Bucha"),
            ("2026-06-01", "Visakha Bucha (in lieu)"),
            ("2026-06-03", "HM Queen Suthida's Birthday"),
            ("2026-07-28", "HM King Maha Vajiralongkorn's Birthday"),
            ("2026-07-29", "Asarnha Bucha"),
            ("2026-08-12", "HM Queen Sirikit The Queen Mother's Birthday; National Mother's Day"),
            ("2026-10-13", "HM King Bhumibol Adulyadej Memorial Day"),
            ("2026-10-16", "Bridge Public Holiday"),
            ("2026-10-23", "HM King Chulalongkorn Memorial Day"),
            (
                "2026-12-05",
                "HM King Bhumibol Adulyadej the Great's Birthday; National Day; "
                "National Father's Day",
            ),
            (
                "2026-12-07",
                "HM King Bhumibol Adulyadej the Great's Birthday (in lieu); "
                "National Day (in lieu); National Father's Day (in lieu)",
            ),
            ("2026-12-10", "Constitution Day"),
            ("2026-12-31", "New Year's Eve"),
        )

    def test_l10n_uk(self):
        self.assertLocalizedHolidays(
            "uk",
            ("2026-01-01", "Новий рік"),
            ("2026-01-02", "Проміжний вихідний"),
            ("2026-03-03", "Маха Буча"),
            ("2026-04-06", "День памʼяті короля Рами I та династії Чакрі"),
            ("2026-04-13", "Тайський Новий рік"),
            ("2026-04-14", "Тайський Новий рік"),
            ("2026-04-15", "Тайський Новий рік"),
            ("2026-05-01", "Національний день праці"),
            ("2026-05-04", "День коронації"),
            ("2026-05-31", "Вісака Буча"),
            ("2026-06-01", "Вісака Буча (вихідний)"),
            ("2026-06-03", "День народження Її Величності королеви Сутіди"),
            ("2026-07-28", "День народження Його Величності короля Маха Вачіралонгкорна"),
            ("2026-07-29", "Асарна Буча"),
            (
                "2026-08-12",
                "День народження Її Величності королеви-матері Сірікіт; Національний день матері",
            ),
            ("2026-10-13", "День памʼяті Його Величності короля Пуміпона Адульядета"),
            ("2026-10-16", "Проміжний вихідний"),
            ("2026-10-23", "День памʼяті Його Величності короля Чулалонгкорна"),
            (
                "2026-12-05",
                "Національний день; Національний день батька; "
                "Річниця дня народження Його Величності короля Пуміпона Адульядета Великого",
            ),
            (
                "2026-12-07",
                "Національний день (вихідний); Національний день батька (вихідний); "
                "Річниця дня народження Його Величності короля Пуміпона Адульядета Великого "
                "(вихідний)",
            ),
            ("2026-12-10", "День Конституції"),
            ("2026-12-31", "Переддень Нового року"),
        )
