Repository: vacanza/holidays
Catalog: holidays/locale/pap_BQ/LC_MESSAGES/BQ.po
Languages: pap_bq

source: Nieuwjaarsdag
pap_bq: Aña nobo

source: Goede Vrijdag
pap_bq: Bièrnèsantu

source: Eerste Paasdag
pap_bq: Pasku di Resurekshon

source: Tweede Paasdag
pap_bq: Di dos dia di Pasku di Resurekshon

source: Koningsdag
pap_bq: Dia di Rei

source: Koninginnedag
pap_bq: Dia di Reina

source: Dag van de Arbeid
pap_bq: Dia di labor

source: Hemelvaartsdag
pap_bq: Asenshon

source: Eerste Pinksterdag
pap_bq: Dia di Pentekòste

source: Eerste Kerstdag
pap_bq: Pasku

source: Tweede Kerstdag
pap_bq: Di dos dia di Pasku

source: Rincondag
pap_bq: Dia di Rincon

source: Bonairedag
pap_bq: Dia di Boneiru

source: Dag na de carnavalsoptocht
pap_bq: Djaluna di Carnaval

source: Sabadag
pap_bq: Dia di Saba

source: Emancipatiedag
pap_bq: Dia di Emansipashon

source: Statiadag
pap_bq: Dia di Statia

source: Brugdag
pap_bq: Dia Liber
